/**
 * Created by Administrator on 2017/6/6 0006.
 */
angular.module('rsc.directive', [])
/**
 * 采购
 */
    .directive("buy", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='buy' style='width: auto;'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('buy');
                    height.style.height = (window.screen.height + window.screenTop) + 5 + 'px';
                    // height.style.height = window.screen.height - 200 + 'px';
                    var trade = echarts.init(document.getElementById('buy'));
                    var geoCoordMap = {
                        "海门": [121.15, 31.89],
                        "鄂尔多斯": [109.781327, 39.608266],
                        "招远": [120.38, 37.35],
                        "舟山": [122.207216, 29.985295],
                        "齐齐哈尔": [123.97, 47.33],
                        "盐城": [120.13, 33.38],
                        "赤峰": [118.87, 42.28],
                        "青岛": [120.33, 36.07],
                        "乳山": [121.52, 36.89],
                        "金昌": [102.188043, 38.520089],
                        "泉州": [118.58, 24.93],
                        "莱西": [120.53, 36.86],
                        "日照": [119.46, 35.42],
                        "胶南": [119.97, 35.88],
                        "南通": [121.05, 32.08],
                        "拉萨": [91.11, 29.97],
                        "云浮": [112.02, 22.93],
                        "梅州": [116.1, 24.55],
                        "文登": [122.05, 37.2],
                        "上海": [121.48, 31.22],
                        "攀枝花": [101.718637, 26.582347],
                        "威海": [122.1, 37.5],
                        "承德": [117.93, 40.97],
                        "厦门": [118.1, 24.46],
                        "汕尾": [115.375279, 22.786211],
                        "潮州": [116.63, 23.68],
                        "丹东": [124.37, 40.13],
                        "太仓": [121.1, 31.45],
                        "曲靖": [103.79, 25.51],
                        "烟台": [121.39, 37.52],
                        "福州": [119.3, 26.08],
                        "瓦房店": [121.979603, 39.627114],
                        "即墨": [120.45, 36.38],
                        "抚顺": [123.97, 41.97],
                        "玉溪": [102.52, 24.35],
                        "张家口": [114.87, 40.82],
                        "阳泉": [113.57, 37.85],
                        "莱州": [119.942327, 37.177017],
                        "湖州": [120.1, 30.86],
                        "汕头": [116.69, 23.39],
                        "昆山": [120.95, 31.39],
                        "宁波": [121.56, 29.86],
                        "湛江": [110.359377, 21.270708],
                        "揭阳": [116.35, 23.55],
                        "荣成": [122.41, 37.16],
                        "连云港": [119.16, 34.59],
                        "葫芦岛": [120.836932, 40.711052],
                        "常熟": [120.74, 31.64],
                        "东莞": [113.75, 23.04],
                        "河源": [114.68, 23.73],
                        "淮安": [119.15, 33.5],
                        "泰州": [119.9, 32.49],
                        "南宁": [108.33, 22.84],
                        "营口": [122.18, 40.65],
                        "惠州": [114.4, 23.09],
                        "江阴": [120.26, 31.91],
                        "蓬莱": [120.75, 37.8],
                        "韶关": [113.62, 24.84],
                        "嘉峪关": [98.289152, 39.77313],
                        "广州": [113.23, 23.16],
                        "延安": [109.47, 36.6],
                        "太原": [112.53, 37.87],
                        "清远": [113.01, 23.7],
                        "中山": [113.38, 22.52],
                        "昆明": [102.73, 25.04],
                        "寿光": [118.73, 36.86],
                        "盘锦": [122.070714, 41.119997],
                        "长治": [113.08, 36.18],
                        "深圳": [114.07, 22.62],
                        "珠海": [113.52, 22.3],
                        "宿迁": [118.3, 33.96],
                        "咸阳": [108.72, 34.36],
                        "铜川": [109.11, 35.09],
                        "平度": [119.97, 36.77],
                        "佛山": [113.11, 23.05],
                        "海口": [110.35, 20.02],
                        "江门": [113.06, 22.61],
                        "章丘": [117.53, 36.72],
                        "肇庆": [112.44, 23.05],
                        "大连": [121.62, 38.92],
                        "临汾": [111.5, 36.08],
                        "吴江": [120.63, 31.16],
                        "石嘴山": [106.39, 39.04],
                        "沈阳": [123.38, 41.8],
                        "苏州": [120.62, 31.32],
                        "茂名": [110.88, 21.68],
                        "嘉兴": [120.76, 30.77],
                        "长春": [125.35, 43.88],
                        "胶州": [120.03336, 36.264622],
                        "银川": [106.27, 38.47],
                        "张家港": [120.555821, 31.875428],
                        "三门峡": [111.19, 34.76],
                        "锦州": [121.15, 41.13],
                        "南昌": [115.89, 28.68],
                        "柳州": [109.4, 24.33],
                        "三亚": [109.511909, 18.252847],
                        "自贡": [104.778442, 29.33903],
                        "吉林": [126.57, 43.87],
                        "阳江": [111.95, 21.85],
                        "泸州": [105.39, 28.91],
                        "西宁": [101.74, 36.56],
                        "宜宾": [104.56, 29.77],
                        "呼和浩特": [111.65, 40.82],
                        "成都": [104.06, 30.67],
                        "大同": [113.3, 40.12],
                        "镇江": [119.44, 32.2],
                        "桂林": [110.28, 25.29],
                        "张家界": [110.479191, 29.117096],
                        "宜兴": [119.82, 31.36],
                        "北海": [109.12, 21.49],
                        "西安": [108.95, 34.27],
                        "金坛": [119.56, 31.74],
                        "东营": [118.49, 37.46],
                        "牡丹江": [129.58, 44.6],
                        "遵义": [106.9, 27.7],
                        "绍兴": [120.58, 30.01],
                        "扬州": [119.42, 32.39],
                        "常州": [119.95, 31.79],
                        "潍坊": [119.1, 36.62],
                        "重庆": [106.54, 29.59],
                        "台州": [121.420757, 28.656386],
                        "南京": [118.78, 32.04],
                        "滨州": [118.03, 37.36],
                        "贵阳": [106.71, 26.57],
                        "无锡": [120.29, 31.59],
                        "本溪": [123.73, 41.3],
                        "克拉玛依": [84.77, 45.59],
                        "渭南": [109.5, 34.52],
                        "马鞍山": [118.48, 31.56],
                        "宝鸡": [107.15, 34.38],
                        "焦作": [113.21, 35.24],
                        "句容": [119.16, 31.95],
                        "北京": [116.46, 39.92],
                        "徐州": [117.2, 34.26],
                        "衡水": [115.72, 37.72],
                        "包头": [110, 40.58],
                        "绵阳": [104.73, 31.48],
                        "乌鲁木齐": [87.68, 43.77],
                        "枣庄": [117.57, 34.86],
                        "杭州": [120.19, 30.26],
                        "淄博": [118.05, 36.78],
                        "鞍山": [122.85, 41.12],
                        "溧阳": [119.48, 31.43],
                        "库尔勒": [86.06, 41.68],
                        "安阳": [114.35, 36.1],
                        "开封": [114.35, 34.79],
                        "济南": [117, 36.65],
                        "德阳": [104.37, 31.13],
                        "温州": [120.65, 28.01],
                        "九江": [115.97, 29.71],
                        "邯郸": [114.47, 36.6],
                        "临安": [119.72, 30.23],
                        "兰州": [103.73, 36.03],
                        "沧州": [116.83, 38.33],
                        "临沂": [118.35, 35.05],
                        "南充": [106.110698, 30.837793],
                        "天津": [117.2, 39.13],
                        "富阳": [119.95, 30.07],
                        "泰安": [117.13, 36.18],
                        "诸暨": [120.23, 29.71],
                        "郑州": [113.65, 34.76],
                        "哈尔滨": [126.63, 45.75],
                        "聊城": [115.97, 36.45],
                        "芜湖": [118.38, 31.33],
                        "唐山": [118.02, 39.63],
                        "平顶山": [113.29, 33.75],
                        "邢台": [114.48, 37.05],
                        "德州": [116.29, 37.45],
                        "济宁": [116.59, 35.38],
                        "荆州": [112.239741, 30.335165],
                        "宜昌": [111.3, 30.7],
                        "义乌": [120.06, 29.32],
                        "丽水": [119.92, 28.45],
                        "洛阳": [112.44, 34.7],
                        "秦皇岛": [119.57, 39.95],
                        "株洲": [113.16, 27.83],
                        "石家庄": [114.48, 38.03],
                        "莱芜": [117.67, 36.19],
                        "常德": [111.69, 29.05],
                        "保定": [115.48, 38.85],
                        "湘潭": [112.91, 27.87],
                        "金华": [119.64, 29.12],
                        "岳阳": [113.09, 29.37],
                        "长沙": [113, 28.21],
                        "衢州": [118.88, 28.97],
                        "廊坊": [116.7, 39.53],
                        "菏泽": [115.480656, 35.23375],
                        "合肥": [117.27, 31.86],
                        "武汉": [114.31, 30.52],
                        "大庆": [125.03, 46.58]
                    };

                    var data = [
                        {name: "海门", value: 90},
                        {name: "鄂尔多斯", value: 12},
                        {name: "招远", value: 12},
                        {name: "舟山", value: 12},
                        {name: "齐齐哈尔", value: 14},
                        {name: "盐城", value: 15},
                        {name: "赤峰", value: 16},
                        {name: "青岛", value: 18},
                        {name: "乳山", value: 18},
                        {name: "金昌", value: 19},
                        {name: "泉州", value: 21},
                        {name: "莱西", value: 21},
                        {name: "日照", value: 21},
                        {name: "胶南", value: 22},
                        {name: "南通", value: 23},
                        {name: "拉萨", value: 24},
                        {name: "云浮", value: 24},
                        {name: "梅州", value: 25},
                        {name: "文登", value: 25},
                        {name: "上海", value: 25},
                        {name: "攀枝花", value: 25},
                        {name: "威海", value: 25},
                        {name: "承德", value: 25},
                        {name: "厦门", value: 26},
                        {name: "汕尾", value: 26},
                        {name: "潮州", value: 26},
                        {name: "丹东", value: 27},
                        {name: "太仓", value: 27},
                        {name: "曲靖", value: 27},
                        {name: "烟台", value: 28},
                        {name: "福州", value: 29},
                        {name: "瓦房店", value: 30},
                        {name: "即墨", value: 30},
                        {name: "抚顺", value: 31},
                        {name: "玉溪", value: 31},
                        {name: "张家口", value: 31},
                        {name: "阳泉", value: 31},
                        {name: "莱州", value: 32},
                        {name: "湖州", value: 32},
                        {name: "汕头", value: 32},
                        {name: "昆山", value: 33},
                        {name: "宁波", value: 33},
                        {name: "湛江", value: 33},
                        {name: "揭阳", value: 34},
                        {name: "荣成", value: 34},
                        {name: "连云港", value: 35},
                        {name: "葫芦岛", value: 35},
                        {name: "常熟", value: 36},
                        {name: "东莞", value: 36},
                        {name: "河源", value: 36},
                        {name: "淮安", value: 36},
                        {name: "泰州", value: 36},
                        {name: "南宁", value: 37},
                        {name: "营口", value: 37},
                        {name: "惠州", value: 37},
                        {name: "江阴", value: 37},
                        {name: "蓬莱", value: 37},
                        {name: "韶关", value: 38},
                        {name: "嘉峪关", value: 38},
                        {name: "广州", value: 38},
                        {name: "延安", value: 38},
                        {name: "太原", value: 39},
                        {name: "清远", value: 39},
                        {name: "中山", value: 39},
                        {name: "昆明", value: 39},
                        {name: "寿光", value: 40},
                        {name: "盘锦", value: 40},
                        {name: "长治", value: 41},
                        {name: "深圳", value: 41},
                        {name: "珠海", value: 42},
                        {name: "宿迁", value: 43},
                        {name: "咸阳", value: 43},
                        {name: "铜川", value: 44},
                        {name: "平度", value: 44},
                        {name: "佛山", value: 44},
                        {name: "海口", value: 44},
                        {name: "江门", value: 45},
                        {name: "章丘", value: 45},
                        {name: "肇庆", value: 46},
                        {name: "大连", value: 47},
                        {name: "临汾", value: 47},
                        {name: "吴江", value: 47},
                        {name: "石嘴山", value: 49},
                        {name: "沈阳", value: 50},
                        {name: "苏州", value: 50},
                        {name: "茂名", value: 50},
                        {name: "嘉兴", value: 51},
                        {name: "长春", value: 51},
                        {name: "胶州", value: 52},
                        {name: "银川", value: 52},
                        {name: "张家港", value: 52},
                        {name: "三门峡", value: 53},
                        {name: "锦州", value: 54},
                        {name: "南昌", value: 54},
                        {name: "柳州", value: 54},
                        {name: "三亚", value: 54},
                        {name: "自贡", value: 56},
                        {name: "吉林", value: 56},
                        {name: "阳江", value: 57},
                        {name: "泸州", value: 57},
                        {name: "西宁", value: 57},
                        {name: "宜宾", value: 58},
                        {name: "呼和浩特", value: 58},
                        {name: "成都", value: 58},
                        {name: "大同", value: 58},
                        {name: "镇江", value: 59},
                        {name: "桂林", value: 59},
                        {name: "张家界", value: 59},
                        {name: "宜兴", value: 59},
                        {name: "北海", value: 60},
                        {name: "西安", value: 61},
                        {name: "金坛", value: 62},
                        {name: "东营", value: 62},
                        {name: "牡丹江", value: 63},
                        {name: "遵义", value: 63},
                        {name: "绍兴", value: 63},
                        {name: "扬州", value: 64},
                        {name: "常州", value: 64},
                        {name: "潍坊", value: 65},
                        {name: "重庆", value: 66},
                        {name: "台州", value: 67},
                        {name: "南京", value: 67},
                        {name: "滨州", value: 70},
                        {name: "贵阳", value: 71},
                        {name: "无锡", value: 71},
                        {name: "本溪", value: 71},
                        {name: "克拉玛依", value: 72},
                        {name: "渭南", value: 72},
                        {name: "马鞍山", value: 72},
                        {name: "宝鸡", value: 72},
                        {name: "焦作", value: 75},
                        {name: "句容", value: 75},
                        {name: "北京", value: 79},
                        {name: "徐州", value: 79},
                        {name: "衡水", value: 80},
                        {name: "包头", value: 80},
                        {name: "绵阳", value: 80},
                        {name: "乌鲁木齐", value: 84},
                        {name: "枣庄", value: 84},
                        {name: "杭州", value: 84},
                        {name: "淄博", value: 85},
                        {name: "鞍山", value: 86},
                        {name: "溧阳", value: 86},
                        {name: "库尔勒", value: 86},
                        {name: "安阳", value: 90},
                        {name: "开封", value: 90},
                        {name: "济南", value: 92},
                        {name: "德阳", value: 93},
                        {name: "温州", value: 95},
                        {name: "九江", value: 96},
                        {name: "邯郸", value: 98},
                        {name: "临安", value: 99},
                        {name: "兰州", value: 99},
                        {name: "沧州", value: 100},
                        {name: "临沂", value: 103},
                        {name: "南充", value: 104},
                        {name: "天津", value: 105},
                        {name: "富阳", value: 106},
                        {name: "泰安", value: 112},
                        {name: "诸暨", value: 112},
                        {name: "郑州", value: 113},
                        {name: "哈尔滨", value: 114},
                        {name: "聊城", value: 116},
                        {name: "芜湖", value: 117},
                        {name: "唐山", value: 119},
                        {name: "平顶山", value: 119},
                        {name: "邢台", value: 119},
                        {name: "德州", value: 120},
                        {name: "济宁", value: 120},
                        {name: "荆州", value: 127},
                        {name: "宜昌", value: 130},
                        {name: "义乌", value: 132},
                        {name: "丽水", value: 133},
                        {name: "洛阳", value: 134},
                        {name: "秦皇岛", value: 136},
                        {name: "株洲", value: 143},
                        {name: "石家庄", value: 147},
                        {name: "莱芜", value: 148},
                        {name: "常德", value: 152},
                        {name: "保定", value: 153},
                        {name: "湘潭", value: 154},
                        {name: "金华", value: 157},
                        {name: "岳阳", value: 169},
                        {name: "长沙", value: 175},
                        {name: "衢州", value: 177},
                        {name: "廊坊", value: 193},
                        {name: "菏泽", value: 194},
                        {name: "合肥", value: 229},
                        {name: "武汉", value: 273},
                        {name: "大庆", value: 279}
                    ];

                    var convertData = function (data) {
                        var res = [];
                        for (var i = 0; i < data.length; i++) {
                            var geoCoord = geoCoordMap[data[i].name];
                            if (geoCoord) {
                                res.push({
                                    name: data[i].name,
                                    value: geoCoord.concat(data[i].value)
                                });
                            }
                        }
                        return res;
                    };
                    var convertedData = [
                        convertData(data),
                        convertData(data.sort(function (a, b) {
                            return b.value - a.value;
                        }).slice(0, 6))
                    ];


                    var option = {
                        backgroundColor: '#404a59',
                        animation: true,
                        animationDuration: 1000,
                        animationEasing: 'cubicInOut',
                        animationDurationUpdate: 1000,
                        animationEasingUpdate: 'cubicInOut',
                        title: [
                            {
                                text: '全国主要城市 交易量',
                                subtext: '由日升昌大数据中心提供计算服务',
                                sublink: 'http://www.rsc365.com',
                                left: 'center',
                                textStyle: {
                                    color: '#fff'
                                }
                            },
                            {
                                id: 'statistic',
                                right: 120,
                                top: 40,
                                width: 100,
                                textStyle: {
                                    color: '#fff',
                                    fontSize: 16
                                }
                            }
                        ],
                        toolbox: {
                            iconStyle: {
                                normal: {
                                    borderColor: '#fff'
                                },
                                emphasis: {
                                    borderColor: '#b1e4ff'
                                }
                            }
                        },
                        brush: {
                            outOfBrush: {
                                color: '#abc'
                            },
                            brushStyle: {
                                borderWidth: 2,
                                color: 'rgba(0,0,0,0.2)',
                                borderColor: 'rgba(0,0,0,0.5)',
                            },
                            seriesIndex: [0, 1],
                            throttleType: 'debounce',
                            throttleDelay: 300,
                            geoIndex: 0
                        },
                        geo: { //地图视图配置
                            map: 'china',
                            left: '200',
                            top: '80',
                            right: '20%',
                            center: [117.98561551896913, 31.205000490896193],
                            zoom: 0.8,
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48', // 地图背景色
                                    borderColor: '#111' // 地图边框色
                                },
                                emphasis: {
                                    areaColor: '#2a333d' //鼠标hover颜色
                                }
                            }
                        },
                        tooltip: {
                            trigger: 'item'
                        },
                        grid: {
                            right: 40,
                            top: 100,
                            bottom: 40,
                            width: '30%'
                        },
                        xAxis: {
                            type: 'value',
                            scale: true,
                            position: 'top',
                            boundaryGap: false,
                            splitLine: {show: false},
                            axisLine: {show: false},
                            axisTick: {show: false},
                            axisLabel: {margin: 2, textStyle: {color: '#aaa'}},
                        },
                        yAxis: {
                            type: 'category',
                            name: 'TOP 20',
                            nameGap: 16,
                            axisLine: {show: false, lineStyle: {color: '#ddd'}},
                            axisTick: {show: false, lineStyle: {color: '#ddd'}},
                            axisLabel: {interval: 0, textStyle: {color: '#ddd'}},
                            data: []
                        },
                        series: [
                            {
                                name: 'pm2.5',
                                type: 'scatter',
                                coordinateSystem: 'geo',
                                data: convertedData[0],
                                symbolSize: function (val) {
                                    return Math.max(val[2] / 10, 8);
                                },
                                label: {
                                    normal: {
                                        formatter: '{b}',
                                        position: 'right',
                                        show: false
                                    },
                                    emphasis: {
                                        show: true
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#ddb926'
                                    }
                                }
                            },
                            {
                                name: 'Top 5',
                                type: 'effectScatter',
                                coordinateSystem: 'geo',
                                data: convertedData[1],
                                symbolSize: function (val) {
                                    return Math.max(val[2] / 10, 8);
                                },
                                showEffectOn: 'emphasis',
                                rippleEffect: {
                                    brushType: 'stroke'
                                },
                                hoverAnimation: true,
                                label: {
                                    normal: {
                                        formatter: '{b}',
                                        position: 'right',
                                        show: true
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#f4e925',
                                        shadowBlur: 10,
                                        shadowColor: '#333'
                                    }
                                },
                                zlevel: 1
                            },
                            {
                                id: 'bar',
                                zlevel: 2,
                                type: 'bar',
                                symbol: 'none',
                                itemStyle: {
                                    normal: {
                                        color: '#ddb926'
                                    }
                                },
                                data: []
                            }
                        ]
                    };

                    trade.on('brushselected', renderBrushed);

                    setTimeout(function () {
                        trade.dispatchAction({
                            type: 'brush',
                            areas: [
                                {
                                    geoIndex: 0,
                                    brushType: 'polygon',
                                    // 默认覆盖
                                    coordRange: [
                                        [119.72, 34.85],
                                        [119.68, 34.85],
                                        [119.5, 34.84],
                                        [119.19, 34.77],
                                        [118.76, 34.63],
                                        [118.6, 34.6],
                                        [118.46, 34.6],
                                        [118.33, 34.57],
                                        [118.05, 34.56],
                                        [117.6, 34.56],
                                        [117.41, 34.56],
                                        [117.25, 34.56],
                                        [117.11, 34.56],
                                        [117.02, 34.56],
                                        [117, 34.56],
                                        [116.94, 34.56],
                                        [116.94, 34.55],
                                        [116.9, 34.5],
                                        [116.88, 34.44], [116.88, 34.37], [116.88, 34.33], [116.88, 34.24], [116.92, 34.15], [116.98, 34.09], [117.05, 34.06], [117.19, 33.96], [117.29, 33.9], [117.43, 33.8], [117.49, 33.75], [117.54, 33.68], [117.6, 33.65], [117.62, 33.61], [117.64, 33.59], [117.68, 33.58], [117.7, 33.52], [117.74, 33.5], [117.74, 33.46], [117.8, 33.44], [117.82, 33.41], [117.86, 33.37], [117.9, 33.3], [117.9, 33.28], [117.9, 33.27], [118.09, 32.97], [118.21, 32.7], [118.29, 32.56], [118.31, 32.5], [118.35, 32.46], [118.35, 32.42], [118.35, 32.36], [118.35, 32.34], [118.37, 32.24], [118.37, 32.14], [118.37, 32.09], [118.44, 32.05], [118.46, 32.01], [118.54, 31.98], [118.6, 31.93], [118.68, 31.86], [118.72, 31.8], [118.74, 31.78], [118.76, 31.74], [118.78, 31.7], [118.82, 31.64], [118.82, 31.62], [118.86, 31.58], [118.86, 31.55], [118.88, 31.54], [118.88, 31.52], [118.9, 31.51], [118.91, 31.48], [118.93, 31.43], [118.95, 31.4], [118.97, 31.39], [118.97, 31.37], [118.97, 31.34], [118.97, 31.27], [118.97, 31.21], [118.97, 31.17], [118.97, 31.12], [118.97, 31.02], [118.97, 30.93], [118.97, 30.87], [118.97, 30.85], [118.95, 30.8], [118.95, 30.77], [118.95, 30.76], [118.93, 30.7], [118.91, 30.63], [118.91, 30.61], [118.91, 30.6], [118.9, 30.6], [118.88, 30.54], [118.88, 30.51], [118.86, 30.51], [118.86, 30.46], [118.72, 30.18], [118.68, 30.1], [118.66, 30.07], [118.62, 29.91], [118.56, 29.73], [118.52, 29.63], [118.48, 29.51], [118.44, 29.42], [118.44, 29.32], [118.43, 29.19], [118.43, 29.14], [118.43, 29.08], [118.44, 29.05], [118.46, 29.05], [118.6, 28.95], [118.64, 28.94], [119.07, 28.51], [119.25, 28.41], [119.36, 28.28], [119.46, 28.19], [119.54, 28.13], [119.66, 28.03], [119.78, 28], [119.87, 27.94], [120.03, 27.86], [120.17, 27.79], [120.23, 27.76], [120.3, 27.72], [120.42, 27.66], [120.52, 27.64], [120.58, 27.63], [120.64, 27.63], [120.77, 27.63], [120.89, 27.61], [120.97, 27.6], [121.07, 27.59], [121.15, 27.59], [121.28, 27.59], [121.38, 27.61], [121.56, 27.73], [121.73, 27.89], [122.03, 28.2], [122.3, 28.5], [122.46, 28.72], [122.5, 28.77], [122.54, 28.82], [122.56, 28.82], [122.58, 28.85], [122.6, 28.86], [122.61, 28.91], [122.71, 29.02], [122.73, 29.08], [122.93, 29.44], [122.99, 29.54], [123.03, 29.66], [123.05, 29.73], [123.16, 29.92], [123.24, 30.02], [123.28, 30.13], [123.32, 30.29], [123.36, 30.36], [123.36, 30.55], [123.36, 30.74], [123.36, 31.05], [123.36, 31.14], [123.36, 31.26], [123.38, 31.42], [123.46, 31.74], [123.48, 31.83], [123.48, 31.95], [123.46, 32.09], [123.34, 32.25], [123.22, 32.39], [123.12, 32.46], [123.07, 32.48], [123.05, 32.49], [122.97, 32.53], [122.91, 32.59], [122.83, 32.81], [122.77, 32.87], [122.71, 32.9], [122.56, 32.97], [122.38, 33.05], [122.3, 33.12], [122.26, 33.15], [122.22, 33.21], [122.22, 33.3], [122.22, 33.39], [122.18, 33.44], [122.07, 33.56], [121.99, 33.69], [121.89, 33.78], [121.69, 34.02], [121.66, 34.05], [121.64, 34.08]
                                    ]
                                }
                            ]
                        });
                    }, 0);


                    function renderBrushed(params) {
                        var mainSeries = params.batch[0].selected[0];
                        var selectedItems = [];
                        var categoryData = [];
                        var barData = [];
                        var maxBar = 30;
                        var sum = 0;
                        var count = 0;

                        for (var i = 0; i < mainSeries.dataIndex.length; i++) {
                            var rawIndex = mainSeries.dataIndex[i];
                            var dataItem = convertedData[0][rawIndex];
                            var pmValue = dataItem.value[2];

                            sum += pmValue;
                            count++;

                            selectedItems.push(dataItem);
                        }

                        selectedItems.sort(function (a, b) {
                            return a.value[2] - b.value[2];
                        });

                        for (var i = 0; i < Math.min(selectedItems.length, maxBar); i++) {
                            categoryData.push(selectedItems[i].name);
                            barData.push(selectedItems[i].value[2]);
                        }

                        this.setOption({
                            yAxis: {
                                data: categoryData
                            },
                            xAxis: {
                                axisLabel: {show: !!count}
                            },
                            title: {
                                id: 'statistic',
                                text: count ? '平均: ' + (sum / count).toFixed(4) : ''
                            },
                            series: {
                                id: 'bar',
                                data: barData
                            }
                        });
                    }

                    trade.setOption(option);
                })
            }
        };
    }])
    /**
     * 销售
     */
    .directive("sell", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='sell' style='width: auto'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('sell');
                    height.style.height = (window.screen.height + window.screenTop) + 5 + 'px';
                    var trade = echarts.init(document.getElementById('sell'));
                    var geoCoordMap = {
                        "海门": [121.15, 31.89],
                        "鄂尔多斯": [109.781327, 39.608266],
                        "招远": [120.38, 37.35],
                        "舟山": [122.207216, 29.985295],
                        "齐齐哈尔": [123.97, 47.33],
                        "盐城": [120.13, 33.38],
                        "赤峰": [118.87, 42.28],
                        "青岛": [120.33, 36.07],
                        "乳山": [121.52, 36.89],
                        "金昌": [102.188043, 38.520089],
                        "泉州": [118.58, 24.93],
                        "莱西": [120.53, 36.86],
                        "日照": [119.46, 35.42],
                        "胶南": [119.97, 35.88],
                        "南通": [121.05, 32.08],
                        "拉萨": [91.11, 29.97],
                        "云浮": [112.02, 22.93],
                        "梅州": [116.1, 24.55],
                        "文登": [122.05, 37.2],
                        "上海": [121.48, 31.22],
                        "攀枝花": [101.718637, 26.582347],
                        "威海": [122.1, 37.5],
                        "承德": [117.93, 40.97],
                        "厦门": [118.1, 24.46],
                        "汕尾": [115.375279, 22.786211],
                        "潮州": [116.63, 23.68],
                        "丹东": [124.37, 40.13],
                        "太仓": [121.1, 31.45],
                        "曲靖": [103.79, 25.51],
                        "烟台": [121.39, 37.52],
                        "福州": [119.3, 26.08],
                        "瓦房店": [121.979603, 39.627114],
                        "即墨": [120.45, 36.38],
                        "抚顺": [123.97, 41.97],
                        "玉溪": [102.52, 24.35],
                        "张家口": [114.87, 40.82],
                        "阳泉": [113.57, 37.85],
                        "莱州": [119.942327, 37.177017],
                        "湖州": [120.1, 30.86],
                        "汕头": [116.69, 23.39],
                        "昆山": [120.95, 31.39],
                        "宁波": [121.56, 29.86],
                        "湛江": [110.359377, 21.270708],
                        "揭阳": [116.35, 23.55],
                        "荣成": [122.41, 37.16],
                        "连云港": [119.16, 34.59],
                        "葫芦岛": [120.836932, 40.711052],
                        "常熟": [120.74, 31.64],
                        "东莞": [113.75, 23.04],
                        "河源": [114.68, 23.73],
                        "淮安": [119.15, 33.5],
                        "泰州": [119.9, 32.49],
                        "南宁": [108.33, 22.84],
                        "营口": [122.18, 40.65],
                        "惠州": [114.4, 23.09],
                        "江阴": [120.26, 31.91],
                        "蓬莱": [120.75, 37.8],
                        "韶关": [113.62, 24.84],
                        "嘉峪关": [98.289152, 39.77313],
                        "广州": [113.23, 23.16],
                        "延安": [109.47, 36.6],
                        "太原": [112.53, 37.87],
                        "清远": [113.01, 23.7],
                        "中山": [113.38, 22.52],
                        "昆明": [102.73, 25.04],
                        "寿光": [118.73, 36.86],
                        "盘锦": [122.070714, 41.119997],
                        "长治": [113.08, 36.18],
                        "深圳": [114.07, 22.62],
                        "珠海": [113.52, 22.3],
                        "宿迁": [118.3, 33.96],
                        "咸阳": [108.72, 34.36],
                        "铜川": [109.11, 35.09],
                        "平度": [119.97, 36.77],
                        "佛山": [113.11, 23.05],
                        "海口": [110.35, 20.02],
                        "江门": [113.06, 22.61],
                        "章丘": [117.53, 36.72],
                        "肇庆": [112.44, 23.05],
                        "大连": [121.62, 38.92],
                        "临汾": [111.5, 36.08],
                        "吴江": [120.63, 31.16],
                        "石嘴山": [106.39, 39.04],
                        "沈阳": [123.38, 41.8],
                        "苏州": [120.62, 31.32],
                        "茂名": [110.88, 21.68],
                        "嘉兴": [120.76, 30.77],
                        "长春": [125.35, 43.88],
                        "胶州": [120.03336, 36.264622],
                        "银川": [106.27, 38.47],
                        "张家港": [120.555821, 31.875428],
                        "三门峡": [111.19, 34.76],
                        "锦州": [121.15, 41.13],
                        "南昌": [115.89, 28.68],
                        "柳州": [109.4, 24.33],
                        "三亚": [109.511909, 18.252847],
                        "自贡": [104.778442, 29.33903],
                        "吉林": [126.57, 43.87],
                        "阳江": [111.95, 21.85],
                        "泸州": [105.39, 28.91],
                        "西宁": [101.74, 36.56],
                        "宜宾": [104.56, 29.77],
                        "呼和浩特": [111.65, 40.82],
                        "成都": [104.06, 30.67],
                        "大同": [113.3, 40.12],
                        "镇江": [119.44, 32.2],
                        "桂林": [110.28, 25.29],
                        "张家界": [110.479191, 29.117096],
                        "宜兴": [119.82, 31.36],
                        "北海": [109.12, 21.49],
                        "西安": [108.95, 34.27],
                        "金坛": [119.56, 31.74],
                        "东营": [118.49, 37.46],
                        "牡丹江": [129.58, 44.6],
                        "遵义": [106.9, 27.7],
                        "绍兴": [120.58, 30.01],
                        "扬州": [119.42, 32.39],
                        "常州": [119.95, 31.79],
                        "潍坊": [119.1, 36.62],
                        "重庆": [106.54, 29.59],
                        "台州": [121.420757, 28.656386],
                        "南京": [118.78, 32.04],
                        "滨州": [118.03, 37.36],
                        "贵阳": [106.71, 26.57],
                        "无锡": [120.29, 31.59],
                        "本溪": [123.73, 41.3],
                        "克拉玛依": [84.77, 45.59],
                        "渭南": [109.5, 34.52],
                        "马鞍山": [118.48, 31.56],
                        "宝鸡": [107.15, 34.38],
                        "焦作": [113.21, 35.24],
                        "句容": [119.16, 31.95],
                        "北京": [116.46, 39.92],
                        "徐州": [117.2, 34.26],
                        "衡水": [115.72, 37.72],
                        "包头": [110, 40.58],
                        "绵阳": [104.73, 31.48],
                        "乌鲁木齐": [87.68, 43.77],
                        "枣庄": [117.57, 34.86],
                        "杭州": [120.19, 30.26],
                        "淄博": [118.05, 36.78],
                        "鞍山": [122.85, 41.12],
                        "溧阳": [119.48, 31.43],
                        "库尔勒": [86.06, 41.68],
                        "安阳": [114.35, 36.1],
                        "开封": [114.35, 34.79],
                        "济南": [117, 36.65],
                        "德阳": [104.37, 31.13],
                        "温州": [120.65, 28.01],
                        "九江": [115.97, 29.71],
                        "邯郸": [114.47, 36.6],
                        "临安": [119.72, 30.23],
                        "兰州": [103.73, 36.03],
                        "沧州": [116.83, 38.33],
                        "临沂": [118.35, 35.05],
                        "南充": [106.110698, 30.837793],
                        "天津": [117.2, 39.13],
                        "富阳": [119.95, 30.07],
                        "泰安": [117.13, 36.18],
                        "诸暨": [120.23, 29.71],
                        "郑州": [113.65, 34.76],
                        "哈尔滨": [126.63, 45.75],
                        "聊城": [115.97, 36.45],
                        "芜湖": [118.38, 31.33],
                        "唐山": [118.02, 39.63],
                        "平顶山": [113.29, 33.75],
                        "邢台": [114.48, 37.05],
                        "德州": [116.29, 37.45],
                        "济宁": [116.59, 35.38],
                        "荆州": [112.239741, 30.335165],
                        "宜昌": [111.3, 30.7],
                        "义乌": [120.06, 29.32],
                        "丽水": [119.92, 28.45],
                        "洛阳": [112.44, 34.7],
                        "秦皇岛": [119.57, 39.95],
                        "株洲": [113.16, 27.83],
                        "石家庄": [114.48, 38.03],
                        "莱芜": [117.67, 36.19],
                        "常德": [111.69, 29.05],
                        "保定": [115.48, 38.85],
                        "湘潭": [112.91, 27.87],
                        "金华": [119.64, 29.12],
                        "岳阳": [113.09, 29.37],
                        "长沙": [113, 28.21],
                        "衢州": [118.88, 28.97],
                        "廊坊": [116.7, 39.53],
                        "菏泽": [115.480656, 35.23375],
                        "合肥": [117.27, 31.86],
                        "武汉": [114.31, 30.52],
                        "大庆": [125.03, 46.58]
                    };

                    var data = [
                        {name: "海门", value: 9},
                        {name: "鄂尔多斯", value: 12},
                        {name: "招远", value: 12},
                        {name: "舟山", value: 12},
                        {name: "齐齐哈尔", value: 14},
                        {name: "盐城", value: 15},
                        {name: "赤峰", value: 16},
                        {name: "青岛", value: 18},
                        {name: "乳山", value: 18},
                        {name: "金昌", value: 19},
                        {name: "泉州", value: 21},
                        {name: "莱西", value: 21},
                        {name: "日照", value: 21},
                        {name: "胶南", value: 22},
                        {name: "南通", value: 23},
                        {name: "拉萨", value: 24},
                        {name: "云浮", value: 24},
                        {name: "梅州", value: 25},
                        {name: "文登", value: 25},
                        {name: "上海", value: 25},
                        {name: "攀枝花", value: 25},
                        {name: "威海", value: 25},
                        {name: "承德", value: 25},
                        {name: "厦门", value: 26},
                        {name: "汕尾", value: 26},
                        {name: "潮州", value: 26},
                        {name: "丹东", value: 27},
                        {name: "太仓", value: 27},
                        {name: "曲靖", value: 27},
                        {name: "烟台", value: 28},
                        {name: "福州", value: 29},
                        {name: "瓦房店", value: 30},
                        {name: "即墨", value: 30},
                        {name: "抚顺", value: 31},
                        {name: "玉溪", value: 31},
                        {name: "张家口", value: 31},
                        {name: "阳泉", value: 31},
                        {name: "莱州", value: 32},
                        {name: "湖州", value: 32},
                        {name: "汕头", value: 32},
                        {name: "昆山", value: 33},
                        {name: "宁波", value: 33},
                        {name: "湛江", value: 33},
                        {name: "揭阳", value: 34},
                        {name: "荣成", value: 34},
                        {name: "连云港", value: 35},
                        {name: "葫芦岛", value: 35},
                        {name: "常熟", value: 36},
                        {name: "东莞", value: 36},
                        {name: "河源", value: 36},
                        {name: "淮安", value: 36},
                        {name: "泰州", value: 36},
                        {name: "南宁", value: 37},
                        {name: "营口", value: 37},
                        {name: "惠州", value: 37},
                        {name: "江阴", value: 37},
                        {name: "蓬莱", value: 37},
                        {name: "韶关", value: 38},
                        {name: "嘉峪关", value: 38},
                        {name: "广州", value: 38},
                        {name: "延安", value: 38},
                        {name: "太原", value: 39},
                        {name: "清远", value: 39},
                        {name: "中山", value: 39},
                        {name: "昆明", value: 39},
                        {name: "寿光", value: 40},
                        {name: "盘锦", value: 40},
                        {name: "长治", value: 41},
                        {name: "深圳", value: 41},
                        {name: "珠海", value: 42},
                        {name: "宿迁", value: 43},
                        {name: "咸阳", value: 43},
                        {name: "铜川", value: 44},
                        {name: "平度", value: 44},
                        {name: "佛山", value: 44},
                        {name: "海口", value: 44},
                        {name: "江门", value: 45},
                        {name: "章丘", value: 45},
                        {name: "肇庆", value: 46},
                        {name: "大连", value: 47},
                        {name: "临汾", value: 47},
                        {name: "吴江", value: 47},
                        {name: "石嘴山", value: 49},
                        {name: "沈阳", value: 50},
                        {name: "苏州", value: 50},
                        {name: "茂名", value: 50},
                        {name: "嘉兴", value: 51},
                        {name: "长春", value: 51},
                        {name: "胶州", value: 52},
                        {name: "银川", value: 52},
                        {name: "张家港", value: 52},
                        {name: "三门峡", value: 53},
                        {name: "锦州", value: 54},
                        {name: "南昌", value: 54},
                        {name: "柳州", value: 54},
                        {name: "三亚", value: 54},
                        {name: "自贡", value: 56},
                        {name: "吉林", value: 56},
                        {name: "阳江", value: 57},
                        {name: "泸州", value: 57},
                        {name: "西宁", value: 57},
                        {name: "宜宾", value: 58},
                        {name: "呼和浩特", value: 58},
                        {name: "成都", value: 58},
                        {name: "大同", value: 58},
                        {name: "镇江", value: 59},
                        {name: "桂林", value: 59},
                        {name: "张家界", value: 59},
                        {name: "宜兴", value: 59},
                        {name: "北海", value: 60},
                        {name: "西安", value: 61},
                        {name: "金坛", value: 62},
                        {name: "东营", value: 62},
                        {name: "牡丹江", value: 63},
                        {name: "遵义", value: 63},
                        {name: "绍兴", value: 63},
                        {name: "扬州", value: 64},
                        {name: "常州", value: 64},
                        {name: "潍坊", value: 65},
                        {name: "重庆", value: 66},
                        {name: "台州", value: 67},
                        {name: "南京", value: 67},
                        {name: "滨州", value: 70},
                        {name: "贵阳", value: 71},
                        {name: "无锡", value: 71},
                        {name: "本溪", value: 71},
                        {name: "克拉玛依", value: 72},
                        {name: "渭南", value: 72},
                        {name: "马鞍山", value: 72},
                        {name: "宝鸡", value: 72},
                        {name: "焦作", value: 75},
                        {name: "句容", value: 75},
                        {name: "北京", value: 79},
                        {name: "徐州", value: 79},
                        {name: "衡水", value: 80},
                        {name: "包头", value: 80},
                        {name: "绵阳", value: 80},
                        {name: "乌鲁木齐", value: 84},
                        {name: "枣庄", value: 84},
                        {name: "杭州", value: 84},
                        {name: "淄博", value: 85},
                        {name: "鞍山", value: 86},
                        {name: "溧阳", value: 86},
                        {name: "库尔勒", value: 86},
                        {name: "安阳", value: 90},
                        {name: "开封", value: 90},
                        {name: "济南", value: 92},
                        {name: "德阳", value: 93},
                        {name: "温州", value: 95},
                        {name: "九江", value: 96},
                        {name: "邯郸", value: 98},
                        {name: "临安", value: 99},
                        {name: "兰州", value: 99},
                        {name: "沧州", value: 100},
                        {name: "临沂", value: 103},
                        {name: "南充", value: 104},
                        {name: "天津", value: 105},
                        {name: "富阳", value: 106},
                        {name: "泰安", value: 112},
                        {name: "诸暨", value: 112},
                        {name: "郑州", value: 113},
                        {name: "哈尔滨", value: 114},
                        {name: "聊城", value: 116},
                        {name: "芜湖", value: 117},
                        {name: "唐山", value: 119},
                        {name: "平顶山", value: 119},
                        {name: "邢台", value: 119},
                        {name: "德州", value: 120},
                        {name: "济宁", value: 120},
                        {name: "荆州", value: 127},
                        {name: "宜昌", value: 130},
                        {name: "义乌", value: 132},
                        {name: "丽水", value: 133},
                        {name: "洛阳", value: 134},
                        {name: "秦皇岛", value: 136},
                        {name: "株洲", value: 143},
                        {name: "石家庄", value: 147},
                        {name: "莱芜", value: 148},
                        {name: "常德", value: 152},
                        {name: "保定", value: 153},
                        {name: "湘潭", value: 154},
                        {name: "金华", value: 157},
                        {name: "岳阳", value: 169},
                        {name: "长沙", value: 175},
                        {name: "衢州", value: 177},
                        {name: "廊坊", value: 193},
                        {name: "菏泽", value: 194},
                        {name: "合肥", value: 229},
                        {name: "武汉", value: 273},
                        {name: "大庆", value: 279}
                    ];

                    var convertData = function (data) {
                        var res = [];
                        for (var i = 0; i < data.length; i++) {
                            var geoCoord = geoCoordMap[data[i].name];
                            if (geoCoord) {
                                res.push({
                                    name: data[i].name,
                                    value: geoCoord.concat(data[i].value)
                                });
                            }
                        }
                        return res;
                    };

                    var convertedData = [
                        convertData(data),
                        convertData(data.sort(function (a, b) {
                            return b.value - a.value;
                        }).slice(0, 6))
                    ];


                    var option = {
                        backgroundColor: '#404a59',
                        animation: true,
                        animationDuration: 1000,
                        animationEasing: 'cubicInOut',
                        animationDurationUpdate: 1000,
                        animationEasingUpdate: 'cubicInOut',
                        title: [
                            {
                                text: '全国主要城市 交易量',
                                subtext: '由日升昌大数据中心提供计算服务',
                                sublink: 'http://www.rsc365.com',
                                left: 'center',
                                textStyle: {
                                    color: '#fff'
                                }
                            },
                            {
                                id: 'statistic',
                                right: 120,
                                top: 40,
                                width: 100,
                                textStyle: {
                                    color: '#fff',
                                    fontSize: 16
                                }
                            }
                        ],
                        toolbox: {
                            iconStyle: {
                                normal: {
                                    borderColor: '#fff'
                                },
                                emphasis: {
                                    borderColor: '#b1e4ff'
                                }
                            }
                        },
                        brush: {
                            outOfBrush: {
                                color: '#abc'
                            },
                            brushStyle: {
                                borderWidth: 2,
                                color: 'rgba(0,0,0,0.2)',
                                borderColor: 'rgba(0,0,0,0.5)',
                            },
                            seriesIndex: [0, 1],
                            throttleType: 'debounce',
                            throttleDelay: 300,
                            geoIndex: 0
                        },
                        geo: { //地图视图配置
                            map: 'china',
                            left: '200',
                            top: '80',
                            right: '20%',
                            center: [117.98561551896913, 31.205000490896193],
                            zoom: 0.8,
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48', // 地图背景色
                                    borderColor: '#111' // 地图边框色
                                },
                                emphasis: {
                                    areaColor: '#2a333d' //鼠标hover颜色
                                }
                            }
                        },
                        tooltip: {
                            trigger: 'item'
                        },
                        grid: {
                            right: 40,
                            top: 100,
                            bottom: 40,
                            width: '30%'
                        },
                        xAxis: {
                            type: 'value',
                            scale: true,
                            position: 'top',
                            boundaryGap: false,
                            splitLine: {show: false},
                            axisLine: {show: false},
                            axisTick: {show: false},
                            axisLabel: {margin: 2, textStyle: {color: '#aaa'}},
                        },
                        yAxis: {
                            type: 'category',
                            name: 'TOP 20',
                            nameGap: 16,
                            axisLine: {show: false, lineStyle: {color: '#ddd'}},
                            axisTick: {show: false, lineStyle: {color: '#ddd'}},
                            axisLabel: {interval: 0, textStyle: {color: '#ddd'}},
                            data: []
                        },
                        series: [
                            {
                                name: 'pm2.5',
                                type: 'scatter',
                                coordinateSystem: 'geo',
                                data: convertedData[0],
                                symbolSize: function (val) {
                                    return Math.max(val[2] / 10, 8);
                                },
                                label: {
                                    normal: {
                                        formatter: '{b}',
                                        position: 'right',
                                        show: false
                                    },
                                    emphasis: {
                                        show: true
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#ddb926'
                                    }
                                }
                            },
                            {
                                name: 'Top 5',
                                type: 'effectScatter',
                                coordinateSystem: 'geo',
                                data: convertedData[1],
                                symbolSize: function (val) {
                                    return Math.max(val[2] / 10, 8);
                                },
                                showEffectOn: 'emphasis',
                                rippleEffect: {
                                    brushType: 'stroke'
                                },
                                hoverAnimation: true,
                                label: {
                                    normal: {
                                        formatter: '{b}',
                                        position: 'right',
                                        show: true
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#f4e925',
                                        shadowBlur: 10,
                                        shadowColor: '#333'
                                    }
                                },
                                zlevel: 1
                            },
                            {
                                id: 'bar',
                                zlevel: 2,
                                type: 'bar',
                                symbol: 'none',
                                itemStyle: {
                                    normal: {
                                        color: '#ddb926'
                                    }
                                },
                                data: []
                            }
                        ]
                    };

                    trade.on('brushselected', renderBrushed);

                    setTimeout(function () {
                        trade.dispatchAction({
                            type: 'brush',
                            areas: [
                                {
                                    geoIndex: 0,
                                    brushType: 'polygon',
                                    // 默认覆盖
                                    coordRange: [
                                        [119.72, 34.85],
                                        [119.68, 34.85],
                                        [119.5, 34.84],
                                        [119.19, 34.77],
                                        [118.76, 34.63],
                                        [118.6, 34.6],
                                        [118.46, 34.6],
                                        [118.33, 34.57],
                                        [118.05, 34.56],
                                        [117.6, 34.56],
                                        [117.41, 34.56],
                                        [117.25, 34.56],
                                        [117.11, 34.56],
                                        [117.02, 34.56],
                                        [117, 34.56],
                                        [116.94, 34.56],
                                        [116.94, 34.55],
                                        [116.9, 34.5],
                                        [116.88, 34.44], [116.88, 34.37], [116.88, 34.33], [116.88, 34.24], [116.92, 34.15], [116.98, 34.09], [117.05, 34.06], [117.19, 33.96], [117.29, 33.9], [117.43, 33.8], [117.49, 33.75], [117.54, 33.68], [117.6, 33.65], [117.62, 33.61], [117.64, 33.59], [117.68, 33.58], [117.7, 33.52], [117.74, 33.5], [117.74, 33.46], [117.8, 33.44], [117.82, 33.41], [117.86, 33.37], [117.9, 33.3], [117.9, 33.28], [117.9, 33.27], [118.09, 32.97], [118.21, 32.7], [118.29, 32.56], [118.31, 32.5], [118.35, 32.46], [118.35, 32.42], [118.35, 32.36], [118.35, 32.34], [118.37, 32.24], [118.37, 32.14], [118.37, 32.09], [118.44, 32.05], [118.46, 32.01], [118.54, 31.98], [118.6, 31.93], [118.68, 31.86], [118.72, 31.8], [118.74, 31.78], [118.76, 31.74], [118.78, 31.7], [118.82, 31.64], [118.82, 31.62], [118.86, 31.58], [118.86, 31.55], [118.88, 31.54], [118.88, 31.52], [118.9, 31.51], [118.91, 31.48], [118.93, 31.43], [118.95, 31.4], [118.97, 31.39], [118.97, 31.37], [118.97, 31.34], [118.97, 31.27], [118.97, 31.21], [118.97, 31.17], [118.97, 31.12], [118.97, 31.02], [118.97, 30.93], [118.97, 30.87], [118.97, 30.85], [118.95, 30.8], [118.95, 30.77], [118.95, 30.76], [118.93, 30.7], [118.91, 30.63], [118.91, 30.61], [118.91, 30.6], [118.9, 30.6], [118.88, 30.54], [118.88, 30.51], [118.86, 30.51], [118.86, 30.46], [118.72, 30.18], [118.68, 30.1], [118.66, 30.07], [118.62, 29.91], [118.56, 29.73], [118.52, 29.63], [118.48, 29.51], [118.44, 29.42], [118.44, 29.32], [118.43, 29.19], [118.43, 29.14], [118.43, 29.08], [118.44, 29.05], [118.46, 29.05], [118.6, 28.95], [118.64, 28.94], [119.07, 28.51], [119.25, 28.41], [119.36, 28.28], [119.46, 28.19], [119.54, 28.13], [119.66, 28.03], [119.78, 28], [119.87, 27.94], [120.03, 27.86], [120.17, 27.79], [120.23, 27.76], [120.3, 27.72], [120.42, 27.66], [120.52, 27.64], [120.58, 27.63], [120.64, 27.63], [120.77, 27.63], [120.89, 27.61], [120.97, 27.6], [121.07, 27.59], [121.15, 27.59], [121.28, 27.59], [121.38, 27.61], [121.56, 27.73], [121.73, 27.89], [122.03, 28.2], [122.3, 28.5], [122.46, 28.72], [122.5, 28.77], [122.54, 28.82], [122.56, 28.82], [122.58, 28.85], [122.6, 28.86], [122.61, 28.91], [122.71, 29.02], [122.73, 29.08], [122.93, 29.44], [122.99, 29.54], [123.03, 29.66], [123.05, 29.73], [123.16, 29.92], [123.24, 30.02], [123.28, 30.13], [123.32, 30.29], [123.36, 30.36], [123.36, 30.55], [123.36, 30.74], [123.36, 31.05], [123.36, 31.14], [123.36, 31.26], [123.38, 31.42], [123.46, 31.74], [123.48, 31.83], [123.48, 31.95], [123.46, 32.09], [123.34, 32.25], [123.22, 32.39], [123.12, 32.46], [123.07, 32.48], [123.05, 32.49], [122.97, 32.53], [122.91, 32.59], [122.83, 32.81], [122.77, 32.87], [122.71, 32.9], [122.56, 32.97], [122.38, 33.05], [122.3, 33.12], [122.26, 33.15], [122.22, 33.21], [122.22, 33.3], [122.22, 33.39], [122.18, 33.44], [122.07, 33.56], [121.99, 33.69], [121.89, 33.78], [121.69, 34.02], [121.66, 34.05], [121.64, 34.08]
                                    ]
                                }
                            ]
                        });
                    }, 0);


                    function renderBrushed(params) {
                        var mainSeries = params.batch[0].selected[0];
                        var selectedItems = [];
                        var categoryData = [];
                        var barData = [];
                        var maxBar = 30;
                        var sum = 0;
                        var count = 0;

                        for (var i = 0; i < mainSeries.dataIndex.length; i++) {
                            var rawIndex = mainSeries.dataIndex[i];
                            var dataItem = convertedData[0][rawIndex];
                            var pmValue = dataItem.value[2];

                            sum += pmValue;
                            count++;

                            selectedItems.push(dataItem);
                        }

                        selectedItems.sort(function (a, b) {
                            return a.value[2] - b.value[2];
                        });

                        for (var i = 0; i < Math.min(selectedItems.length, maxBar); i++) {
                            categoryData.push(selectedItems[i].name);
                            barData.push(selectedItems[i].value[2]);
                        }

                        this.setOption({
                            yAxis: {
                                data: categoryData
                            },
                            xAxis: {
                                axisLabel: {show: !!count}
                            },
                            title: {
                                id: 'statistic',
                                text: count ? '平均: ' + (sum / count).toFixed(4) : ''
                            },
                            series: {
                                id: 'bar',
                                data: barData
                            }
                        });
                    }

                    trade.setOption(option);
                })
            }
        };
    }])

    /**
     * 物流
     */
    .directive("pass", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='pass' style='width: auto;'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('pass');
                    height.style.height = (window.screen.height + window.screenTop) + 5 + 'px';
                    var pass = echarts.init(document.getElementById('pass'));
                    var geoCoordMap = {
                        '上海': [121.4648, 31.2891],
                        '东莞': [113.8953, 22.901],
                        '东营': [118.7073, 37.5513],
                        '中山': [113.4229, 22.478],
                        '临汾': [111.4783, 36.1615],
                        '临沂': [118.3118, 35.2936],
                        '丹东': [124.541, 40.4242],
                        '丽水': [119.5642, 28.1854],
                        '乌鲁木齐': [87.9236, 43.5883],
                        '佛山': [112.8955, 23.1097],
                        '保定': [115.0488, 39.0948],
                        '兰州': [103.5901, 36.3043],
                        '包头': [110.3467, 41.4899],
                        '北京': [116.4551, 40.2539],
                        '北海': [109.314, 21.6211],
                        '南京': [118.8062, 31.9208],
                        '南宁': [108.479, 23.1152],
                        '南昌': [116.0046, 28.6633],
                        '南通': [121.1023, 32.1625],
                        '厦门': [118.1689, 24.6478],
                        '台州': [121.1353, 28.6688],
                        '合肥': [117.29, 32.0581],
                        '呼和浩特': [111.4124, 40.4901],
                        '咸阳': [108.4131, 34.8706],
                        '哈尔滨': [127.9688, 45.368],
                        '唐山': [118.4766, 39.6826],
                        '嘉兴': [120.9155, 30.6354],
                        '大同': [113.7854, 39.8035],
                        '大连': [122.2229, 39.4409],
                        '天津': [117.4219, 39.4189],
                        '太原': [112.3352, 37.9413],
                        '威海': [121.9482, 37.1393],
                        '宁波': [121.5967, 29.6466],
                        '宝鸡': [107.1826, 34.3433],
                        '宿迁': [118.5535, 33.7775],
                        '常州': [119.4543, 31.5582],
                        '广州': [113.5107, 23.2196],
                        '廊坊': [116.521, 39.0509],
                        '延安': [109.1052, 36.4252],
                        '张家口': [115.1477, 40.8527],
                        '徐州': [117.5208, 34.3268],
                        '德州': [116.6858, 37.2107],
                        '惠州': [114.6204, 23.1647],
                        '成都': [103.9526, 30.7617],
                        '扬州': [119.4653, 32.8162],
                        '承德': [117.5757, 41.4075],
                        '拉萨': [91.1865, 30.1465],
                        '无锡': [120.3442, 31.5527],
                        '日照': [119.2786, 35.5023],
                        '昆明': [102.9199, 25.4663],
                        '杭州': [119.5313, 29.8773],
                        '枣庄': [117.323, 34.8926],
                        '柳州': [109.3799, 24.9774],
                        '株洲': [113.5327, 27.0319],
                        '武汉': [114.3896, 30.6628],
                        '汕头': [117.1692, 23.3405],
                        '江门': [112.6318, 22.1484],
                        '沈阳': [123.1238, 42.1216],
                        '沧州': [116.8286, 38.2104],
                        '河源': [114.917, 23.9722],
                        '泉州': [118.3228, 25.1147],
                        '泰安': [117.0264, 36.0516],
                        '泰州': [120.0586, 32.5525],
                        '济南': [117.1582, 36.8701],
                        '济宁': [116.8286, 35.3375],
                        '海口': [110.3893, 19.8516],
                        '淄博': [118.0371, 36.6064],
                        '淮安': [118.927, 33.4039],
                        '深圳': [114.5435, 22.5439],
                        '清远': [112.9175, 24.3292],
                        '温州': [120.498, 27.8119],
                        '渭南': [109.7864, 35.0299],
                        '湖州': [119.8608, 30.7782],
                        '湘潭': [112.5439, 27.7075],
                        '滨州': [117.8174, 37.4963],
                        '潍坊': [119.0918, 36.524],
                        '烟台': [120.7397, 37.5128],
                        '玉溪': [101.9312, 23.8898],
                        '珠海': [113.7305, 22.1155],
                        '盐城': [120.2234, 33.5577],
                        '盘锦': [121.9482, 41.0449],
                        '石家庄': [114.4995, 38.1006],
                        '福州': [119.4543, 25.9222],
                        '秦皇岛': [119.2126, 40.0232],
                        '绍兴': [120.564, 29.7565],
                        '聊城': [115.9167, 36.4032],
                        '肇庆': [112.1265, 23.5822],
                        '舟山': [122.2559, 30.2234],
                        '苏州': [120.6519, 31.3989],
                        '莱芜': [117.6526, 36.2714],
                        '菏泽': [115.6201, 35.2057],
                        '营口': [122.4316, 40.4297],
                        '葫芦岛': [120.1575, 40.578],
                        '衡水': [115.8838, 37.7161],
                        '衢州': [118.6853, 28.8666],
                        '西宁': [101.4038, 36.8207],
                        '西安': [109.1162, 34.2004],
                        '贵阳': [106.6992, 26.7682],
                        '连云港': [119.1248, 34.552],
                        '邢台': [114.8071, 37.2821],
                        '邯郸': [114.4775, 36.535],
                        '郑州': [113.4668, 34.6234],
                        '鄂尔多斯': [108.9734, 39.2487],
                        '重庆': [107.7539, 30.1904],
                        '金华': [120.0037, 29.1028],
                        '铜川': [109.0393, 35.1947],
                        '银川': [106.3586, 38.1775],
                        '镇江': [119.4763, 31.9702],
                        '长春': [125.8154, 44.2584],
                        '长沙': [113.0823, 28.2568],
                        '长治': [112.8625, 36.4746],
                        '阳泉': [113.4778, 38.0951],
                        '青岛': [120.4651, 36.3373],
                        '韶关': [113.7964, 24.7028]
                    };

                    var BJData = [
                        [{name: '潍坊'}, {name: '西宁', value: 5}],
                        [{name: '西宁'}, {name: '温州', value: 5}],
                        [{name: '温州'}, {name: '东莞', value: 5}],
                        [{name: '东莞'}, {name: '汕头', value: 5}],
                        [{name: '汕头'}, {name: '福州', value: 5}],
                        [{name: '福州'}, {name: '连云港', value: 5}],
                        [{name: '连云港'}, {name: '长春', value: 5}],
                        [{name: '长春'}, {name: '南昌', value: 5}],
                        [{name: '南昌'}, {name: '咸阳', value: 5}],
                        [{name: '咸阳'}, {name: '廊坊', value: 5}],
                        [{name: '廊坊'}, {name: '沈阳', value: 5}],
                        [{name: '沈阳'}, {name: '西安', value: 5}],
                        [{name: '西安'}, {name: '南京', value: 5}],
                        [{name: '南京'}, {name: '连云港', value: 5}],
                        [{name: '连云港'}, {name: '深圳', value: 5}],
                        [{name: '深圳'}, {name: '泰安', value: 5}],
                        [{name: '泰安'}, {name: '武汉', value: 5}],
                        [{name: '武汉'}, {name: '昆明', value: 5}],
                        [{name: '昆明'}, {name: '南京', value: 5}],
                        [{name: '南京'}, {name: '武汉', value: 5}],
                        [{name: '武汉'}, {name: '烟台', value: 5}],
                        [{name: '烟台'}, {name: '长春', value: 5}],
                        [{name: '长春'}, {name: '贵阳', value: 5}],
                        [{name: '贵阳'}, {name: '宿迁', value: 5}],
                        [{name: '宿迁'}, {name: '徐州', value: 5}],
                        [{name: '徐州'}, {name: '丽水', value: 5}],
                        [{name: '丽水'}, {name: '长沙', value: 5}],
                        [{name: '长沙'}, {name: '沧州', value: 5}],
                        [{name: '沧州'}, {name: '盐城', value: 5}],
                        [{name: '盐城'}, {name: '宁波', value: 5}],
                        [{name: '宁波'}, {name: '宁波', value: 5}],
                        [{name: '宁波'}, {name: '泰安', value: 5}],
                        [{name: '泰安'}, {name: '厦门', value: 5}],
                        [{name: '厦门'}, {name: '保定', value: 5}],
                        [{name: '保定'}, {name: '宿迁', value: 5}],
                        [{name: '宿迁'}, {name: '深圳', value: 5}],
                        [{name: '深圳'}, {name: '贵阳', value: 5}],
                        [{name: '贵阳'}, {name: '金华', value: 5}],
                        [{name: '金华'}, {name: '肇庆', value: 5}],
                        [{name: '肇庆'}, {name: '金华', value: 5}],
                        [{name: '金华'}, {name: '苏州', value: 5}],
                        [{name: '苏州'}, {name: '东莞', value: 5}],
                        [{name: '东莞'}, {name: '惠州', value: 5}],
                        [{name: '惠州'}, {name: '邯郸', value: 5}],
                        [{name: '邯郸'}, {name: '玉溪', value: 5}],
                        [{name: '玉溪'}, {name: '中山', value: 5}],
                        [{name: '中山'}, {name: '乌鲁木齐', value: 5}],
                        [{name: '乌鲁木齐'}, {name: '廊坊', value: 5}],
                        [{name: '廊坊'}, {name: '廊坊', value: 5}]
                    ];

                    var convertData = function (data) {
                        var res = [];
                        for (var i = 0; i < data.length; i++) {
                            var dataItem = data[i];
                            var fromCoord = geoCoordMap[dataItem[0].name];
                            var toCoord = geoCoordMap[dataItem[1].name];
                            if (fromCoord && toCoord) {
                                res.push({
                                    fromName: dataItem[0].name,
                                    toName: dataItem[1].name,
                                    coords: [fromCoord, toCoord]
                                });
                            }
                        }
                        return res;
                    };

                    var color = ['#a6c84c', '#ffa022', '#46bee9'];
                    var series = [];
                    [['北京', BJData]].forEach(function (item, i) {
                        series.push({
                                name: item[0] + ' Top10',
                                type: 'lines',
                                zlevel: 1,
                                effect: {
                                    show: true,
                                    period: 6, //描点过渡动画速度
                                    trailLength: 0.4, //描点过渡动画消失时间
                                    color: '#fff', //描点过渡动画颜色
                                    symbolSize: 3 //描点过渡动画点大小
                                },
                                lineStyle: {
                                    normal: {
                                        color: color[i],
                                        width: 0,
                                        curveness: 0.2
                                    }
                                },
                                data: convertData(item[1])
                            },
                            {
                                name: item[0] + ' Top10',
                                type: 'lines',
                                zlevel: 2,
                                effect: {
                                    show: true,
                                    period: 6,
                                    trailLength: 0,
                                    //symbol: planePath,
                                    symbolSize: 5
                                },
                                lineStyle: {
                                    normal: {
                                        color: color[i],
                                        width: 1,
                                        opacity: 0.4,
                                        curveness: 0.2
                                    }
                                },
                                data: convertData(item[1])
                            },
                            {
                                name: item[0] + ' Top10',
                                type: 'effectScatter',
                                coordinateSystem: 'geo',
                                zlevel: 2,
                                rippleEffect: {
                                    brushType: 'stroke'
                                },
                                label: {
                                    normal: {
                                        show: true,
                                        position: 'right',
                                        formatter: '{b}'
                                    }
                                },
                                symbolSize: function (val) {
                                    return val[2] / 8;
                                },
                                itemStyle: {
                                    normal: {
                                        color: color[i]
                                    }
                                },
                                data: item[1].map(function (dataItem) {
                                    return {
                                        name: dataItem[1].name,
                                        value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
                                    };
                                })
                            });
                    });

                    var option = {
                        backgroundColor: '#404a59',
                        title: {
                            text: '全国物流线路',
                            subtext: '由日升昌大数据中心提供计算服务',
                            left: 'center',
                            textStyle: {
                                color: '#fff'
                            }
                        },
                        tooltip: {
                            trigger: 'item'
                        },
                        legend: {
                            orient: 'vertical',
                            top: 'bottom',
                            left: 'right',
                            data: [],
                            textStyle: {
                                color: '#fff'
                            },
                            selectedMode: 'single'
                        },
                        geo: {
                            map: 'china',
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#404a59'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            }
                        },
                        series: series
                    };
                    pass.setOption(option);
                })
            }
        };
    }])
    /**
     * 司机
     */
    .directive("car", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='car' style='width: auto'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('car');
                    height.style.height = (window.screen.height + window.screenTop) + 5 + 'px';
                    var car = echarts.init(document.getElementById('car'));
                    var allData = {
                        "citys": [{
                            "name": "延寿",
                            "value": [128.331644, 45.451897, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "临江",
                            "value": [126.918087, 41.811979, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "嘉兴",
                            "value": [120.755486, 30.746129, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "四平",
                            "value": [124.350398, 43.16642, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "营口",
                            "value": [122.235418, 40.667012, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "密云",
                            "value": [116.801346, 40.35874, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "威海",
                            "value": [122.12042, 37.513068, 32],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "杭州",
                            "value": [120.15507, 30.274085, 10],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "集安",
                            "value": [126.194031, 41.125307, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "贵阳",
                            "value": [106.630154, 26.647661, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "抚顺",
                            "value": [123.957208, 41.880872, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海门",
                            "value": [121.181615, 31.871173, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "珠海",
                            "value": [113.576726, 22.270715, 9],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "河北",
                            "value": [114.475704, 38.584854, -19],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "深圳",
                            "value": [114.057868, 22.543099, 14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "黄浦",
                            "value": [121.484443, 31.231763, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "蓬莱",
                            "value": [120.758848, 37.810661, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "吉林",
                            "value": [126.549572, 43.837883, -364],
                            "symbolSize": 14,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "甘肃",
                            "value": [103.826308, 36.059421, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "龙井",
                            "value": [129.427066, 42.766311, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "茂名",
                            "value": [110.925456, 21.662999, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "丹东",
                            "value": [124.354707, 40.0005, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "晋中",
                            "value": [112.752695, 37.687024, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "浙江",
                            "value": [120.152792, 30.267447, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "海城",
                            "value": [122.685217, 40.882377, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "溆浦",
                            "value": [110.594921, 27.908281, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "北京",
                            "value": [116.407526, 39.90403, -14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "铁岭",
                            "value": [123.726166, 42.223769, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "大同",
                            "value": [113.61244, 40.040295, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "金坛",
                            "value": [119.597897, 31.723247, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "齐齐哈尔",
                            "value": [126.661669, 45.742347, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "咸阳",
                            "value": [108.708991, 34.329605, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "四川",
                            "value": [104.075931, 30.651652, -5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "福田",
                            "value": [114.055036, 22.52153, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "盘锦",
                            "value": [122.070714, 41.119997, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "中山",
                            "value": [113.392782, 22.517646, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "福建",
                            "value": [119.295144, 26.10078, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "泰顺",
                            "value": [119.717649, 27.556884, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "宝山",
                            "value": [131.401589, 46.577167, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "庆安",
                            "value": [127.507825, 46.880102, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海淀",
                            "value": [116.298056, 39.959912, 32],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "大兴",
                            "value": [116.341395, 39.726929, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "桦川",
                            "value": [130.719081, 47.023001, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "惠州",
                            "value": [114.416196, 23.111847, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "青岛",
                            "value": [120.38264, 36.067082, 52],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "朝阳",
                            "value": [116.443108, 39.92147, 17],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "沈阳",
                            "value": [123.431475, 41.805698, 41],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "菏泽",
                            "value": [115.480656, 35.23375, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南通",
                            "value": [120.894291, 31.980172, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南充",
                            "value": [106.110698, 30.837793, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "双城",
                            "value": [126.312745, 45.383263, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南京",
                            "value": [118.796877, 32.060255, 17],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "新疆",
                            "value": [87.627704, 43.793026, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "成都",
                            "value": [104.066541, 30.572269, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "陕西",
                            "value": [108.954239, 34.265472, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "黄岛",
                            "value": [120.04619, 35.872664, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "温州",
                            "value": [120.699367, 27.994267, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "石家庄",
                            "value": [114.51486, 38.042307, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "邢台",
                            "value": [114.504844, 37.070589, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "赣州",
                            "value": [114.93503, 25.831829, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "义乌",
                            "value": [120.075058, 29.306841, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南昌",
                            "value": [115.858198, 28.682892, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "闵行",
                            "value": [121.381709, 31.112813, 18],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "长宁",
                            "value": [121.424624, 31.220367, 7],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "道里",
                            "value": [126.616957, 45.755777, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "乳山",
                            "value": [121.539765, 36.919816, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "双流",
                            "value": [103.923648, 30.574473, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "广州",
                            "value": [113.264435, 23.129163, 13],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "西城",
                            "value": [116.365868, 39.912289, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "佳木斯",
                            "value": [130.318917, 46.799923, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "皇姑",
                            "value": [123.44197, 41.824796, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "榆树",
                            "value": [126.533146, 44.840288, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "临汾",
                            "value": [111.518976, 36.088005, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "上海",
                            "value": [121.473701, 31.230416, 44],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "内蒙古",
                            "value": [111.765618, 40.817498, -23],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "尚志",
                            "value": [128.009895, 45.209586, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "湖里",
                            "value": [118.146769, 24.512905, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "台州",
                            "value": [121.420757, 28.656386, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "潍坊",
                            "value": [119.161756, 36.706774, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "苏州",
                            "value": [120.585316, 31.298886, 14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "房山",
                            "value": [116.143267, 39.749144, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "即墨",
                            "value": [120.447128, 36.389639, 15],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "舒兰",
                            "value": [126.965607, 44.406106, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "延吉",
                            "value": [129.508946, 42.891255, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "三河",
                            "value": [117.078295, 39.982718, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "大连",
                            "value": [121.614682, 38.914003, 40],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "辉南",
                            "value": [126.046912, 42.684993, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "无锡",
                            "value": [120.31191, 31.49117, 14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "常州",
                            "value": [119.973987, 31.810689, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "广西",
                            "value": [108.327546, 22.815478, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "泉州",
                            "value": [118.675676, 24.874132, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "昌平",
                            "value": [116.231204, 40.22066, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海阳",
                            "value": [121.158434, 36.776378, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "郑州",
                            "value": [113.625368, 34.7466, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "东城",
                            "value": [116.416357, 39.928353, 10],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "黄骅",
                            "value": [117.330048, 38.371383, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "武侯",
                            "value": [104.04339, 30.641982, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "鸡东",
                            "value": [131.12408, 45.260412, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "龙口",
                            "value": [120.477813, 37.646108, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "汤原",
                            "value": [129.905072, 46.730706, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "湖北",
                            "value": [114.341862, 30.546498, -4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "克拉玛依",
                            "value": [84.889207, 45.579889, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "厦门",
                            "value": [118.089425, 24.479834, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "哈尔滨",
                            "value": [126.534967, 45.803775, 8],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "秦皇岛",
                            "value": [119.600493, 39.935385, 7],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "江苏",
                            "value": [118.763232, 32.061707, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "常熟",
                            "value": [120.752481, 31.654376, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "烟台",
                            "value": [121.447935, 37.463822, 24],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "和平",
                            "value": [117.21451, 39.116949, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "环翠",
                            "value": [122.123444, 37.501991, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "宣武门外东大街",
                            "value": [116.378888, 39.899332, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "张家港",
                            "value": [120.553284, 31.870367, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "临安",
                            "value": [119.724733, 30.233873, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "延安",
                            "value": [109.489727, 36.585455, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "天津",
                            "value": [117.200983, 39.084158, 28],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "城阳",
                            "value": [120.39631, 36.307064, 15],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "石景山",
                            "value": [116.222982, 39.906611, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "长沙",
                            "value": [112.938814, 28.228209, 5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "安徽",
                            "value": [117.284923, 31.861184, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "昆山",
                            "value": [120.980737, 31.385598, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "徐汇",
                            "value": [121.436525, 31.188523, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "东港",
                            "value": [124.152705, 39.863008, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "廊坊",
                            "value": [116.683752, 39.538047, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "鞍山",
                            "value": [122.994329, 41.108647, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海陵",
                            "value": [119.919425, 32.491016, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "黑龙江",
                            "value": [126.661669, 45.742347, -198],
                            "symbolSize": 8,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "西藏",
                            "value": [91.117212, 29.646923, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "河南",
                            "value": [113.274379, 34.445122, 0],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "湖南",
                            "value": [112.98381, 28.112444, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "佛山",
                            "value": [113.121416, 23.021548, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "珲春",
                            "value": [130.366036, 42.862821, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "扬州",
                            "value": [119.412966, 32.39421, 5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "日照",
                            "value": [119.526888, 35.416377, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "唐山",
                            "value": [118.180194, 39.630867, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "同江",
                            "value": [132.510919, 47.642707, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "荣成",
                            "value": [122.486658, 37.16516, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "虎林",
                            "value": [132.93721, 45.762686, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "武汉",
                            "value": [114.305393, 30.593099, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "合肥",
                            "value": [117.227239, 31.820587, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "荆州",
                            "value": [112.239741, 30.335165, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "丰台",
                            "value": [116.287149, 39.858427, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "山东",
                            "value": [117.020359, 36.66853, -6],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "舟山",
                            "value": [122.207216, 29.985295, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "连云港",
                            "value": [119.221611, 34.596653, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "西安",
                            "value": [108.940175, 34.341568, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "济南",
                            "value": [117.12, 36.651216, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "绵阳",
                            "value": [104.679114, 31.46745, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "辽宁",
                            "value": [123.42944, 41.835441, -58],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "山西",
                            "value": [112.562398, 37.873532, -3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "呼和浩特",
                            "value": [111.749181, 40.842585, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "河西",
                            "value": [117.223372, 39.109563, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "兴和",
                            "value": [113.834173, 40.872301, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "重庆",
                            "value": [106.551557, 29.56301, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "胶州",
                            "value": [120.033382, 36.26468, 5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "宁波",
                            "value": [121.550357, 29.874557, 10],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "滨海",
                            "value": [119.820831, 33.990334, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "太原",
                            "value": [112.548879, 37.87059, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "鸡西",
                            "value": [130.969333, 45.295075, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "兰山",
                            "value": [118.347707, 35.051729, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "阳泉",
                            "value": [113.580519, 37.856972, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "勃利",
                            "value": [130.592171, 45.755063, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "长春",
                            "value": [125.323544, 43.817072, 8],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }],
                        "moveLines": [{
                            "fromName": "黑龙江",
                            "toName": "珠海",
                            "coords": [[126.661669, 45.742347], [113.576726, 22.270715]]
                        }, {"fromName": "黑龙江", "toName": "舒兰", "coords": [[126.661669, 45.742347], [126.965607, 44.406106]]}, {
                            "fromName": "黑龙江",
                            "toName": "大连",
                            "coords": [[126.661669, 45.742347], [121.614682, 38.914003]]
                        }, {"fromName": "辽宁", "toName": "集安", "coords": [[123.42944, 41.835441], [126.194031, 41.125307]]}, {
                            "fromName": "吉林",
                            "toName": "抚顺",
                            "coords": [[126.549572, 43.837883], [123.957208, 41.880872]]
                        }, {"fromName": "山东", "toName": "南京", "coords": [[117.020359, 36.66853], [118.796877, 32.060255]]}, {
                            "fromName": "北京",
                            "toName": "沈阳",
                            "coords": [[116.407526, 39.90403], [123.431475, 41.805698]]
                        }, {"fromName": "黑龙江", "toName": "环翠", "coords": [[126.661669, 45.742347], [122.123444, 37.501991]]}, {
                            "fromName": "天津",
                            "toName": "大连",
                            "coords": [[117.200983, 39.084158], [121.614682, 38.914003]]
                        }, {"fromName": "吉林", "toName": "兴和", "coords": [[126.549572, 43.837883], [113.834173, 40.872301]]}, {
                            "fromName": "河北",
                            "toName": "勃利",
                            "coords": [[114.475704, 38.584854], [130.592171, 45.755063]]
                        }, {"fromName": "吉林", "toName": "大连", "coords": [[126.549572, 43.837883], [121.614682, 38.914003]]}, {
                            "fromName": "吉林",
                            "toName": "沈阳",
                            "coords": [[126.549572, 43.837883], [123.431475, 41.805698]]
                        }, {"fromName": "黑龙江", "toName": "闵行", "coords": [[126.661669, 45.742347], [121.381709, 31.112813]]}, {
                            "fromName": "天津",
                            "toName": "朝阳",
                            "coords": [[117.200983, 39.084158], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "黄岛", "coords": [[126.549572, 43.837883], [120.04619, 35.872664]]}, {
                            "fromName": "内蒙古",
                            "toName": "上海",
                            "coords": [[111.765618, 40.817498], [121.473701, 31.230416]]
                        }, {"fromName": "内蒙古", "toName": "南京", "coords": [[111.765618, 40.817498], [118.796877, 32.060255]]}, {
                            "fromName": "辽宁",
                            "toName": "杭州",
                            "coords": [[123.42944, 41.835441], [120.15507, 30.274085]]
                        }, {"fromName": "黑龙江", "toName": "海城", "coords": [[126.661669, 45.742347], [122.685217, 40.882377]]}, {
                            "fromName": "吉林",
                            "toName": "西城",
                            "coords": [[126.549572, 43.837883], [116.365868, 39.912289]]
                        }, {"fromName": "四川", "toName": "上海", "coords": [[104.075931, 30.651652], [121.473701, 31.230416]]}, {
                            "fromName": "黑龙江",
                            "toName": "西城",
                            "coords": [[126.661669, 45.742347], [116.365868, 39.912289]]
                        }, {"fromName": "吉林", "toName": "丹东", "coords": [[126.549572, 43.837883], [124.354707, 40.0005]]}, {
                            "fromName": "吉林",
                            "toName": "宁波",
                            "coords": [[126.549572, 43.837883], [121.550357, 29.874557]]
                        }, {"fromName": "辽宁", "toName": "海淀", "coords": [[123.42944, 41.835441], [116.298056, 39.959912]]}, {
                            "fromName": "辽宁",
                            "toName": "青岛",
                            "coords": [[123.42944, 41.835441], [120.38264, 36.067082]]
                        }, {"fromName": "吉林", "toName": "苏州", "coords": [[126.549572, 43.837883], [120.585316, 31.298886]]}, {
                            "fromName": "黑龙江",
                            "toName": "抚顺",
                            "coords": [[126.661669, 45.742347], [123.957208, 41.880872]]
                        }, {"fromName": "吉林", "toName": "临安", "coords": [[126.549572, 43.837883], [119.724733, 30.233873]]}, {
                            "fromName": "辽宁",
                            "toName": "烟台",
                            "coords": [[123.42944, 41.835441], [121.447935, 37.463822]]
                        }, {"fromName": "黑龙江", "toName": "海淀", "coords": [[126.661669, 45.742347], [116.298056, 39.959912]]}, {
                            "fromName": "黑龙江",
                            "toName": "南昌",
                            "coords": [[126.661669, 45.742347], [115.858198, 28.682892]]
                        }, {"fromName": "内蒙古", "toName": "沈阳", "coords": [[111.765618, 40.817498], [123.431475, 41.805698]]}, {
                            "fromName": "山西",
                            "toName": "城阳",
                            "coords": [[112.562398, 37.873532], [120.39631, 36.307064]]
                        }, {"fromName": "吉林", "toName": "广州", "coords": [[126.549572, 43.837883], [113.264435, 23.129163]]}, {
                            "fromName": "上海",
                            "toName": "沈阳",
                            "coords": [[121.473701, 31.230416], [123.431475, 41.805698]]
                        }, {"fromName": "四川", "toName": "阳泉", "coords": [[104.075931, 30.651652], [113.580519, 37.856972]]}, {
                            "fromName": "河北",
                            "toName": "桦川",
                            "coords": [[114.475704, 38.584854], [130.719081, 47.023001]]
                        }, {"fromName": "内蒙古", "toName": "海淀", "coords": [[111.765618, 40.817498], [116.298056, 39.959912]]}, {
                            "fromName": "安徽",
                            "toName": "河北",
                            "coords": [[117.284923, 31.861184], [114.475704, 38.584854]]
                        }, {"fromName": "辽宁", "toName": "呼和浩特", "coords": [[123.42944, 41.835441], [111.749181, 40.842585]]}, {
                            "fromName": "广西",
                            "toName": "茂名",
                            "coords": [[108.327546, 22.815478], [110.925456, 21.662999]]
                        }, {"fromName": "吉林", "toName": "东城", "coords": [[126.549572, 43.837883], [116.416357, 39.928353]]}, {
                            "fromName": "内蒙古",
                            "toName": "盘锦",
                            "coords": [[111.765618, 40.817498], [122.070714, 41.119997]]
                        }, {"fromName": "山东", "toName": "哈尔滨", "coords": [[117.020359, 36.66853], [126.534967, 45.803775]]}, {
                            "fromName": "黑龙江",
                            "toName": "沈阳",
                            "coords": [[126.661669, 45.742347], [123.431475, 41.805698]]
                        }, {"fromName": "黑龙江", "toName": "丰台", "coords": [[126.661669, 45.742347], [116.287149, 39.858427]]}, {
                            "fromName": "四川",
                            "toName": "盘锦",
                            "coords": [[104.075931, 30.651652], [122.070714, 41.119997]]
                        }, {"fromName": "黑龙江", "toName": "皇姑", "coords": [[126.661669, 45.742347], [123.44197, 41.824796]]}, {
                            "fromName": "河北",
                            "toName": "虎林",
                            "coords": [[114.475704, 38.584854], [132.93721, 45.762686]]
                        }, {"fromName": "辽宁", "toName": "宝山", "coords": [[123.42944, 41.835441], [131.401589, 46.577167]]}, {
                            "fromName": "黑龙江",
                            "toName": "吉林",
                            "coords": [[126.661669, 45.742347], [126.549572, 43.837883]]
                        }, {"fromName": "黑龙江", "toName": "青岛", "coords": [[126.661669, 45.742347], [120.38264, 36.067082]]}, {
                            "fromName": "吉林",
                            "toName": "烟台",
                            "coords": [[126.549572, 43.837883], [121.447935, 37.463822]]
                        }, {"fromName": "山东", "toName": "临江", "coords": [[117.020359, 36.66853], [126.918087, 41.811979]]}, {
                            "fromName": "黑龙江",
                            "toName": "黄岛",
                            "coords": [[126.661669, 45.742347], [120.04619, 35.872664]]
                        }, {"fromName": "吉林", "toName": "石家庄", "coords": [[126.549572, 43.837883], [114.51486, 38.042307]]}, {
                            "fromName": "吉林",
                            "toName": "汤原",
                            "coords": [[126.549572, 43.837883], [129.905072, 46.730706]]
                        }, {"fromName": "黑龙江", "toName": "临江", "coords": [[126.661669, 45.742347], [126.918087, 41.811979]]}, {
                            "fromName": "吉林",
                            "toName": "济南",
                            "coords": [[126.549572, 43.837883], [117.12, 36.651216]]
                        }, {"fromName": "吉林", "toName": "太原", "coords": [[126.549572, 43.837883], [112.548879, 37.87059]]}, {
                            "fromName": "吉林",
                            "toName": "威海",
                            "coords": [[126.549572, 43.837883], [122.12042, 37.513068]]
                        }, {"fromName": "湖北", "toName": "深圳", "coords": [[114.341862, 30.546498], [114.057868, 22.543099]]}, {
                            "fromName": "内蒙古",
                            "toName": "荣成",
                            "coords": [[111.765618, 40.817498], [122.486658, 37.16516]]
                        }, {"fromName": "辽宁", "toName": "郑州", "coords": [[123.42944, 41.835441], [113.625368, 34.7466]]}, {
                            "fromName": "黑龙江",
                            "toName": "朝阳",
                            "coords": [[126.661669, 45.742347], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "昆山", "coords": [[126.549572, 43.837883], [120.980737, 31.385598]]}, {
                            "fromName": "吉林",
                            "toName": "双城",
                            "coords": [[126.549572, 43.837883], [126.312745, 45.383263]]
                        }, {"fromName": "黑龙江", "toName": "克拉玛依", "coords": [[126.661669, 45.742347], [84.889207, 45.579889]]}, {
                            "fromName": "辽宁",
                            "toName": "上海",
                            "coords": [[123.42944, 41.835441], [121.473701, 31.230416]]
                        }, {"fromName": "吉林", "toName": "海阳", "coords": [[126.549572, 43.837883], [121.158434, 36.776378]]}, {
                            "fromName": "吉林",
                            "toName": "宣武门外东大街",
                            "coords": [[126.549572, 43.837883], [116.378888, 39.899332]]
                        }, {"fromName": "山东", "toName": "海淀", "coords": [[117.020359, 36.66853], [116.298056, 39.959912]]}, {
                            "fromName": "内蒙古",
                            "toName": "威海",
                            "coords": [[111.765618, 40.817498], [122.12042, 37.513068]]
                        }, {"fromName": "黑龙江", "toName": "晋中", "coords": [[126.661669, 45.742347], [112.752695, 37.687024]]}, {
                            "fromName": "西藏",
                            "toName": "广州",
                            "coords": [[91.117212, 29.646923], [113.264435, 23.129163]]
                        }, {"fromName": "辽宁", "toName": "无锡", "coords": [[123.42944, 41.835441], [120.31191, 31.49117]]}, {
                            "fromName": "黑龙江",
                            "toName": "城阳",
                            "coords": [[126.661669, 45.742347], [120.39631, 36.307064]]
                        }, {"fromName": "河北", "toName": "丰台", "coords": [[114.475704, 38.584854], [116.287149, 39.858427]]}, {
                            "fromName": "黑龙江",
                            "toName": "扬州",
                            "coords": [[126.661669, 45.742347], [119.412966, 32.39421]]
                        }, {"fromName": "辽宁", "toName": "天津", "coords": [[123.42944, 41.835441], [117.200983, 39.084158]]}, {
                            "fromName": "吉林",
                            "toName": "扬州",
                            "coords": [[126.549572, 43.837883], [119.412966, 32.39421]]
                        }, {"fromName": "吉林", "toName": "嘉兴", "coords": [[126.549572, 43.837883], [120.755486, 30.746129]]}, {
                            "fromName": "河北",
                            "toName": "延寿",
                            "coords": [[114.475704, 38.584854], [128.331644, 45.451897]]
                        }, {"fromName": "吉林", "toName": "义乌", "coords": [[126.549572, 43.837883], [120.075058, 29.306841]]}, {
                            "fromName": "吉林",
                            "toName": "张家港",
                            "coords": [[126.549572, 43.837883], [120.553284, 31.870367]]
                        }, {"fromName": "辽宁", "toName": "贵阳", "coords": [[123.42944, 41.835441], [106.630154, 26.647661]]}, {
                            "fromName": "吉林",
                            "toName": "辽宁",
                            "coords": [[126.549572, 43.837883], [123.42944, 41.835441]]
                        }, {"fromName": "河南", "toName": "营口", "coords": [[113.274379, 34.445122], [122.235418, 40.667012]]}, {
                            "fromName": "吉林",
                            "toName": "合肥",
                            "coords": [[126.549572, 43.837883], [117.227239, 31.820587]]
                        }, {"fromName": "黑龙江", "toName": "苏州", "coords": [[126.661669, 45.742347], [120.585316, 31.298886]]}, {
                            "fromName": "黑龙江",
                            "toName": "榆树",
                            "coords": [[126.661669, 45.742347], [126.533146, 44.840288]]
                        }, {"fromName": "吉林", "toName": "常熟", "coords": [[126.549572, 43.837883], [120.752481, 31.654376]]}, {
                            "fromName": "吉林",
                            "toName": "乳山",
                            "coords": [[126.549572, 43.837883], [121.539765, 36.919816]]
                        }, {"fromName": "四川", "toName": "青岛", "coords": [[104.075931, 30.651652], [120.38264, 36.067082]]}, {
                            "fromName": "黑龙江",
                            "toName": "深圳",
                            "coords": [[126.661669, 45.742347], [114.057868, 22.543099]]
                        }, {"fromName": "天津", "toName": "东城", "coords": [[117.200983, 39.084158], [116.416357, 39.928353]]}, {
                            "fromName": "黑龙江",
                            "toName": "上海",
                            "coords": [[126.661669, 45.742347], [121.473701, 31.230416]]
                        }, {"fromName": "天津", "toName": "宁波", "coords": [[117.200983, 39.084158], [121.550357, 29.874557]]}, {
                            "fromName": "吉林",
                            "toName": "海门",
                            "coords": [[126.549572, 43.837883], [121.181615, 31.871173]]
                        }, {"fromName": "山西", "toName": "沈阳", "coords": [[112.562398, 37.873532], [123.431475, 41.805698]]}, {
                            "fromName": "吉林",
                            "toName": "成都",
                            "coords": [[126.549572, 43.837883], [104.066541, 30.572269]]
                        }, {"fromName": "吉林", "toName": "南昌", "coords": [[126.549572, 43.837883], [115.858198, 28.682892]]}, {
                            "fromName": "黑龙江",
                            "toName": "常州",
                            "coords": [[126.661669, 45.742347], [119.973987, 31.810689]]
                        }, {"fromName": "内蒙古", "toName": "兰山", "coords": [[111.765618, 40.817498], [118.347707, 35.051729]]}, {
                            "fromName": "吉林",
                            "toName": "河南",
                            "coords": [[126.549572, 43.837883], [113.274379, 34.445122]]
                        }, {"fromName": "黑龙江", "toName": "福田", "coords": [[126.661669, 45.742347], [114.055036, 22.52153]]}, {
                            "fromName": "吉林",
                            "toName": "常州",
                            "coords": [[126.549572, 43.837883], [119.973987, 31.810689]]
                        }, {"fromName": "吉林", "toName": "双流", "coords": [[126.549572, 43.837883], [103.923648, 30.574473]]}, {
                            "fromName": "吉林",
                            "toName": "潍坊",
                            "coords": [[126.549572, 43.837883], [119.161756, 36.706774]]
                        }, {"fromName": "吉林", "toName": "延安", "coords": [[126.549572, 43.837883], [109.489727, 36.585455]]}, {
                            "fromName": "辽宁",
                            "toName": "长春",
                            "coords": [[123.42944, 41.835441], [125.323544, 43.817072]]
                        }, {"fromName": "黑龙江", "toName": "南京", "coords": [[126.661669, 45.742347], [118.796877, 32.060255]]}, {
                            "fromName": "辽宁",
                            "toName": "和平",
                            "coords": [[123.42944, 41.835441], [117.21451, 39.116949]]
                        }, {"fromName": "北京", "toName": "哈尔滨", "coords": [[116.407526, 39.90403], [126.534967, 45.803775]]}, {
                            "fromName": "吉林",
                            "toName": "武汉",
                            "coords": [[126.549572, 43.837883], [114.305393, 30.593099]]
                        }, {"fromName": "吉林", "toName": "海陵", "coords": [[126.549572, 43.837883], [119.919425, 32.491016]]}, {
                            "fromName": "吉林",
                            "toName": "日照",
                            "coords": [[126.549572, 43.837883], [119.526888, 35.416377]]
                        }, {"fromName": "吉林", "toName": "台州", "coords": [[126.549572, 43.837883], [121.420757, 28.656386]]}, {
                            "fromName": "辽宁",
                            "toName": "厦门",
                            "coords": [[123.42944, 41.835441], [118.089425, 24.479834]]
                        }, {"fromName": "黑龙江", "toName": "贵阳", "coords": [[126.661669, 45.742347], [106.630154, 26.647661]]}, {
                            "fromName": "吉林",
                            "toName": "鞍山",
                            "coords": [[126.549572, 43.837883], [122.994329, 41.108647]]
                        }, {"fromName": "辽宁", "toName": "荣成", "coords": [[123.42944, 41.835441], [122.486658, 37.16516]]}, {
                            "fromName": "黑龙江",
                            "toName": "天津",
                            "coords": [[126.661669, 45.742347], [117.200983, 39.084158]]
                        }, {"fromName": "黑龙江", "toName": "河西", "coords": [[126.661669, 45.742347], [117.223372, 39.109563]]}, {
                            "fromName": "黑龙江",
                            "toName": "秦皇岛",
                            "coords": [[126.661669, 45.742347], [119.600493, 39.935385]]
                        }, {"fromName": "吉林", "toName": "荆州", "coords": [[126.549572, 43.837883], [112.239741, 30.335165]]}, {
                            "fromName": "黑龙江",
                            "toName": "东城",
                            "coords": [[126.661669, 45.742347], [116.416357, 39.928353]]
                        }, {"fromName": "吉林", "toName": "即墨", "coords": [[126.549572, 43.837883], [120.447128, 36.389639]]}, {
                            "fromName": "辽宁",
                            "toName": "西城",
                            "coords": [[123.42944, 41.835441], [116.365868, 39.912289]]
                        }, {"fromName": "黑龙江", "toName": "大兴", "coords": [[126.661669, 45.742347], [116.341395, 39.726929]]}, {
                            "fromName": "河北",
                            "toName": "哈尔滨",
                            "coords": [[114.475704, 38.584854], [126.534967, 45.803775]]
                        }, {"fromName": "黑龙江", "toName": "江苏", "coords": [[126.661669, 45.742347], [118.763232, 32.061707]]}, {
                            "fromName": "吉林",
                            "toName": "和平",
                            "coords": [[126.549572, 43.837883], [117.21451, 39.116949]]
                        }, {"fromName": "江苏", "toName": "鸡东", "coords": [[118.763232, 32.061707], [131.12408, 45.260412]]}, {
                            "fromName": "辽宁",
                            "toName": "辉南",
                            "coords": [[123.42944, 41.835441], [126.046912, 42.684993]]
                        }, {"fromName": "吉林", "toName": "深圳", "coords": [[126.549572, 43.837883], [114.057868, 22.543099]]}, {
                            "fromName": "福建",
                            "toName": "泰顺",
                            "coords": [[119.295144, 26.10078], [119.717649, 27.556884]]
                        }, {"fromName": "上海", "toName": "深圳", "coords": [[121.473701, 31.230416], [114.057868, 22.543099]]}, {
                            "fromName": "吉林",
                            "toName": "秦皇岛",
                            "coords": [[126.549572, 43.837883], [119.600493, 39.935385]]
                        }, {"fromName": "吉林", "toName": "徐汇", "coords": [[126.549572, 43.837883], [121.436525, 31.188523]]}, {
                            "fromName": "吉林",
                            "toName": "石景山",
                            "coords": [[126.549572, 43.837883], [116.222982, 39.906611]]
                        }, {"fromName": "辽宁", "toName": "城阳", "coords": [[123.42944, 41.835441], [120.39631, 36.307064]]}, {
                            "fromName": "黑龙江",
                            "toName": "威海",
                            "coords": [[126.661669, 45.742347], [122.12042, 37.513068]]
                        }, {"fromName": "黑龙江", "toName": "惠州", "coords": [[126.661669, 45.742347], [114.416196, 23.111847]]}, {
                            "fromName": "吉林",
                            "toName": "龙口",
                            "coords": [[126.549572, 43.837883], [120.477813, 37.646108]]
                        }, {"fromName": "黑龙江", "toName": "四平", "coords": [[126.661669, 45.742347], [124.350398, 43.16642]]}, {
                            "fromName": "吉林",
                            "toName": "南充",
                            "coords": [[126.549572, 43.837883], [106.110698, 30.837793]]
                        }, {"fromName": "河北", "toName": "东港", "coords": [[114.475704, 38.584854], [124.152705, 39.863008]]}, {
                            "fromName": "辽宁",
                            "toName": "西安",
                            "coords": [[123.42944, 41.835441], [108.940175, 34.341568]]
                        }, {"fromName": "内蒙古", "toName": "滨海", "coords": [[111.765618, 40.817498], [119.820831, 33.990334]]}, {
                            "fromName": "河南",
                            "toName": "青岛",
                            "coords": [[113.274379, 34.445122], [120.38264, 36.067082]]
                        }, {"fromName": "黑龙江", "toName": "昆山", "coords": [[126.661669, 45.742347], [120.980737, 31.385598]]}, {
                            "fromName": "辽宁",
                            "toName": "长沙",
                            "coords": [[123.42944, 41.835441], [112.938814, 28.228209]]
                        }, {"fromName": "吉林", "toName": "哈尔滨", "coords": [[126.549572, 43.837883], [126.534967, 45.803775]]}, {
                            "fromName": "河北",
                            "toName": "尚志",
                            "coords": [[114.475704, 38.584854], [128.009895, 45.209586]]
                        }, {"fromName": "辽宁", "toName": "东城", "coords": [[123.42944, 41.835441], [116.416357, 39.928353]]}, {
                            "fromName": "辽宁",
                            "toName": "珠海",
                            "coords": [[123.42944, 41.835441], [113.576726, 22.270715]]
                        }, {"fromName": "黑龙江", "toName": "铁岭", "coords": [[126.661669, 45.742347], [123.726166, 42.223769]]}, {
                            "fromName": "黑龙江",
                            "toName": "蓬莱",
                            "coords": [[126.661669, 45.742347], [120.758848, 37.810661]]
                        }, {"fromName": "北京", "toName": "天津", "coords": [[116.407526, 39.90403], [117.200983, 39.084158]]}, {
                            "fromName": "内蒙古",
                            "toName": "天津",
                            "coords": [[111.765618, 40.817498], [117.200983, 39.084158]]
                        }, {"fromName": "黑龙江", "toName": "宁波", "coords": [[126.661669, 45.742347], [121.550357, 29.874557]]}, {
                            "fromName": "吉林",
                            "toName": "上海",
                            "coords": [[126.549572, 43.837883], [121.473701, 31.230416]]
                        }, {"fromName": "辽宁", "toName": "佛山", "coords": [[123.42944, 41.835441], [113.121416, 23.021548]]}, {
                            "fromName": "吉林",
                            "toName": "长宁",
                            "coords": [[126.549572, 43.837883], [121.424624, 31.220367]]
                        }, {"fromName": "黑龙江", "toName": "珲春", "coords": [[126.661669, 45.742347], [130.366036, 42.862821]]}, {
                            "fromName": "山东",
                            "toName": "黄浦",
                            "coords": [[117.020359, 36.66853], [121.484443, 31.231763]]
                        }, {"fromName": "辽宁", "toName": "威海", "coords": [[123.42944, 41.835441], [122.12042, 37.513068]]}, {
                            "fromName": "天津",
                            "toName": "长春",
                            "coords": [[117.200983, 39.084158], [125.323544, 43.817072]]
                        }, {"fromName": "新疆", "toName": "上海", "coords": [[87.627704, 43.793026], [121.473701, 31.230416]]}, {
                            "fromName": "河北",
                            "toName": "鸡西",
                            "coords": [[114.475704, 38.584854], [130.969333, 45.295075]]
                        }, {"fromName": "陕西", "toName": "呼和浩特", "coords": [[108.954239, 34.265472], [111.749181, 40.842585]]}, {
                            "fromName": "吉林",
                            "toName": "连云港",
                            "coords": [[126.549572, 43.837883], [119.221611, 34.596653]]
                        }, {"fromName": "黑龙江", "toName": "杭州", "coords": [[126.661669, 45.742347], [120.15507, 30.274085]]}, {
                            "fromName": "黑龙江",
                            "toName": "嘉兴",
                            "coords": [[126.661669, 45.742347], [120.755486, 30.746129]]
                        }, {"fromName": "陕西", "toName": "盘锦", "coords": [[108.954239, 34.265472], [122.070714, 41.119997]]}, {
                            "fromName": "河北",
                            "toName": "同江",
                            "coords": [[114.475704, 38.584854], [132.510919, 47.642707]]
                        }, {"fromName": "吉林", "toName": "杭州", "coords": [[126.549572, 43.837883], [120.15507, 30.274085]]}, {
                            "fromName": "黑龙江",
                            "toName": "舟山",
                            "coords": [[126.661669, 45.742347], [122.207216, 29.985295]]
                        }, {"fromName": "河南", "toName": "大连", "coords": [[113.274379, 34.445122], [121.614682, 38.914003]]}, {
                            "fromName": "辽宁",
                            "toName": "绵阳",
                            "coords": [[123.42944, 41.835441], [104.679114, 31.46745]]
                        }, {"fromName": "吉林", "toName": "溆浦", "coords": [[126.549572, 43.837883], [110.594921, 27.908281]]}, {
                            "fromName": "吉林",
                            "toName": "朝阳",
                            "coords": [[126.549572, 43.837883], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "无锡", "coords": [[126.549572, 43.837883], [120.31191, 31.49117]]}, {
                            "fromName": "浙江",
                            "toName": "沈阳",
                            "coords": [[120.152792, 30.267447], [123.431475, 41.805698]]
                        }, {"fromName": "吉林", "toName": "湖里", "coords": [[126.549572, 43.837883], [118.146769, 24.512905]]}, {
                            "fromName": "黑龙江",
                            "toName": "无锡",
                            "coords": [[126.661669, 45.742347], [120.31191, 31.49117]]
                        }, {"fromName": "黑龙江", "toName": "长宁", "coords": [[126.661669, 45.742347], [121.424624, 31.220367]]}, {
                            "fromName": "辽宁",
                            "toName": "胶州",
                            "coords": [[123.42944, 41.835441], [120.033382, 36.26468]]
                        }, {"fromName": "吉林", "toName": "青岛", "coords": [[126.549572, 43.837883], [120.38264, 36.067082]]}, {
                            "fromName": "河北",
                            "toName": "海淀",
                            "coords": [[114.475704, 38.584854], [116.298056, 39.959912]]
                        }, {"fromName": "黑龙江", "toName": "厦门", "coords": [[126.661669, 45.742347], [118.089425, 24.479834]]}, {
                            "fromName": "黑龙江",
                            "toName": "中山",
                            "coords": [[126.661669, 45.742347], [113.392782, 22.517646]]
                        }, {"fromName": "河北", "toName": "太原", "coords": [[114.475704, 38.584854], [112.548879, 37.87059]]}, {
                            "fromName": "新疆",
                            "toName": "吉林",
                            "coords": [[87.627704, 43.793026], [126.549572, 43.837883]]
                        }, {"fromName": "吉林", "toName": "武侯", "coords": [[126.549572, 43.837883], [104.04339, 30.641982]]}, {
                            "fromName": "北京",
                            "toName": "廊坊",
                            "coords": [[116.407526, 39.90403], [116.683752, 39.538047]]
                        }, {"fromName": "浙江", "toName": "临汾", "coords": [[120.152792, 30.267447], [111.518976, 36.088005]]}, {
                            "fromName": "湖北",
                            "toName": "天津",
                            "coords": [[114.341862, 30.546498], [117.200983, 39.084158]]
                        }, {"fromName": "黑龙江", "toName": "泉州", "coords": [[126.661669, 45.742347], [118.675676, 24.874132]]}, {
                            "fromName": "黑龙江",
                            "toName": "温州",
                            "coords": [[126.661669, 45.742347], [120.699367, 27.994267]]
                        }, {"fromName": "黑龙江", "toName": "唐山", "coords": [[126.661669, 45.742347], [118.180194, 39.630867]]}, {
                            "fromName": "北京",
                            "toName": "铁岭",
                            "coords": [[116.407526, 39.90403], [123.726166, 42.223769]]
                        }, {"fromName": "辽宁", "toName": "即墨", "coords": [[123.42944, 41.835441], [120.447128, 36.389639]]}, {
                            "fromName": "北京",
                            "toName": "上海",
                            "coords": [[116.407526, 39.90403], [121.473701, 31.230416]]
                        }, {"fromName": "黑龙江", "toName": "广州", "coords": [[126.661669, 45.742347], [113.264435, 23.129163]]}, {
                            "fromName": "吉林",
                            "toName": "廊坊",
                            "coords": [[126.549572, 43.837883], [116.683752, 39.538047]]
                        }, {"fromName": "黑龙江", "toName": "荣成", "coords": [[126.661669, 45.742347], [122.486658, 37.16516]]}, {
                            "fromName": "吉林",
                            "toName": "海城",
                            "coords": [[126.549572, 43.837883], [122.685217, 40.882377]]
                        }, {"fromName": "湖南", "toName": "沈阳", "coords": [[112.98381, 28.112444], [123.431475, 41.805698]]}, {
                            "fromName": "北京",
                            "toName": "青岛",
                            "coords": [[116.407526, 39.90403], [120.38264, 36.067082]]
                        }, {"fromName": "河北", "toName": "大连", "coords": [[114.475704, 38.584854], [121.614682, 38.914003]]}, {
                            "fromName": "内蒙古",
                            "toName": "珠海",
                            "coords": [[111.765618, 40.817498], [113.576726, 22.270715]]
                        }, {"fromName": "黑龙江", "toName": "房山", "coords": [[126.661669, 45.742347], [116.143267, 39.749144]]}, {
                            "fromName": "黑龙江",
                            "toName": "金坛",
                            "coords": [[126.661669, 45.742347], [119.597897, 31.723247]]
                        }, {"fromName": "河北", "toName": "齐齐哈尔", "coords": [[114.475704, 38.584854], [126.661669, 45.742347]]}, {
                            "fromName": "吉林",
                            "toName": "大兴",
                            "coords": [[126.549572, 43.837883], [116.341395, 39.726929]]
                        }, {"fromName": "吉林", "toName": "密云", "coords": [[126.549572, 43.837883], [116.801346, 40.35874]]}, {
                            "fromName": "黑龙江",
                            "toName": "和平",
                            "coords": [[126.661669, 45.742347], [117.21451, 39.116949]]
                        }, {"fromName": "内蒙古", "toName": "龙井", "coords": [[111.765618, 40.817498], [129.427066, 42.766311]]}, {
                            "fromName": "吉林",
                            "toName": "道里",
                            "coords": [[126.549572, 43.837883], [126.616957, 45.755777]]
                        }, {"fromName": "山东", "toName": "武汉", "coords": [[117.020359, 36.66853], [114.305393, 30.593099]]}, {
                            "fromName": "甘肃",
                            "toName": "常熟",
                            "coords": [[103.826308, 36.059421], [120.752481, 31.654376]]
                        }, {"fromName": "黑龙江", "toName": "烟台", "coords": [[126.661669, 45.742347], [121.447935, 37.463822]]}, {
                            "fromName": "吉林",
                            "toName": "海淀",
                            "coords": [[126.549572, 43.837883], [116.298056, 39.959912]]
                        }, {"fromName": "黑龙江", "toName": "长沙", "coords": [[126.661669, 45.742347], [112.938814, 28.228209]]}, {
                            "fromName": "天津",
                            "toName": "石家庄",
                            "coords": [[117.200983, 39.084158], [114.51486, 38.042307]]
                        }, {"fromName": "吉林", "toName": "佛山", "coords": [[126.549572, 43.837883], [113.121416, 23.021548]]}, {
                            "fromName": "辽宁",
                            "toName": "黄骅",
                            "coords": [[123.42944, 41.835441], [117.330048, 38.371383]]
                        }, {"fromName": "内蒙古", "toName": "中山", "coords": [[111.765618, 40.817498], [113.392782, 22.517646]]}, {
                            "fromName": "黑龙江",
                            "toName": "北京",
                            "coords": [[126.661669, 45.742347], [116.407526, 39.90403]]
                        }, {"fromName": "黑龙江", "toName": "三河", "coords": [[126.661669, 45.742347], [117.078295, 39.982718]]}, {
                            "fromName": "河北",
                            "toName": "庆安",
                            "coords": [[114.475704, 38.584854], [127.507825, 46.880102]]
                        }, {"fromName": "吉林", "toName": "长沙", "coords": [[126.549572, 43.837883], [112.938814, 28.228209]]}, {
                            "fromName": "黑龙江",
                            "toName": "西安",
                            "coords": [[126.661669, 45.742347], [108.940175, 34.341568]]
                        }, {"fromName": "内蒙古", "toName": "朝阳", "coords": [[111.765618, 40.817498], [116.443108, 39.92147]]}, {
                            "fromName": "辽宁",
                            "toName": "丰台",
                            "coords": [[123.42944, 41.835441], [116.287149, 39.858427]]
                        }, {"fromName": "黑龙江", "toName": "延吉", "coords": [[126.661669, 45.742347], [129.508946, 42.891255]]}, {
                            "fromName": "黑龙江",
                            "toName": "长春",
                            "coords": [[126.661669, 45.742347], [125.323544, 43.817072]]
                        }, {"fromName": "吉林", "toName": "天津", "coords": [[126.549572, 43.837883], [117.200983, 39.084158]]}, {
                            "fromName": "吉林",
                            "toName": "昌平",
                            "coords": [[126.549572, 43.837883], [116.231204, 40.22066]]
                        }, {"fromName": "吉林", "toName": "赣州", "coords": [[126.549572, 43.837883], [114.93503, 25.831829]]}, {
                            "fromName": "吉林",
                            "toName": "厦门",
                            "coords": [[126.549572, 43.837883], [118.089425, 24.479834]]
                        }, {"fromName": "内蒙古", "toName": "秦皇岛", "coords": [[111.765618, 40.817498], [119.600493, 39.935385]]}, {
                            "fromName": "内蒙古",
                            "toName": "菏泽",
                            "coords": [[111.765618, 40.817498], [115.480656, 35.23375]]
                        }, {"fromName": "吉林", "toName": "闵行", "coords": [[126.549572, 43.837883], [121.381709, 31.112813]]}, {
                            "fromName": "辽宁",
                            "toName": "石景山",
                            "coords": [[123.42944, 41.835441], [116.222982, 39.906611]]
                        }, {"fromName": "吉林", "toName": "珠海", "coords": [[126.549572, 43.837883], [113.576726, 22.270715]]}, {
                            "fromName": "内蒙古",
                            "toName": "青岛",
                            "coords": [[111.765618, 40.817498], [120.38264, 36.067082]]
                        }, {"fromName": "北京", "toName": "海门", "coords": [[116.407526, 39.90403], [121.181615, 31.871173]]}, {
                            "fromName": "内蒙古",
                            "toName": "长春",
                            "coords": [[111.765618, 40.817498], [125.323544, 43.817072]]
                        }, {"fromName": "吉林", "toName": "城阳", "coords": [[126.549572, 43.837883], [120.39631, 36.307064]]}, {
                            "fromName": "吉林",
                            "toName": "大同",
                            "coords": [[126.549572, 43.837883], [113.61244, 40.040295]]
                        }, {"fromName": "湖北", "toName": "邢台", "coords": [[114.341862, 30.546498], [114.504844, 37.070589]]}, {
                            "fromName": "吉林",
                            "toName": "胶州",
                            "coords": [[126.549572, 43.837883], [120.033382, 36.26468]]
                        }, {"fromName": "吉林", "toName": "重庆", "coords": [[126.549572, 43.837883], [106.551557, 29.56301]]}, {
                            "fromName": "河北",
                            "toName": "佳木斯",
                            "coords": [[114.475704, 38.584854], [130.318917, 46.799923]]
                        }, {"fromName": "甘肃", "toName": "大连", "coords": [[103.826308, 36.059421], [121.614682, 38.914003]]}, {
                            "fromName": "吉林",
                            "toName": "南京",
                            "coords": [[126.549572, 43.837883], [118.796877, 32.060255]]
                        }, {"fromName": "内蒙古", "toName": "日照", "coords": [[111.765618, 40.817498], [119.526888, 35.416377]]}, {
                            "fromName": "吉林",
                            "toName": "鸡东",
                            "coords": [[126.549572, 43.837883], [131.12408, 45.260412]]
                        }, {"fromName": "黑龙江", "toName": "即墨", "coords": [[126.661669, 45.742347], [120.447128, 36.389639]]}, {
                            "fromName": "江苏",
                            "toName": "朝阳",
                            "coords": [[118.763232, 32.061707], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "南通", "coords": [[126.549572, 43.837883], [120.894291, 31.980172]]}, {
                            "fromName": "黑龙江",
                            "toName": "张家港",
                            "coords": [[126.661669, 45.742347], [120.553284, 31.870367]]
                        }, {"fromName": "吉林", "toName": "三河", "coords": [[126.549572, 43.837883], [117.078295, 39.982718]]}, {
                            "fromName": "吉林",
                            "toName": "咸阳",
                            "coords": [[126.549572, 43.837883], [108.708991, 34.329605]]
                        }, {"fromName": "吉林", "toName": "中山", "coords": [[126.549572, 43.837883], [113.392782, 22.517646]]}, {
                            "fromName": "黑龙江",
                            "toName": "胶州",
                            "coords": [[126.661669, 45.742347], [120.033382, 36.26468]]
                        }]
                    };

                    var option = {
                        backgroundColor: '#404a59',
                        title: {
                            text: '全国司机运输线路详情',
                            left: 'center',
                            textStyle: {
                                color: '#fff'
                            }
                        },
                        legend: {
                            show: false,
                            orient: 'vertical',
                            top: 'bottom',
                            left: 'right',
                            data: ['地点', '线路'],
                            textStyle: {
                                color: '#fff'
                            }
                        },
                        geo: {
                            map: 'china',
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#404a59'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            }
                        },
                        series: [{
                            name: '地点',
                            type: 'effectScatter',
                            coordinateSystem: 'geo',
                            zlevel: 2,
                            rippleEffect: {
                                brushType: 'stroke'
                            },
                            label: {
                                emphasis: {
                                    show: true,
                                    position: 'right',
                                    formatter: '{b}'
                                }
                            },
                            symbolSize: 2,
                            showEffectOn: 'render',
                            itemStyle: {
                                normal: {
                                    color: '#46bee9'
                                }
                            },
                            data: allData.citys
                        }, {
                            name: '线路',
                            type: 'lines',
                            coordinateSystem: 'geo',
                            zlevel: 2,
                            large: true,
                            effect: {
                                show: true,
                                constantSpeed: 30,
                                symbol: 'pin',
                                symbolSize: 3,
                                trailLength: 0,
                            },
                            lineStyle: {
                                normal: {
                                    color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                                        offset: 0, color: '#58B3CC'
                                    }, {
                                        offset: 1, color: '#F58158'
                                    }], false),
                                    width: 1,
                                    opacity: 0.2,
                                    curveness: 0.1
                                }
                            },
                            data: allData.moveLines
                        }]
                    };
                    car.setOption(option);
                })
            }
        };
    }])
    /**
     * 企业关系
     */
    .directive("relation", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='relation' style='width: auto'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $http) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('relation');
                    height.style.height = (window.screen.height + window.screenTop) + 5 + 'px';
                    var relation = echarts.init(document.getElementById('relation'));
                    relation.showLoading();
                    var json = {
                        "nodes": [
                            {
                                "color": "#4f19c7",
                                "label": "晋钢集团",
                                "attributes": {},
                                "y": -404.26147,
                                "x": -739.36383,
                                "id": "1",
                                "size": 4.7252817
                            }, {
                                "color": "#c71969",
                                "label": "中钢集团",
                                "attributes": {},
                                "y": -862.7517,
                                "x": -134.2215,
                                "id": "2",
                                "size": 6.1554675
                            }, {
                                "color": "#c71969",
                                "label": "山西焦煤",
                                "attributes": {},
                                "y": -734.4221,
                                "x": -75.53079,
                                "id": "3",
                                "size": 50.0
                            }, {
                                "color": "#c71969",
                                "label": "大同矿业",
                                "attributes": {},
                                "y": 624.50604,
                                "x": -818.97516,
                                "id": "4",
                                "size": 50.67816025
                            }, {
                                "color": "#c71919",
                                "label": "广西煤业",
                                "attributes": {},
                                "y": 120.37976,
                                "x": -710.59204,
                                "id": "5",
                                "size": 19.818306
                            }, {
                                "color": "#c71969",
                                "label": "北京大兴",
                                "attributes": {},
                                "y": -612.5541,
                                "x": 71.52897,
                                "id": "6",
                                "size": 4.0862627
                            }, {
                                "color": "#c71969",
                                "label": "激情四射",
                                "attributes": {},
                                "y": -556.3107,
                                "x": 1202.1166,
                                "id": "7",
                                "size": 20.3822114
                            }, {
                                "color": "#1984c7",
                                "label": "库精神科",
                                "attributes": {},
                                "y": 378.15536,
                                "x": -1150.2018,
                                "id": "8",
                                "size": 10.81118
                            }, {
                                "color": "#c76919",
                                "label": "你是纱布",
                                "attributes": {},
                                "y": 477.03778,
                                "x": -127.03764,
                                "id": "9",
                                "size": 30.40429485
                            }, {
                                "color": "#8419c7",
                                "label": "一堆购难",
                                "attributes": {},
                                "y": -404.62427,
                                "x": -338.03128,
                                "id": "10",
                                "size": 28.163814
                            }
                        ],
                        "edges": [
                            {
                                "sourceID": "1",
                                "attributes": {},
                                "targetID": "2",
                                "size": 3
                            }, {
                                "sourceID": "2",
                                "attributes": {},
                                "targetID": "6",
                                "size": 6
                            }, {
                                "sourceID": "3",
                                "attributes": {},
                                "targetID": "5",
                                "size": 2
                            }, {
                                "sourceID": "4",
                                "attributes": {},
                                "targetID": "4",
                                "size": 4
                            }, {
                                "sourceID": "5",
                                "attributes": {},
                                "targetID": "4",
                                "size": 5
                            }, {
                                "sourceID": "6",
                                "attributes": {},
                                "targetID": "4",
                                "size": 2
                            }, {
                                "sourceID": "7",
                                "attributes": {},
                                "targetID": "4",
                                "size": 6
                            }, {
                                "sourceID": "8",
                                "attributes": {},
                                "targetID": "1",
                                "size": 1
                            }, {
                                "sourceID": "9",
                                "attributes": {},
                                "targetID": "2",
                                "size": 1
                            }, {
                                "sourceID": "10",
                                "attributes": {},
                                "targetID": "3",
                                "size": 1
                            }]
                    }
                    // 随机数
                    function fRandomBy(under, over) {
                        switch (arguments.length) {
                            case 1:
                                return parseInt(Math.random() * under + 1);
                            case 2:
                                return parseInt(Math.random() * (over - under + 1) + under);
                            default:
                                return 0;
                        }
                    }

                    // 随机数
                    angular.forEach(json.nodes, function (data) {
                        console.log(data)
                        console.log('11', fRandomBy(100, window.screen.height))
                        console.log('22', fRandomBy(100, window.screen.height))

                    })
                    // console.log('json',JSON.stringify(json))
                    // $http.get('data/asset/data/npmdepgraph.min10.json').success(function (json) {
                    relation.hideLoading();
                    var option = {
                        title: {
                            text: '企业关系图谱',
                            subtext: '由日升昌大数据中心提供计算服务',
                            left: 'center',
                        },
                        animationDurationUpdate: 1500,
                        animationEasingUpdate: 'quinticInOut',
                        series: [
                            {
                                type: 'graph',
                                layout: 'none',
                                // progressiveThreshold: 700,
                                data: json.nodes.map(function (node) {
                                    return {
                                        x: node.x,
                                        y: node.y,
                                        id: node.id,
                                        name: node.label,
                                        symbolSize: node.size,
                                        itemStyle: {
                                            normal: {
                                                color: node.color
                                            }
                                        }
                                    };
                                }),
                                edges: json.edges.map(function (edge) {
                                    return {
                                        source: edge.sourceID,
                                        target: edge.targetID
                                    };
                                }),
                                label: {
                                    emphasis: {
                                        position: 'right',
                                        show: true
                                    }
                                },
                                roam: true,
                                focusNodeAdjacency: true,
                                lineStyle: {
                                    normal: {
                                        width: 0.5,
                                        curveness: 0.3,
                                        opacity: 0.7
                                    }
                                }
                            }
                        ]
                    };
                    // });
                    relation.setOption(option);
                })
            }
        };
    }])
    /**
     * 市场分布
     */
    .directive("market", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='market' style='width: auto'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('market');
                    height.style.height = (window.screen.height + window.screenTop) + 5 + 'px';
                    var market = echarts.init(document.getElementById('market'));
                    market.showLoading();

                    var household_america_2012 = 113616229;
                    var obama_budget_2012 = [
                        {
                            "value": [
                                1226629000,
                                null,
                                null
                            ],
                            "name": "Health and Human Services",
                            "id": "branch-8",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        1105220000,
                                        1071808000,
                                        3.11734937600765
                                    ],
                                    "name": "Centers for Medicare and Medicaid Services",
                                    "id": "leaf-135",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        34502000,
                                        34325000,
                                        0.515659140568103
                                    ],
                                    "name": "Administration for Children and Families",
                                    "id": "leaf-131",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        31829000,
                                        30784000,
                                        3.39462058212059
                                    ],
                                    "name": "National Institutes of Health",
                                    "id": "leaf-127",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        16180000,
                                        17334000,
                                        -6.65743625245183
                                    ],
                                    "name": "Administration for Children and Families",
                                    "id": "leaf-118",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7324000,
                                        6246000,
                                        17.2590457893051
                                    ],
                                    "name": "Centers for Medicare and Medicaid Services",
                                    "id": "leaf-121",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6821000,
                                        7506000,
                                        -9.12603250732747
                                    ],
                                    "name": "Health Resources and Services Administration",
                                    "id": "leaf-125",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5893000,
                                        6467000,
                                        -8.8758311427246
                                    ],
                                    "name": "Centers for Disease Control and Prevention",
                                    "id": "leaf-120",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4624000,
                                        4053000,
                                        14.0883296323711
                                    ],
                                    "name": "Indian Health Services",
                                    "id": "leaf-126",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3387000,
                                        3431000,
                                        -1.28242494899447
                                    ],
                                    "name": "Substance Abuse and Mental Health Services Administration",
                                    "id": "leaf-130",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2744000,
                                        2599000,
                                        5.57906887264332
                                    ],
                                    "name": "Food and Drug Administration",
                                    "id": "leaf-124",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2237000,
                                        1513000,
                                        47.8519497686715
                                    ],
                                    "name": "Administration on Aging",
                                    "id": "leaf-119",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2155000,
                                        707000,
                                        204.809052333805
                                    ],
                                    "name": "Health Resources and Services Administration",
                                    "id": "leaf-139",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1063000,
                                        4554000,
                                        -76.6578831796223
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-123",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        809000,
                                        297000,
                                        172.390572390572
                                    ],
                                    "name": "Centers for Disease Control and Prevention",
                                    "id": "leaf-134",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        647000,
                                        610000,
                                        6.06557377049179
                                    ],
                                    "name": "Program Support Center",
                                    "id": "leaf-143",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        473000,
                                        1047000,
                                        -54.8233046800382
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-137",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        210000,
                                        10000,
                                        2000
                                    ],
                                    "name": "Administration on Aging",
                                    "id": "leaf-132",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        166000,
                                        166000,
                                        0
                                    ],
                                    "name": "National Institutes of Health",
                                    "id": "leaf-141",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        158000,
                                        158000,
                                        0
                                    ],
                                    "name": "Indian Health Services",
                                    "id": "leaf-140",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        93000,
                                        20000,
                                        365
                                    ],
                                    "name": "Substance Abuse and Mental Health Services Administration",
                                    "id": "leaf-144",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        53000,
                                        50000,
                                        6.00000000000001
                                    ],
                                    "name": "Office of the Inspector General",
                                    "id": "leaf-128",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        39000,
                                        36000,
                                        8.33333333333333
                                    ],
                                    "name": "Program Support Center",
                                    "id": "leaf-129",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "Food and Drug Administration",
                                    "id": "leaf-138",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                818284000,
                                null,
                                null
                            ],
                            "name": "Social Security Administration",
                            "id": "branch-34",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        808041000,
                                        744812000,
                                        8.48925634925324
                                    ],
                                    "name": "Social Security Administration",
                                    "id": "leaf-531",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        10243000,
                                        9294000,
                                        10.2108887454271
                                    ],
                                    "name": "Social Security Administration",
                                    "id": "leaf-530",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                677483000,
                                null,
                                null
                            ],
                            "name": "Defense--Military Programs",
                            "id": "branch-5",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        294891000,
                                        292828000,
                                        0.704509131640418
                                    ],
                                    "name": "Operation and Maintenance",
                                    "id": "leaf-77",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        154057000,
                                        152586000,
                                        0.964046504921812
                                    ],
                                    "name": "Military Personnel",
                                    "id": "leaf-76",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        128051000,
                                        135819000,
                                        -5.71937652316686
                                    ],
                                    "name": "Procurement",
                                    "id": "leaf-78",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        75722000,
                                        80232000,
                                        -5.62119852427959
                                    ],
                                    "name": "Research, Development, Test, and Evaluation",
                                    "id": "leaf-79",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13073000,
                                        22578000,
                                        -42.0985029674905
                                    ],
                                    "name": "Military Construction",
                                    "id": "leaf-75",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5475000,
                                        4516000,
                                        21.2356067316209
                                    ],
                                    "name": "Military Personnel",
                                    "id": "leaf-83",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3136000,
                                        4159000,
                                        -24.5972589564799
                                    ],
                                    "name": "Revolving and Management Funds",
                                    "id": "leaf-80",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1695000,
                                        2267000,
                                        -25.2315835906484
                                    ],
                                    "name": "Family Housing",
                                    "id": "leaf-74",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        836000,
                                        804000,
                                        3.98009950248757
                                    ],
                                    "name": "Operation and Maintenance",
                                    "id": "leaf-84",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        447000,
                                        756000,
                                        -40.8730158730159
                                    ],
                                    "name": "Trust Funds",
                                    "id": "leaf-88",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        100000,
                                        756000,
                                        null
                                    ],
                                    "name": "Research, Development, Test, and Evaluation",
                                    "id": "leaf-86",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                612004000,
                                null,
                                null
                            ],
                            "name": "Treasury",
                            "id": "branch-15",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        474146000,
                                        413955000,
                                        14.5404693746905
                                    ],
                                    "name": "Interest on the Public Debt",
                                    "id": "leaf-279",
                                    "discretion": "net interest"
                                },
                                {
                                    "value": [
                                        82053000,
                                        110583000,
                                        -25.7996256205746
                                    ],
                                    "name": "Internal Revenue Service",
                                    "id": "leaf-275",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        24495000,
                                        12679000,
                                        93.1934695165234
                                    ],
                                    "name": "Financial Management Service",
                                    "id": "leaf-278",
                                    "discretion": "net interest"
                                },
                                {
                                    "value": [
                                        13285000,
                                        12147000,
                                        9.36856837079114
                                    ],
                                    "name": "Internal Revenue Service",
                                    "id": "leaf-269",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9495000,
                                        15156000,
                                        -37.3515439429929
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-273",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3841000,
                                        2192000,
                                        75.228102189781
                                    ],
                                    "name": "Financial Management Service",
                                    "id": "leaf-274",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3289000,
                                        2177000,
                                        51.0794671566376
                                    ],
                                    "name": "Internal Revenue Service",
                                    "id": "leaf-280",
                                    "discretion": "net interest"
                                },
                                {
                                    "value": [
                                        510000,
                                        378000,
                                        34.9206349206349
                                    ],
                                    "name": "Alcohol and Tobacco Tax and Trade Bureau",
                                    "id": "leaf-270",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        219000,
                                        244000,
                                        -10.2459016393443
                                    ],
                                    "name": "Financial Management Service",
                                    "id": "leaf-268",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        166000,
                                        861000,
                                        -80.7200929152149
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-266",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        166000,
                                        185000,
                                        -10.2702702702703
                                    ],
                                    "name": "Bureau of the Public Debt",
                                    "id": "leaf-264",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        127000,
                                        103000,
                                        23.3009708737864
                                    ],
                                    "name": "Bureau of the Public Debt",
                                    "id": "leaf-271",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        114000,
                                        111000,
                                        2.7027027027027
                                    ],
                                    "name": "Financial Crimes Enforcement Network",
                                    "id": "leaf-267",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        98000,
                                        103000,
                                        -4.85436893203883
                                    ],
                                    "name": "Alcohol and Tobacco Tax and Trade Bureau",
                                    "id": "leaf-263",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                148349000,
                                null,
                                null
                            ],
                            "name": "Agriculture",
                            "id": "branch-3",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        104212000,
                                        85935000,
                                        21.2684005352883
                                    ],
                                    "name": "Food and Nutrition Service",
                                    "id": "leaf-39",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        9801000,
                                        10069000,
                                        -2.66163472042904
                                    ],
                                    "name": "Farm Service Agency",
                                    "id": "leaf-38",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        7765000,
                                        8227000,
                                        -5.61565576759451
                                    ],
                                    "name": "Food and Nutrition Service",
                                    "id": "leaf-14",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5125000,
                                        5313000,
                                        -3.53849049501224
                                    ],
                                    "name": "Forest Service",
                                    "id": "leaf-17",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4592000,
                                        2939000,
                                        56.2436202790065
                                    ],
                                    "name": "Natural Resources Conservation Service",
                                    "id": "leaf-44",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2981000,
                                        4547000,
                                        -34.4402903012976
                                    ],
                                    "name": "Risk Management Agency",
                                    "id": "leaf-47",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2124000,
                                        2376000,
                                        -10.6060606060606
                                    ],
                                    "name": "Foreign Agricultural Service",
                                    "id": "leaf-16",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1777000,
                                        2139000,
                                        -16.9237961664329
                                    ],
                                    "name": "Farm Service Agency",
                                    "id": "leaf-13",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1446000,
                                        1885000,
                                        -23.289124668435
                                    ],
                                    "name": "Rural Housing Service",
                                    "id": "leaf-31",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1306000,
                                        1276000,
                                        2.35109717868338
                                    ],
                                    "name": "Agricultural Marketing Service",
                                    "id": "leaf-33",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1209000,
                                        1351000,
                                        -10.5107327905255
                                    ],
                                    "name": "National Institute of Food and Agriculture",
                                    "id": "leaf-21",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1011000,
                                        1019000,
                                        -0.785083415112853
                                    ],
                                    "name": "Food Safety and Inspection Service",
                                    "id": "leaf-15",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        914000,
                                        1251000,
                                        -26.9384492406075
                                    ],
                                    "name": "Agricultural Research Service",
                                    "id": "leaf-7",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        838000,
                                        949000,
                                        -11.6965226554268
                                    ],
                                    "name": "Animal and Plant Health Inspection Service",
                                    "id": "leaf-8",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        695000,
                                        779000,
                                        -10.783055198973
                                    ],
                                    "name": "Forest Service",
                                    "id": "leaf-42",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        577000,
                                        694000,
                                        -16.8587896253602
                                    ],
                                    "name": "Rural Utilities Service",
                                    "id": "leaf-32",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        412000,
                                        431000,
                                        -4.40835266821346
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-10",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        264000,
                                        320000,
                                        -17.5
                                    ],
                                    "name": "Animal and Plant Health Inspection Service",
                                    "id": "leaf-35",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        234000,
                                        202000,
                                        15.8415841584158
                                    ],
                                    "name": "Rural Development",
                                    "id": "leaf-30",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        175000,
                                        384000,
                                        -54.4270833333333
                                    ],
                                    "name": "Rural Business_Cooperative Service",
                                    "id": "leaf-48",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        165000,
                                        162000,
                                        1.85185185185186
                                    ],
                                    "name": "National Agricultural Statistics Service",
                                    "id": "leaf-19",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        134000,
                                        123000,
                                        8.9430894308943
                                    ],
                                    "name": "National Institute of Food and Agriculture",
                                    "id": "leaf-43",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        99000,
                                        93000,
                                        6.4516129032258
                                    ],
                                    "name": "Agricultural Marketing Service",
                                    "id": "leaf-6",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        91000,
                                        89000,
                                        2.24719101123596
                                    ],
                                    "name": "Office of the Inspector General",
                                    "id": "leaf-26",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        86000,
                                        82000,
                                        4.87804878048781
                                    ],
                                    "name": "Economic Research Service",
                                    "id": "leaf-11",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        82000,
                                        80000,
                                        2.49999999999999
                                    ],
                                    "name": "Risk Management Agency",
                                    "id": "leaf-28",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        53000,
                                        18000,
                                        194.444444444444
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-27",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        46000,
                                        44000,
                                        4.54545454545454
                                    ],
                                    "name": "Office of the General Counsel",
                                    "id": "leaf-25",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        44000,
                                        42000,
                                        4.76190476190477
                                    ],
                                    "name": "Grain Inspection, Packers and Stockyards Administration",
                                    "id": "leaf-18",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        22000,
                                        22000,
                                        0
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-37",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        18000,
                                        14000,
                                        28.5714285714286
                                    ],
                                    "name": "Agricultural Research Service",
                                    "id": "leaf-34",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        15000,
                                        15000,
                                        0
                                    ],
                                    "name": "National Appeals Division",
                                    "id": "leaf-20",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        15000,
                                        13000,
                                        15.3846153846154
                                    ],
                                    "name": "Office of Chief Economist",
                                    "id": "leaf-23",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000,
                                        10000,
                                        0
                                    ],
                                    "name": "Office of Communications",
                                    "id": "leaf-24",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        10000,
                                        -10
                                    ],
                                    "name": "Food Safety and Inspection Service",
                                    "id": "leaf-40",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-46",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Office of Chief Economist",
                                    "id": "leaf-45",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                132612000,
                                null,
                                null
                            ],
                            "name": "Labor",
                            "id": "branch-12",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        117659000,
                                        240093000,
                                        -50.9944063342122
                                    ],
                                    "name": "Employment and Training Administration",
                                    "id": "leaf-218",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        10000000,
                                        10917000,
                                        -8.39974351928186
                                    ],
                                    "name": "Employment and Training Administration",
                                    "id": "leaf-209",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2078000,
                                        2217000,
                                        -6.26973387460532
                                    ],
                                    "name": "Office of Workers' Compensation Programs",
                                    "id": "leaf-220",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        583000,
                                        559000,
                                        4.29338103756709
                                    ],
                                    "name": "Occupational Safety and Health Administration",
                                    "id": "leaf-212",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        578000,
                                        530000,
                                        9.0566037735849
                                    ],
                                    "name": "Bureau of Labor Statistics",
                                    "id": "leaf-205",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        567000,
                                        530000,
                                        6.98113207547171
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-207",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        384000,
                                        364000,
                                        5.4945054945055
                                    ],
                                    "name": "Mine Safety and Health Administration",
                                    "id": "leaf-211",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        241000,
                                        364000,
                                        null
                                    ],
                                    "name": "Wage and Hour Division",
                                    "id": "leaf-216",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        198000,
                                        160000,
                                        23.75
                                    ],
                                    "name": "Employee Benefits Security Administration",
                                    "id": "leaf-208",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        123000,
                                        160000,
                                        null
                                    ],
                                    "name": "Office of Workers' Compensation Programs",
                                    "id": "leaf-215",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        109000,
                                        160000,
                                        null
                                    ],
                                    "name": "Office of Federal Contract Compliance Programs",
                                    "id": "leaf-213",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        51000,
                                        160000,
                                        null
                                    ],
                                    "name": "Wage and Hour Division",
                                    "id": "leaf-221",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        41000,
                                        160000,
                                        null
                                    ],
                                    "name": "Office of Labor Management Standards",
                                    "id": "leaf-214",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                132359000,
                                null,
                                null
                            ],
                            "name": "Veterans Affairs",
                            "id": "branch-17",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        70477000,
                                        71940000,
                                        -2.03363914373089
                                    ],
                                    "name": "Benefits Programs",
                                    "id": "leaf-310",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        54438000,
                                        47966000,
                                        13.4928907976483
                                    ],
                                    "name": "Veterans Health Administration",
                                    "id": "leaf-309",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7259000,
                                        7718000,
                                        -5.94713656387665
                                    ],
                                    "name": "Departmental Administration",
                                    "id": "leaf-308",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        156000,
                                        233000,
                                        -33.0472103004292
                                    ],
                                    "name": "Benefits Programs",
                                    "id": "leaf-306",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        29000,
                                        27000,
                                        7.40740740740742
                                    ],
                                    "name": "Veterans Health Administration",
                                    "id": "leaf-312",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                129458000,
                                null,
                                null
                            ],
                            "name": "Transportation",
                            "id": "branch-16",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        70546000,
                                        67815000,
                                        4.02713264027132
                                    ],
                                    "name": "Federal Highway Administration",
                                    "id": "leaf-297",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        22201000,
                                        9772000,
                                        127.189930413426
                                    ],
                                    "name": "Federal Transit Administration",
                                    "id": "leaf-300",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        12883000,
                                        12470000,
                                        3.31194867682438
                                    ],
                                    "name": "Federal Aviation Administration",
                                    "id": "leaf-282",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8046000,
                                        15000,
                                        53540
                                    ],
                                    "name": "Federal Railroad Administration",
                                    "id": "leaf-299",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5774000,
                                        3121000,
                                        85.0048061518744
                                    ],
                                    "name": "Federal Aviation Administration",
                                    "id": "leaf-296",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5000000,
                                        3121000,
                                        null
                                    ],
                                    "name": "National Infrastructure Bank",
                                    "id": "leaf-303",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2050000,
                                        50000,
                                        4000
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-304",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        860000,
                                        696000,
                                        23.5632183908046
                                    ],
                                    "name": "National Highway Traffic Safety Administration",
                                    "id": "leaf-302",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        606000,
                                        536000,
                                        13.0597014925373
                                    ],
                                    "name": "Federal Motor Carrier Safety Administration",
                                    "id": "leaf-298",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        303000,
                                        413000,
                                        -26.634382566586
                                    ],
                                    "name": "Maritime Administration",
                                    "id": "leaf-287",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        290000,
                                        890000,
                                        -67.4157303370787
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-290",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        192000,
                                        164000,
                                        17.0731707317073
                                    ],
                                    "name": "Pipeline and Hazardous Materials Safety Administration",
                                    "id": "leaf-291",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        183000,
                                        4360000,
                                        -95.802752293578
                                    ],
                                    "name": "Federal Railroad Administration",
                                    "id": "leaf-285",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        175000,
                                        226000,
                                        -22.5663716814159
                                    ],
                                    "name": "Maritime Administration",
                                    "id": "leaf-301",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        150000,
                                        2389000,
                                        -93.7212222687317
                                    ],
                                    "name": "Federal Transit Administration",
                                    "id": "leaf-286",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        89000,
                                        77000,
                                        15.5844155844156
                                    ],
                                    "name": "Office of Inspector General",
                                    "id": "leaf-289",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        34000,
                                        32000,
                                        6.25
                                    ],
                                    "name": "Saint Lawrence Seaway Development Corporation",
                                    "id": "leaf-293",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        30000,
                                        28000,
                                        7.14285714285714
                                    ],
                                    "name": "Surface Transportation Board",
                                    "id": "leaf-294",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        28000,
                                        23000,
                                        21.7391304347826
                                    ],
                                    "name": "Pipeline and Hazardous Materials Safety Administration",
                                    "id": "leaf-305",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        18000,
                                        13000,
                                        38.4615384615385
                                    ],
                                    "name": "Research and Innovative Technology Administration",
                                    "id": "leaf-292",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                93790000,
                                null,
                                null
                            ],
                            "name": "Education",
                            "id": "branch-6",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        31433000,
                                        20085000,
                                        56.4998755290018
                                    ],
                                    "name": "Office of Federal Student Aid",
                                    "id": "leaf-95",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        20161000,
                                        22495000,
                                        -10.3756390308958
                                    ],
                                    "name": "Office of Elementary and Secondary Education",
                                    "id": "leaf-93",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        12805000,
                                        14290000,
                                        -10.3918824352694
                                    ],
                                    "name": "Office of Federal Student Aid",
                                    "id": "leaf-103",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        12647000,
                                        13225000,
                                        -4.37051039697542
                                    ],
                                    "name": "Office of Special Education and Rehabilitative Services",
                                    "id": "leaf-99",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4995000,
                                        1378000,
                                        262.481857764877
                                    ],
                                    "name": "Office of Innovation and Improvement",
                                    "id": "leaf-96",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3122000,
                                        3085000,
                                        1.19935170178282
                                    ],
                                    "name": "Office of Special Education and Rehabilitative Services",
                                    "id": "leaf-106",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2533000,
                                        2512000,
                                        0.835987261146487
                                    ],
                                    "name": "Office of Postsecondary Education",
                                    "id": "leaf-97",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1781000,
                                        393000,
                                        353.180661577608
                                    ],
                                    "name": "Office of Safe and Drug-Free Schools",
                                    "id": "leaf-98",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1683000,
                                        2016000,
                                        -16.5178571428571
                                    ],
                                    "name": "Office of Vocational and Adult Education",
                                    "id": "leaf-100",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        760000,
                                        659000,
                                        15.3262518968134
                                    ],
                                    "name": "Institute of Education Sciences",
                                    "id": "leaf-92",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        750000,
                                        750000,
                                        0
                                    ],
                                    "name": "Office of English Language Acquisition",
                                    "id": "leaf-94",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        654000,
                                        619000,
                                        5.65428109854604
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-91",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        426000,
                                        462000,
                                        -7.79220779220779
                                    ],
                                    "name": "Office of Postsecondary Education",
                                    "id": "leaf-105",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        40000,
                                        462000,
                                        null
                                    ],
                                    "name": "Office of Innovation and Improvement",
                                    "id": "leaf-104",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                83502000,
                                null,
                                null
                            ],
                            "name": "Office of Personnel Management",
                            "id": "branch-28",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        83239000,
                                        73691000,
                                        12.9568061228644
                                    ],
                                    "name": "Office of Personnel Management",
                                    "id": "leaf-403",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        263000,
                                        243000,
                                        8.23045267489713
                                    ],
                                    "name": "Office of Personnel Management",
                                    "id": "leaf-402",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                66476000,
                                null,
                                null
                            ],
                            "name": "Other",
                            "id": "branch-29",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        18724000,
                                        18725000,
                                        -0.00534045393858484
                                    ],
                                    "name": "National Aeronautics and Space Administration",
                                    "id": "leaf-443",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000000,
                                        18725000,
                                        null
                                    ],
                                    "name": "Allowances",
                                    "id": "leaf-476",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        8973000,
                                        10257000,
                                        -12.5182801988886
                                    ],
                                    "name": "Environmental Protection Agency",
                                    "id": "leaf-424",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7768000,
                                        6873000,
                                        13.0219700276444
                                    ],
                                    "name": "National Science Foundation",
                                    "id": "leaf-452",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5947000,
                                        4449000,
                                        33.6704877500562
                                    ],
                                    "name": "Postal Service",
                                    "id": "leaf-499",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1900000,
                                        4449000,
                                        null
                                    ],
                                    "name": "National Credit Union Administration",
                                    "id": "leaf-495",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1259000,
                                        1150000,
                                        9.47826086956523
                                    ],
                                    "name": "Corporation for National and Community Service",
                                    "id": "leaf-417",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1125000,
                                        672000,
                                        67.4107142857143
                                    ],
                                    "name": "Tennessee Valley Authority",
                                    "id": "leaf-505",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1048000,
                                        980000,
                                        6.93877551020408
                                    ],
                                    "name": "Smithsonian Institution",
                                    "id": "leaf-469",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        984000,
                                        1786000,
                                        -44.9048152295633
                                    ],
                                    "name": "Small Business Administration",
                                    "id": "leaf-468",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        767000,
                                        750000,
                                        2.26666666666666
                                    ],
                                    "name": "Broadcasting Board of Governors",
                                    "id": "leaf-409",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        592000,
                                        705000,
                                        -16.0283687943262
                                    ],
                                    "name": "Intelligence Community Management Account",
                                    "id": "leaf-437",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        514000,
                                        291000,
                                        76.6323024054983
                                    ],
                                    "name": "Central Intelligence Agency",
                                    "id": "leaf-480",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        451000,
                                        506000,
                                        -10.8695652173913
                                    ],
                                    "name": "Corporation for Public Broadcasting",
                                    "id": "leaf-418",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        450000,
                                        420000,
                                        7.14285714285714
                                    ],
                                    "name": "Legal Services Corporation",
                                    "id": "leaf-439",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        386000,
                                        367000,
                                        5.17711171662125
                                    ],
                                    "name": "Equal Employment Opportunity Commission",
                                    "id": "leaf-425",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        347000,
                                        370000,
                                        -6.21621621621622
                                    ],
                                    "name": "Postal Service",
                                    "id": "leaf-464",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        333000,
                                        375000,
                                        -11.2
                                    ],
                                    "name": "Federal Drug Control Programs",
                                    "id": "leaf-427",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        329000,
                                        18000,
                                        1727.77777777778
                                    ],
                                    "name": "Bureau of Consumer Financial Protection",
                                    "id": "leaf-479",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        288000,
                                        417000,
                                        -30.9352517985611
                                    ],
                                    "name": "Securities Investor Protection Corporation",
                                    "id": "leaf-501",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        288000,
                                        283000,
                                        1.76678445229681
                                    ],
                                    "name": "National Labor Relations Board",
                                    "id": "leaf-449",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        258000,
                                        249000,
                                        3.6144578313253
                                    ],
                                    "name": "Court Services and Offender Supervision Agency for the District",
                                    "id": "leaf-419",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        248000,
                                        90000,
                                        175.555555555556
                                    ],
                                    "name": "National Science Foundation",
                                    "id": "leaf-496",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        243000,
                                        282000,
                                        -13.8297872340426
                                    ],
                                    "name": "Institute of Museum and Library Services",
                                    "id": "leaf-436",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        227000,
                                        143000,
                                        58.7412587412587
                                    ],
                                    "name": "Federal Housing Finance Agency",
                                    "id": "leaf-486",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        216000,
                                        216000,
                                        0
                                    ],
                                    "name": "Affordable Housing Program",
                                    "id": "leaf-475",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        215000,
                                        233000,
                                        -7.72532188841202
                                    ],
                                    "name": "Neighborhood Reinvestment Corporation",
                                    "id": "leaf-454",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        213000,
                                        164000,
                                        29.8780487804878
                                    ],
                                    "name": "Public Company Accounting Oversight Board",
                                    "id": "leaf-500",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        197000,
                                        205000,
                                        -3.90243902439025
                                    ],
                                    "name": "Federal Trade Commission",
                                    "id": "leaf-433",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        191000,
                                        169000,
                                        13.0177514792899
                                    ],
                                    "name": "Commodity Futures Trading Commission",
                                    "id": "leaf-415",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        150000,
                                        10000,
                                        1400
                                    ],
                                    "name": "Patient-Centered Outcomes Research Trust Fund",
                                    "id": "leaf-498",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        146000,
                                        168000,
                                        -13.0952380952381
                                    ],
                                    "name": "National Endowment for the Humanities",
                                    "id": "leaf-448",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        146000,
                                        168000,
                                        -13.0952380952381
                                    ],
                                    "name": "National Endowment for the Arts",
                                    "id": "leaf-447",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        128000,
                                        139000,
                                        -7.9136690647482
                                    ],
                                    "name": "Nuclear Regulatory Commission",
                                    "id": "leaf-456",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        122000,
                                        118000,
                                        3.38983050847457
                                    ],
                                    "name": "Consumer Product Safety Commission",
                                    "id": "leaf-416",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        102000,
                                        98000,
                                        4.08163265306123
                                    ],
                                    "name": "National Transportation Safety Board",
                                    "id": "leaf-453",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        100000,
                                        100000,
                                        0
                                    ],
                                    "name": "Electric Reliability Organization",
                                    "id": "leaf-483",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        100000,
                                        100000,
                                        null
                                    ],
                                    "name": "Corporation for Travel Promotion",
                                    "id": "leaf-482",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        88000,
                                        100000,
                                        null
                                    ],
                                    "name": "Civilian Property Realignment Board",
                                    "id": "leaf-412",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        87000,
                                        81000,
                                        7.40740740740742
                                    ],
                                    "name": "International Trade Commission",
                                    "id": "leaf-438",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        76000,
                                        76000,
                                        0
                                    ],
                                    "name": "Appalachian Regional Commission",
                                    "id": "leaf-408",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        67000,
                                        67000,
                                        0
                                    ],
                                    "name": "Federal Election Commission",
                                    "id": "leaf-428",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        56000,
                                        27000,
                                        107.407407407407
                                    ],
                                    "name": "United States Court of Appeals for Veterans Claims",
                                    "id": "leaf-471",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        53000,
                                        49000,
                                        8.16326530612246
                                    ],
                                    "name": "United States Holocaust Memorial Museum",
                                    "id": "leaf-472",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        48000,
                                        47000,
                                        2.12765957446808
                                    ],
                                    "name": "Federal Mediation and Conciliation Service",
                                    "id": "leaf-431",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        43000,
                                        49000,
                                        -12.2448979591837
                                    ],
                                    "name": "United States Institute of Peace",
                                    "id": "leaf-473",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        42000,
                                        40000,
                                        5
                                    ],
                                    "name": "Merit Systems Protection Board",
                                    "id": "leaf-441",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        41000,
                                        34000,
                                        20.5882352941176
                                    ],
                                    "name": "Standard Setting Body",
                                    "id": "leaf-503",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        33000,
                                        42000,
                                        -21.4285714285714
                                    ],
                                    "name": "United Mine Workers of America Benefit Funds",
                                    "id": "leaf-507",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        29000,
                                        26000,
                                        11.5384615384615
                                    ],
                                    "name": "Defense Nuclear Facilities Safety Board",
                                    "id": "leaf-420",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        26000,
                                        24000,
                                        8.33333333333333
                                    ],
                                    "name": "Federal Maritime Commission",
                                    "id": "leaf-430",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        26000,
                                        25000,
                                        4
                                    ],
                                    "name": "Federal Labor Relations Authority",
                                    "id": "leaf-429",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        22000,
                                        19000,
                                        15.7894736842105
                                    ],
                                    "name": "National Railroad Passenger Corporation Office of Inspector Gene",
                                    "id": "leaf-451",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        22000,
                                        14000,
                                        57.1428571428571
                                    ],
                                    "name": "Federal Mine Safety and Health Review Commission",
                                    "id": "leaf-432",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        20000,
                                        14000,
                                        42.8571428571429
                                    ],
                                    "name": "Corporation for National and Community Service",
                                    "id": "leaf-481",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        19000,
                                        18000,
                                        5.55555555555556
                                    ],
                                    "name": "Office of Special Counsel",
                                    "id": "leaf-461",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        16000,
                                        19000,
                                        -15.7894736842105
                                    ],
                                    "name": "Denali Commission",
                                    "id": "leaf-422",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        14000,
                                        13000,
                                        7.69230769230769
                                    ],
                                    "name": "National Mediation Board",
                                    "id": "leaf-450",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        14000,
                                        14000,
                                        0
                                    ],
                                    "name": "Office of Government Ethics",
                                    "id": "leaf-459",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        13000,
                                        0
                                    ],
                                    "name": "Delta Regional Authority",
                                    "id": "leaf-421",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        12000,
                                        8.33333333333333
                                    ],
                                    "name": "Occupational Safety and Health Review Commission",
                                    "id": "leaf-458",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        12000,
                                        23000,
                                        -47.8260869565217
                                    ],
                                    "name": "Presidio Trust",
                                    "id": "leaf-465",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        11000,
                                        89000,
                                        -87.6404494382023
                                    ],
                                    "name": "Election Assistance Commission",
                                    "id": "leaf-423",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        11000,
                                        11000,
                                        0
                                    ],
                                    "name": "Chemical Safety and Hazard Investigation Board",
                                    "id": "leaf-410",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000,
                                        8000,
                                        25
                                    ],
                                    "name": "Office of Navajo and Hopi Indian Relocation",
                                    "id": "leaf-460",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        8000,
                                        12.5
                                    ],
                                    "name": "Institute of American Indian and Alaska Native Culture and Arts",
                                    "id": "leaf-435",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        9000,
                                        0
                                    ],
                                    "name": "Commission on Civil Rights",
                                    "id": "leaf-414",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8000,
                                        9000,
                                        -11.1111111111111
                                    ],
                                    "name": "National Capital Planning Commission",
                                    "id": "leaf-444",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6000,
                                        6000,
                                        0
                                    ],
                                    "name": "Advisory Council on Historic Preservation",
                                    "id": "leaf-406",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6000,
                                        7000,
                                        -14.2857142857143
                                    ],
                                    "name": "Morris K. Udall and Stewart L. Udall Foundation",
                                    "id": "leaf-442",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5000,
                                        5000,
                                        0
                                    ],
                                    "name": "State Justice Institute",
                                    "id": "leaf-470",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4000,
                                        2000,
                                        100
                                    ],
                                    "name": "United States Interagency Council on Homelessness",
                                    "id": "leaf-474",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4000,
                                        4000,
                                        0
                                    ],
                                    "name": "Barry Goldwater Scholarship and Excellence in Education Foundati",
                                    "id": "leaf-477",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        4000,
                                        4000,
                                        0
                                    ],
                                    "name": "Office of the Fed Coordinator for Alaska Natural Gas Transportat",
                                    "id": "leaf-462",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        2000,
                                        50
                                    ],
                                    "name": "Japan-United States Friendship Commission",
                                    "id": "leaf-491",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3000,
                                        1000,
                                        200
                                    ],
                                    "name": "Harry S Truman Scholarship Foundation",
                                    "id": "leaf-489",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3000,
                                        3000,
                                        0
                                    ],
                                    "name": "National Council on Disability",
                                    "id": "leaf-445",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        3000,
                                        0
                                    ],
                                    "name": "Marine Mammal Commission",
                                    "id": "leaf-440",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        4000,
                                        -25
                                    ],
                                    "name": "Nuclear Waste Technical Review Board",
                                    "id": "leaf-457",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        2000,
                                        50
                                    ],
                                    "name": "Administrative Conference of the United States",
                                    "id": "leaf-405",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "Northern Border Regional Commission",
                                    "id": "leaf-455",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "James Madison Memorial Fellowship Foundation",
                                    "id": "leaf-490",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2000,
                                        1000,
                                        100
                                    ],
                                    "name": "National Credit Union Administration",
                                    "id": "leaf-446",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        1000,
                                        null
                                    ],
                                    "name": "Privacy and Civil Liberties Oversight Board",
                                    "id": "leaf-466",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        12000,
                                        -83.3333333333333
                                    ],
                                    "name": "Commission of Fine Arts",
                                    "id": "leaf-413",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        1000,
                                        100
                                    ],
                                    "name": "United States Court of Appeals for Veterans Claims",
                                    "id": "leaf-508",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        null
                                    ],
                                    "name": "Morris K. Udall and Stewart L. Udall Foundation",
                                    "id": "leaf-493",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Christopher Columbus Fellowship Foundation",
                                    "id": "leaf-411",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        null
                                    ],
                                    "name": "Public Company Accounting Oversight Board",
                                    "id": "leaf-467",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Other Commissions and Boards",
                                    "id": "leaf-463",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                58663000,
                                null,
                                null
                            ],
                            "name": "Other Defense Civil Programs",
                            "id": "branch-30",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        48455000,
                                        51097000,
                                        -5.17055795839286
                                    ],
                                    "name": "Military Retirement",
                                    "id": "leaf-520",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        9917000,
                                        8623000,
                                        15.0063782906181
                                    ],
                                    "name": "Retiree Health Care",
                                    "id": "leaf-521",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        77000,
                                        83000,
                                        -7.2289156626506
                                    ],
                                    "name": "American Battle Monuments Commission",
                                    "id": "leaf-513",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        76000,
                                        83000,
                                        null
                                    ],
                                    "name": "Educational Benefits",
                                    "id": "leaf-519",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        68000,
                                        134000,
                                        -49.2537313432836
                                    ],
                                    "name": "Armed Forces Retirement Home",
                                    "id": "leaf-514",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        46000,
                                        40000,
                                        15
                                    ],
                                    "name": "Cemeterial Expenses",
                                    "id": "leaf-515",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        24000,
                                        24000,
                                        0
                                    ],
                                    "name": "Selective Service System",
                                    "id": "leaf-516",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                52092000,
                                null,
                                null
                            ],
                            "name": "Housing and Urban Development",
                            "id": "branch-10",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        36186000,
                                        34796000,
                                        3.99471203586619
                                    ],
                                    "name": "Public and Indian Housing Programs",
                                    "id": "leaf-178",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8211000,
                                        8601000,
                                        -4.53435647017789
                                    ],
                                    "name": "Community Planning and Development",
                                    "id": "leaf-169",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4484000,
                                        3025000,
                                        48.2314049586777
                                    ],
                                    "name": "Housing Programs",
                                    "id": "leaf-182",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1791000,
                                        2000000,
                                        -10.45
                                    ],
                                    "name": "Management and Administration",
                                    "id": "leaf-174",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1001000,
                                        4000,
                                        24925
                                    ],
                                    "name": "Community Planning and Development",
                                    "id": "leaf-179",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        150000,
                                        4000,
                                        null
                                    ],
                                    "name": "Office of Sustainable Housing and Communities",
                                    "id": "leaf-176",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        140000,
                                        139000,
                                        0.71942446043165
                                    ],
                                    "name": "Office of Lead Hazard Control and Healthy Homes",
                                    "id": "leaf-175",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        72000,
                                        71000,
                                        1.40845070422535
                                    ],
                                    "name": "Fair Housing and Equal Opportunity",
                                    "id": "leaf-171",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        57000,
                                        48000,
                                        18.75
                                    ],
                                    "name": "Policy Development and Research",
                                    "id": "leaf-177",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                50045000,
                                null,
                                null
                            ],
                            "name": "Homeland Security",
                            "id": "branch-9",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        10493000,
                                        10323000,
                                        1.64680809842099
                                    ],
                                    "name": "Customs and Border Protection",
                                    "id": "leaf-147",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8935000,
                                        8894000,
                                        0.460984933663133
                                    ],
                                    "name": "United States Coast Guard",
                                    "id": "leaf-158",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6790000,
                                        12211000,
                                        -44.3943984931619
                                    ],
                                    "name": "Federal Emergency Management Agency",
                                    "id": "leaf-151",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5495000,
                                        5520000,
                                        -0.452898550724634
                                    ],
                                    "name": "Immigration and Customs Enforcement",
                                    "id": "leaf-153",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5114000,
                                        5515000,
                                        -7.27107887579329
                                    ],
                                    "name": "Transportation Security Administration",
                                    "id": "leaf-157",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2534000,
                                        2410000,
                                        5.14522821576764
                                    ],
                                    "name": "Citizenship and Immigration Services",
                                    "id": "leaf-160",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1699000,
                                        1490000,
                                        14.0268456375839
                                    ],
                                    "name": "United States Secret Service",
                                    "id": "leaf-159",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1662000,
                                        2233000,
                                        -25.5709807433945
                                    ],
                                    "name": "United States Coast Guard",
                                    "id": "leaf-166",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1471000,
                                        1295000,
                                        13.5907335907336
                                    ],
                                    "name": "Customs and Border Protection",
                                    "id": "leaf-161",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1428000,
                                        1295000,
                                        null
                                    ],
                                    "name": "National Protection and Programs Directorate",
                                    "id": "leaf-154",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1302000,
                                        1133000,
                                        14.9161518093557
                                    ],
                                    "name": "Departmental Management and Operations",
                                    "id": "leaf-149",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1177000,
                                        999000,
                                        17.8178178178178
                                    ],
                                    "name": "Science and Technology",
                                    "id": "leaf-156",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        365000,
                                        246000,
                                        48.3739837398374
                                    ],
                                    "name": "Citizenship and Immigration Services",
                                    "id": "leaf-146",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        331000,
                                        376000,
                                        -11.968085106383
                                    ],
                                    "name": "Domestic Nuclear Detection Office",
                                    "id": "leaf-150",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        311000,
                                        275000,
                                        13.0909090909091
                                    ],
                                    "name": "Immigration and Customs Enforcement",
                                    "id": "leaf-164",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        276000,
                                        290000,
                                        -4.82758620689655
                                    ],
                                    "name": "Federal Law Enforcement Training Center",
                                    "id": "leaf-152",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        250000,
                                        250000,
                                        0
                                    ],
                                    "name": "Transportation Security Administration",
                                    "id": "leaf-165",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        245000,
                                        244000,
                                        0.409836065573765
                                    ],
                                    "name": "United States Secret Service",
                                    "id": "leaf-167",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        144000,
                                        135000,
                                        6.66666666666667
                                    ],
                                    "name": "Office of the Inspector General",
                                    "id": "leaf-155",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        23000,
                                        135000,
                                        null
                                    ],
                                    "name": "Federal Emergency Management Agency",
                                    "id": "leaf-163",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                41915000,
                                null,
                                null
                            ],
                            "name": "International Assistance Programs",
                            "id": "branch-24",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        15965000,
                                        14252000,
                                        12.0193657030592
                                    ],
                                    "name": "International Security Assistance",
                                    "id": "leaf-353",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        14257000,
                                        3257000,
                                        337.734111145226
                                    ],
                                    "name": "Military Sales Program",
                                    "id": "leaf-362",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        6246000,
                                        6127000,
                                        1.94222294760895
                                    ],
                                    "name": "Agency for International Development",
                                    "id": "leaf-350",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3713000,
                                        3115000,
                                        19.1974317817014
                                    ],
                                    "name": "Multilateral Assistance",
                                    "id": "leaf-355",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1125000,
                                        1055000,
                                        6.6350710900474
                                    ],
                                    "name": "Millennium Challenge Corporation",
                                    "id": "leaf-354",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        440000,
                                        400000,
                                        10
                                    ],
                                    "name": "Peace Corps",
                                    "id": "leaf-357",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        70000,
                                        20000,
                                        250
                                    ],
                                    "name": "Overseas Private Investment Corporation",
                                    "id": "leaf-363",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        56000,
                                        55000,
                                        1.81818181818181
                                    ],
                                    "name": "Trade and Development Agency",
                                    "id": "leaf-358",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        24000,
                                        30000,
                                        -20
                                    ],
                                    "name": "African Development Foundation",
                                    "id": "leaf-349",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        19000,
                                        23000,
                                        -17.3913043478261
                                    ],
                                    "name": "Inter-American Foundation",
                                    "id": "leaf-351",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                35403000,
                                null,
                                null
                            ],
                            "name": "Justice",
                            "id": "branch-11",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        8076000,
                                        7874000,
                                        2.56540513081027
                                    ],
                                    "name": "Federal Bureau of Investigation",
                                    "id": "leaf-188",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7808000,
                                        774000,
                                        908.785529715762
                                    ],
                                    "name": "Office of Justice Programs",
                                    "id": "leaf-202",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        6791000,
                                        6205000,
                                        9.44399677679291
                                    ],
                                    "name": "Federal Prison System",
                                    "id": "leaf-189",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3909000,
                                        4358000,
                                        -10.3028912345112
                                    ],
                                    "name": "Legal Activities and U.S. Marshals",
                                    "id": "leaf-192",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2323000,
                                        1646000,
                                        41.1300121506683
                                    ],
                                    "name": "Legal Activities and U.S. Marshals",
                                    "id": "leaf-201",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2293000,
                                        2312000,
                                        -0.821799307958482
                                    ],
                                    "name": "General Administration",
                                    "id": "leaf-190",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2012000,
                                        2084000,
                                        -3.45489443378119
                                    ],
                                    "name": "Drug Enforcement Administration",
                                    "id": "leaf-187",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1147000,
                                        1158000,
                                        -0.949913644214162
                                    ],
                                    "name": "Bureau of Alcohol, Tobacco, Firearms, and Explosives",
                                    "id": "leaf-185",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        541000,
                                        548000,
                                        -1.27737226277372
                                    ],
                                    "name": "Interagency Law Enforcement",
                                    "id": "leaf-191",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        282000,
                                        272000,
                                        3.6764705882353
                                    ],
                                    "name": "Drug Enforcement Administration",
                                    "id": "leaf-198",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        120000,
                                        120000,
                                        0
                                    ],
                                    "name": "Radiation Exposure Compensation",
                                    "id": "leaf-203",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        88000,
                                        88000,
                                        0
                                    ],
                                    "name": "National Security Division",
                                    "id": "leaf-193",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        13000,
                                        0
                                    ],
                                    "name": "United States Parole Commission",
                                    "id": "leaf-195",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                32746000,
                                null,
                                null
                            ],
                            "name": "State",
                            "id": "branch-13",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        14747000,
                                        12367000,
                                        19.2447642920676
                                    ],
                                    "name": "Administration of Foreign Affairs",
                                    "id": "leaf-223",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13080000,
                                        12954000,
                                        0.972672533580354
                                    ],
                                    "name": "Other",
                                    "id": "leaf-227",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3539000,
                                        3905000,
                                        -9.37259923175416
                                    ],
                                    "name": "International Organizations and Conferences",
                                    "id": "leaf-226",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1257000,
                                        1266000,
                                        -0.710900473933651
                                    ],
                                    "name": "Administration of Foreign Affairs",
                                    "id": "leaf-228",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        122000,
                                        143000,
                                        -14.6853146853147
                                    ],
                                    "name": "International Commissions",
                                    "id": "leaf-225",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        4000,
                                        -75
                                    ],
                                    "name": "Other",
                                    "id": "leaf-230",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                30779000,
                                null,
                                null
                            ],
                            "name": "Energy",
                            "id": "branch-7",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        11836000,
                                        8610000,
                                        37.4680603948897
                                    ],
                                    "name": "Energy Programs",
                                    "id": "leaf-110",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        11712000,
                                        9881000,
                                        18.5305131059609
                                    ],
                                    "name": "National Nuclear Security Administration",
                                    "id": "leaf-112",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6267000,
                                        6585000,
                                        -4.82915717539863
                                    ],
                                    "name": "Environmental and Other Defense Activities",
                                    "id": "leaf-111",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        604000,
                                        785000,
                                        -23.0573248407643
                                    ],
                                    "name": "Power Marketing Administration",
                                    "id": "leaf-116",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        171000,
                                        256000,
                                        -33.203125
                                    ],
                                    "name": "Departmental Administration",
                                    "id": "leaf-109",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        103000,
                                        62000,
                                        66.1290322580645
                                    ],
                                    "name": "Energy Programs",
                                    "id": "leaf-115",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        86000,
                                        150000,
                                        -42.6666666666667
                                    ],
                                    "name": "Power Marketing Administration",
                                    "id": "leaf-113",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                17863000,
                                null,
                                null
                            ],
                            "name": "Interior",
                            "id": "branch-14",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        2892000,
                                        2770000,
                                        4.40433212996389
                                    ],
                                    "name": "National Park Service",
                                    "id": "leaf-241",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2501000,
                                        2612000,
                                        -4.24961715160797
                                    ],
                                    "name": "Bureau of Indian Affairs and Bureau of Indian Education",
                                    "id": "leaf-232",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2117000,
                                        1775000,
                                        19.2676056338028
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-254",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1695000,
                                        1648000,
                                        2.85194174757282
                                    ],
                                    "name": "United States Fish and Wildlife Service",
                                    "id": "leaf-246",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1132000,
                                        1156000,
                                        -2.07612456747405
                                    ],
                                    "name": "Bureau of Land Management",
                                    "id": "leaf-233",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1118000,
                                        1112000,
                                        0.539568345323738
                                    ],
                                    "name": "United States Geological Survey",
                                    "id": "leaf-247",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1018000,
                                        1098000,
                                        -7.28597449908925
                                    ],
                                    "name": "Bureau of Reclamation",
                                    "id": "leaf-235",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        996000,
                                        1362000,
                                        -26.8722466960352
                                    ],
                                    "name": "United States Fish and Wildlife Service",
                                    "id": "leaf-260",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        911000,
                                        960000,
                                        -5.10416666666667
                                    ],
                                    "name": "Department-Wide Programs",
                                    "id": "leaf-238",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        538000,
                                        542000,
                                        -0.738007380073802
                                    ],
                                    "name": "Office of Surface Mining Reclamation and Enforcement",
                                    "id": "leaf-258",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        437000,
                                        626000,
                                        -30.1916932907348
                                    ],
                                    "name": "Department-Wide Programs",
                                    "id": "leaf-253",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        405000,
                                        429000,
                                        -5.59440559440559
                                    ],
                                    "name": "Insular Affairs",
                                    "id": "leaf-255",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        395000,
                                        393000,
                                        0.508905852417296
                                    ],
                                    "name": "National Park Service",
                                    "id": "leaf-257",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        358000,
                                        482000,
                                        -25.7261410788382
                                    ],
                                    "name": "Office of the Special Trustee for American Indians",
                                    "id": "leaf-259",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        242000,
                                        138000,
                                        75.3623188405797
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-239",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        194000,
                                        104000,
                                        86.5384615384615
                                    ],
                                    "name": "Bureau of Reclamation",
                                    "id": "leaf-251",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        152000,
                                        177000,
                                        -14.1242937853107
                                    ],
                                    "name": "Office of the Special Trustee for American Indians",
                                    "id": "leaf-245",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        146000,
                                        163000,
                                        -10.4294478527607
                                    ],
                                    "name": "Office of Surface Mining Reclamation and Enforcement",
                                    "id": "leaf-243",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        133000,
                                        208000,
                                        -36.0576923076923
                                    ],
                                    "name": "Bureau of Land Management",
                                    "id": "leaf-249",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        132000,
                                        191000,
                                        -30.8900523560209
                                    ],
                                    "name": "Bureau of Ocean Energy Management, Regulation and Enforcement",
                                    "id": "leaf-234",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        106000,
                                        121000,
                                        -12.396694214876
                                    ],
                                    "name": "Bureau of Indian Affairs and Bureau of Indian Education",
                                    "id": "leaf-248",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        69000,
                                        60000,
                                        15
                                    ],
                                    "name": "Insular Affairs",
                                    "id": "leaf-240",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        68000,
                                        65000,
                                        4.61538461538462
                                    ],
                                    "name": "Office of the Solicitor",
                                    "id": "leaf-244",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        49000,
                                        49000,
                                        0
                                    ],
                                    "name": "Office of Inspector General",
                                    "id": "leaf-242",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        33000,
                                        52000,
                                        -36.5384615384615
                                    ],
                                    "name": "Central Utah Project",
                                    "id": "leaf-236",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        17000,
                                        13000,
                                        30.7692307692308
                                    ],
                                    "name": "National Indian Gaming Commission",
                                    "id": "leaf-256",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        8000,
                                        21000,
                                        -61.9047619047619
                                    ],
                                    "name": "Bureau of Ocean Energy Management, Regulation and Enforcement",
                                    "id": "leaf-250",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        2000,
                                        -50
                                    ],
                                    "name": "United States Geological Survey",
                                    "id": "leaf-261",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                11570000,
                                null,
                                null
                            ],
                            "name": "Federal Communications Commission",
                            "id": "branch-20",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        11570000,
                                        8918000,
                                        29.7376093294461
                                    ],
                                    "name": "Federal Communications Commission",
                                    "id": "leaf-334",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                10449000,
                                null,
                                null
                            ],
                            "name": "Commerce",
                            "id": "branch-4",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        5510000,
                                        4878000,
                                        12.9561295612956
                                    ],
                                    "name": "National Oceanic and Atmospheric Administration",
                                    "id": "leaf-61",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1400000,
                                        197000,
                                        610.659898477157
                                    ],
                                    "name": "National Telecommunications and Information Administration",
                                    "id": "leaf-71",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1025000,
                                        7096000,
                                        -85.5552423900789
                                    ],
                                    "name": "Bureau of the Census",
                                    "id": "leaf-53",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1004000,
                                        863000,
                                        16.3383545770568
                                    ],
                                    "name": "National Institute of Standards and Technology",
                                    "id": "leaf-60",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        517000,
                                        448000,
                                        15.4017857142857
                                    ],
                                    "name": "International Trade Administration",
                                    "id": "leaf-58",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        325000,
                                        347000,
                                        -6.34005763688761
                                    ],
                                    "name": "Economic Development Administration",
                                    "id": "leaf-57",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        113000,
                                        97000,
                                        16.4948453608248
                                    ],
                                    "name": "Economic and Statistical Analysis",
                                    "id": "leaf-56",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        111000,
                                        58000,
                                        91.3793103448276
                                    ],
                                    "name": "National Oceanic and Atmospheric Administration",
                                    "id": "leaf-70",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        111000,
                                        100000,
                                        11
                                    ],
                                    "name": "Bureau of Industry and Security",
                                    "id": "leaf-52",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        100000,
                                        100000,
                                        null
                                    ],
                                    "name": "National Institute of Standards and Technology",
                                    "id": "leaf-69",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        95000,
                                        109000,
                                        -12.8440366972477
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-55",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        50000,
                                        109000,
                                        null
                                    ],
                                    "name": "National Telecommunications and Information Administration",
                                    "id": "leaf-62",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        32000,
                                        32000,
                                        0
                                    ],
                                    "name": "Minority Business Development Agency",
                                    "id": "leaf-59",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        30000,
                                        30000,
                                        0
                                    ],
                                    "name": "Bureau of the Census",
                                    "id": "leaf-64",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        20000,
                                        30000,
                                        null
                                    ],
                                    "name": "Economic Development Administration",
                                    "id": "leaf-67",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5000,
                                        5000,
                                        0
                                    ],
                                    "name": "International Trade Administration",
                                    "id": "leaf-68",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-66",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                8284000,
                                null,
                                null
                            ],
                            "name": "Judicial Branch",
                            "id": "branch-25",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        6580000,
                                        6175000,
                                        6.55870445344129
                                    ],
                                    "name": "Courts of Appeals, District Courts, and other Judicial Services",
                                    "id": "leaf-366",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1177000,
                                        1141000,
                                        3.15512708150745
                                    ],
                                    "name": "Courts of Appeals, District Courts, and other Judicial Services",
                                    "id": "leaf-372",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        248000,
                                        197000,
                                        25.8883248730964
                                    ],
                                    "name": "Judicial Retirement Funds",
                                    "id": "leaf-374",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        89000,
                                        83000,
                                        7.2289156626506
                                    ],
                                    "name": "Administrative Office of the United States Courts",
                                    "id": "leaf-365",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        83000,
                                        87000,
                                        -4.59770114942529
                                    ],
                                    "name": "Supreme Court of the United States",
                                    "id": "leaf-368",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        33000,
                                        29000,
                                        13.7931034482759
                                    ],
                                    "name": "United States Court of Appeals for the Federal Circuit",
                                    "id": "leaf-369",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        29000,
                                        27000,
                                        7.40740740740742
                                    ],
                                    "name": "Federal Judicial Center",
                                    "id": "leaf-367",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        21000,
                                        19000,
                                        10.5263157894737
                                    ],
                                    "name": "United States Court of International Trade",
                                    "id": "leaf-370",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        18000,
                                        17000,
                                        5.88235294117647
                                    ],
                                    "name": "United States Sentencing Commission",
                                    "id": "leaf-371",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "United States Court of Appeals for the Federal Circuit",
                                    "id": "leaf-376",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "Supreme Court of the United States",
                                    "id": "leaf-375",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "United States Court of International Trade",
                                    "id": "leaf-377",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                7115000,
                                null,
                                null
                            ],
                            "name": "Railroad Retirement Board",
                            "id": "branch-31",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        6945000,
                                        6864000,
                                        1.18006993006994
                                    ],
                                    "name": "Railroad Retirement Board",
                                    "id": "leaf-524",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        170000,
                                        181000,
                                        -6.07734806629834
                                    ],
                                    "name": "Railroad Retirement Board",
                                    "id": "leaf-523",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                5173000,
                                null,
                                null
                            ],
                            "name": "Legislative Branch",
                            "id": "branch-26",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        1334000,
                                        1369000,
                                        -2.55661066471877
                                    ],
                                    "name": "House of Representatives",
                                    "id": "leaf-384",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        971000,
                                        918000,
                                        5.77342047930283
                                    ],
                                    "name": "Senate",
                                    "id": "leaf-389",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        694000,
                                        590000,
                                        17.6271186440678
                                    ],
                                    "name": "Architect of the Capitol",
                                    "id": "leaf-378",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        667000,
                                        642000,
                                        3.89408099688473
                                    ],
                                    "name": "Library of Congress",
                                    "id": "leaf-387",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        557000,
                                        558000,
                                        -0.179211469534046
                                    ],
                                    "name": "Government Accountability Office",
                                    "id": "leaf-382",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        387000,
                                        342000,
                                        13.1578947368421
                                    ],
                                    "name": "Capitol Police",
                                    "id": "leaf-380",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        148000,
                                        148000,
                                        0
                                    ],
                                    "name": "Government Printing Office",
                                    "id": "leaf-383",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        130000,
                                        57000,
                                        128.070175438596
                                    ],
                                    "name": "Legislative Branch Boards and Commissions",
                                    "id": "leaf-386",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        101000,
                                        110000,
                                        -8.18181818181818
                                    ],
                                    "name": "House of Representatives",
                                    "id": "leaf-392",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        60000,
                                        49000,
                                        22.4489795918367
                                    ],
                                    "name": "United States Tax Court",
                                    "id": "leaf-390",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        47000,
                                        45000,
                                        4.44444444444445
                                    ],
                                    "name": "Congressional Budget Office",
                                    "id": "leaf-381",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        33000,
                                        33000,
                                        0
                                    ],
                                    "name": "Senate",
                                    "id": "leaf-396",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        20000,
                                        21000,
                                        -4.76190476190477
                                    ],
                                    "name": "Joint Items",
                                    "id": "leaf-385",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        12000,
                                        11000,
                                        9.09090909090908
                                    ],
                                    "name": "Botanic Garden",
                                    "id": "leaf-379",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6000,
                                        9000,
                                        -33.3333333333333
                                    ],
                                    "name": "Library of Congress",
                                    "id": "leaf-395",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5000,
                                        4000,
                                        25
                                    ],
                                    "name": "Office of Compliance",
                                    "id": "leaf-388",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        4000,
                                        null
                                    ],
                                    "name": "United States Tax Court",
                                    "id": "leaf-397",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                4584000,
                                null,
                                null
                            ],
                            "name": "Corps of Engineers--Civil Works",
                            "id": "branch-2",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        4574000,
                                        5739000,
                                        -20.2997037811465
                                    ],
                                    "name": "Corps of Engineers--Civil Works",
                                    "id": "leaf-3",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000,
                                        5739000,
                                        null
                                    ],
                                    "name": "Corps of Engineers--Civil Works",
                                    "id": "leaf-4",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                1070000,
                                null,
                                null
                            ],
                            "name": "District of Columbia",
                            "id": "branch-18",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        603000,
                                        523000,
                                        15.2963671128107
                                    ],
                                    "name": "District of Columbia General and Special Payments",
                                    "id": "leaf-317",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        284000,
                                        316000,
                                        -10.126582278481
                                    ],
                                    "name": "District of Columbia Courts",
                                    "id": "leaf-314",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        174000,
                                        186000,
                                        -6.45161290322581
                                    ],
                                    "name": "District of Columbia General and Special Payments",
                                    "id": "leaf-315",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        8000,
                                        12.5
                                    ],
                                    "name": "District of Columbia Courts",
                                    "id": "leaf-316",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                915000,
                                null,
                                null
                            ],
                            "name": "Federal Deposit Insurance Corporation",
                            "id": "branch-21",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        855000,
                                        null,
                                        null
                                    ],
                                    "name": "Orderly Liquidation",
                                    "id": "leaf-340",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        45000,
                                        33000,
                                        36.3636363636364
                                    ],
                                    "name": "FDIC_Office of Inspector General",
                                    "id": "leaf-337",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        15000,
                                        27000,
                                        -44.4444444444444
                                    ],
                                    "name": "FSLIC Resolution",
                                    "id": "leaf-339",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                653000,
                                null,
                                null
                            ],
                            "name": "General Services Administration",
                            "id": "branch-23",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        332000,
                                        267000,
                                        24.3445692883895
                                    ],
                                    "name": "General Activities",
                                    "id": "leaf-342",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        286000,
                                        10000,
                                        2760
                                    ],
                                    "name": "Real Property Activities",
                                    "id": "leaf-344",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        13000,
                                        0
                                    ],
                                    "name": "Supply and Technology Activities",
                                    "id": "leaf-348",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        12000,
                                        11000,
                                        9.09090909090908
                                    ],
                                    "name": "General Activities",
                                    "id": "leaf-345",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        10000,
                                        3000,
                                        233.333333333333
                                    ],
                                    "name": "Real Property Activities",
                                    "id": "leaf-347",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                569000,
                                null,
                                null
                            ],
                            "name": "Executive Office of the President",
                            "id": "branch-19",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        116000,
                                        115000,
                                        0.869565217391299
                                    ],
                                    "name": "Office of Administration",
                                    "id": "leaf-323",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        100000,
                                        115000,
                                        null
                                    ],
                                    "name": "Unanticipated Needs",
                                    "id": "leaf-332",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        92000,
                                        93000,
                                        -1.0752688172043
                                    ],
                                    "name": "Office of Management and Budget",
                                    "id": "leaf-324",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        81000,
                                        39000,
                                        107.692307692308
                                    ],
                                    "name": "Unanticipated Needs",
                                    "id": "leaf-330",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        59000,
                                        60000,
                                        -1.66666666666667
                                    ],
                                    "name": "The White House",
                                    "id": "leaf-329",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        51000,
                                        48000,
                                        6.25
                                    ],
                                    "name": "Office of the United States Trade Representative",
                                    "id": "leaf-327",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        23000,
                                        30000,
                                        -23.3333333333333
                                    ],
                                    "name": "Office of National Drug Control Policy",
                                    "id": "leaf-325",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        15000,
                                        17000,
                                        -11.7647058823529
                                    ],
                                    "name": "Executive Residence at the White House",
                                    "id": "leaf-321",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        12000,
                                        8.33333333333333
                                    ],
                                    "name": "National Security Council and Homeland Security Council",
                                    "id": "leaf-322",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7000,
                                        7000,
                                        0
                                    ],
                                    "name": "Office of Science and Technology Policy",
                                    "id": "leaf-326",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5000,
                                        5000,
                                        0
                                    ],
                                    "name": "Special Assistance to the President and the Official Residence",
                                    "id": "leaf-328",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4000,
                                        4000,
                                        0
                                    ],
                                    "name": "Council of Economic Advisers",
                                    "id": "leaf-319",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        3000,
                                        0
                                    ],
                                    "name": "Council on Environmental Quality and Office of Environmental Qua",
                                    "id": "leaf-320",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                407000,
                                null,
                                null
                            ],
                            "name": "National Archives and Records Administration",
                            "id": "branch-27",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        407000,
                                        458000,
                                        -11.1353711790393
                                    ],
                                    "name": "National Archives and Records Administration",
                                    "id": "leaf-399",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                32000,
                                null,
                                null
                            ],
                            "name": "Recovery Accountability and Transparency Board",
                            "id": "branch-32",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        32000,
                                        null,
                                        null
                                    ],
                                    "name": "Recovery Act Accountability and Transparency Board",
                                    "id": "leaf-526",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                7000,
                                null,
                                null
                            ],
                            "name": "Access Board",
                            "id": "branch-0",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        7000,
                                        7000,
                                        0
                                    ],
                                    "name": "Architectural and Transportation Barriers Compliance Board",
                                    "id": "leaf-1",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                6000,
                                null,
                                null
                            ],
                            "name": "Committee for Purchase from People Who Are Blind or Severely Dis",
                            "id": "branch-1",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        6000,
                                        5000,
                                        20
                                    ],
                                    "name": "Committee for Purchase from People who are Blind or Severely Dis",
                                    "id": "leaf-2",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                2000,
                                null,
                                null
                            ],
                            "name": "Federal Financial Institutions Examination Council",
                            "id": "branch-22",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        2000,
                                        3000,
                                        -33.3333333333333
                                    ],
                                    "name": "Federal Financial Institutions Examination Council Appraisal Sub",
                                    "id": "leaf-341",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                0,
                                null,
                                null
                            ],
                            "name": "Securities and Exchange Commission",
                            "id": "branch-33",
                            "discretion": null
                        }
                    ];
                    market.hideLoading();

                    var formatUtil;

                    function buildData(mode, originList) {
                        var out = [];

                        for (var i = 0; i < originList.length; i++) {
                            var node = originList[i];
                            var newNode = out[i] = cloneNodeInfo(node);
                            var value = newNode.value;

                            if (!newNode) {
                                continue;
                            }

                            // Calculate amount per household.
                            value[3] = value[0] / household_america_2012;

                            // if mode === 0 and mode === 2 do nothing
                            if (mode === 1) {
                                // Set 'Change from 2010' to value[0].
                                var tmp = value[1];
                                value[1] = value[0];
                                value[0] = tmp;
                            }

                            if (node.children) {
                                newNode.children = buildData(mode, node.children);
                            }
                        }

                        return out;
                    }

                    function cloneNodeInfo(node) {
                        if (!node) {
                            return;
                        }

                        var newNode = {};
                        newNode.name = node.name;
                        newNode.id = node.id;
                        newNode.discretion = node.discretion;
                        newNode.value = (node.value || []).slice();
                        return newNode;
                    }

                    function getLevelOption(mode) {
                        return [
                            {
                                color: mode === 2
                                    ? [
                                        '#c23531', '#314656', '#61a0a8', '#dd8668',
                                        '#91c7ae', '#6e7074', '#61a0a8', '#bda29a',
                                        '#44525d', '#c4ccd3'
                                    ]
                                    : null,
                                colorMappingBy: 'id',
                                itemStyle: {
                                    normal: {
                                        borderWidth: 3,
                                        gapWidth: 3
                                    }
                                }
                            },
                            {
                                colorAlpha: mode === 2
                                    ? [0.5, 1] : null,
                                itemStyle: {
                                    normal: {
                                        gapWidth: 1
                                    }
                                }
                            }
                        ];
                    }

                    function isValidNumber(num) {
                        return num != null && isFinite(num);
                    }

                    function getTooltipFormatter(mode) {
                        var amountIndex = mode === 1 ? 1 : 0;
                        var amountIndex2011 = mode === 1 ? 0 : 1;

                        return function (info) {
                            var value = info.value;

                            var amount = value[amountIndex];
                            amount = isValidNumber(amount)
                                ? formatUtil.addCommas(amount * 1000) + '$'
                                : '-';

                            var amount2011 = value[amountIndex2011];
                            amount2011 = isValidNumber(amount2011)
                                ? formatUtil.addCommas(amount2011 * 1000) + '$'
                                : '-';

                            var perHousehold = value[3];
                            perHousehold = isValidNumber(perHousehold)
                                ? formatUtil.addCommas((+perHousehold.toFixed(4)) * 1000) + '$'
                                : '-';

                            var change = value[2];
                            change = isValidNumber(change)
                                ? change.toFixed(2) + '%'
                                : '-';

                            return [
                                '<div class="tooltip-title">' + formatUtil.encodeHTML(info.name) + '</div>',
                                '2012 Amount: &nbsp;&nbsp;' + amount + '<br>',
                                'Per Household: &nbsp;&nbsp;' + perHousehold + '<br>',
                                '2011 Amount: &nbsp;&nbsp;' + amount2011 + '<br>',
                                'Change From 2011: &nbsp;&nbsp;' + change
                            ].join('');
                        };
                    }

                    function createSeriesCommon() {
                        return {
                            type: 'treemap',
                            label: {
                                show: true,
                                formatter: "{b}",
                                normal: {
                                    textStyle: {
                                        ellipsis: true
                                    }
                                }
                            },
                            itemStyle: {
                                normal: {
                                    borderColor: 'black'
                                }
                            },
                            levels: getLevelOption(0)
                        };
                    }

                    formatUtil = echarts.format;
                    var modes = ['2012Budget', '2011Budget', 'Growth'];

                    var option = {
                        title: {
                            text: '财务统计',
                            subtext: '由日升昌大数据中心提供计算服务',
                            left: 'center',
                        },

                        legend: {
                            data: modes,
                            selectedMode: 'single',
                            top: 80,
                            itemGap: 5
                        },

                        tooltip: {
                            formatter: getTooltipFormatter(0)
                        },

                        series: modes.map(function (mode, idx) {
                            var seriesOpt = createSeriesCommon();
                            seriesOpt.name = mode;
                            seriesOpt.top = 120;
                            seriesOpt.visualDimension = idx === 2 ? 2 : null;
                            seriesOpt.data = buildData(idx, obama_budget_2012);
                            seriesOpt.levels = getLevelOption(idx);
                            return seriesOpt;
                        })
                    };
                    market.setOption(option)
                })
            }
        };
    }])
    /**
     * 动力煤
     */
    .directive("donglimei", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            scope: {
                'data': '='
            },
            templateUrl: 'templates/directives/template/donglimei.html',
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var donglimei = echarts.init(document.getElementById('donglimei'));
                    var option = {
                        color: ['#c23531', '#61a0a8', '#d48265'],
                        series: [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius: ['50%', '70%'],
                                avoidLabelOverlap: false,
                                label: {
                                    normal: {
                                        show: false,
                                        position: 'center'
                                    },
                                    emphasis: {
                                        show: true,
                                        textStyle: {
                                            fontSize: '10',
                                            fontWeight: 'bold'
                                        }
                                    }
                                },
                                labelLine: {
                                    normal: {
                                        show: false
                                    }
                                }
                            }
                        ]
                    };
                    option.series[0].data = $scope.data;
                    donglimei.setOption(option);
                    setInterval(function () {
                        donglimei.setOption(option);
                    }, 1000)

                })
            }
        };
    }])
    /**
     * 无烟煤
     */
    .directive("wuyanmei", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='wuyanmei' style='width: 100px;height: 100px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var wuyanmei = echarts.init(document.getElementById('wuyanmei'));
                    var option = {
                        color: ['#c23531', '#61a0a8', '#d48265'],
                        series: [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius: ['50%', '70%'],
                                avoidLabelOverlap: false,
                                label: {
                                    normal: {
                                        show: false,
                                        position: 'center'
                                    },
                                    emphasis: {
                                        show: true,
                                        textStyle: {
                                            fontSize: '10',
                                            fontWeight: 'bold'
                                        }
                                    }
                                },
                                labelLine: {
                                    normal: {
                                        show: false
                                    }
                                }
                            }
                        ]
                    };
                    option.series[0].data = $scope.data;
                    wuyanmei.setOption(option);
                    setInterval(function () {
                        wuyanmei.setOption(option);
                    }, 1000)

                })
            }
        };
    }])
    /**
     * 喷吹煤
     */
    .directive("penchuimei", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='penchuimei' style='width: 100px;height: 100px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var penchuimei = echarts.init(document.getElementById('penchuimei'));
                    var option = {
                        color: ['#c23531', '#61a0a8', '#d48265'],
                        series: [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius: ['50%', '70%'],
                                avoidLabelOverlap: false,
                                label: {
                                    normal: {
                                        show: false,
                                        position: 'center'
                                    },
                                    emphasis: {
                                        show: true,
                                        textStyle: {
                                            fontSize: '10',
                                            fontWeight: 'bold'
                                        }
                                    }
                                },
                                labelLine: {
                                    normal: {
                                        show: false
                                    }
                                }
                            }
                        ]
                    };
                    option.series[0].data = $scope.data;
                    penchuimei.setOption(option);
                    setInterval(function () {
                        penchuimei.setOption(option);
                    }, 1000)

                })
            }
        };
    }])
    /**
     * 炼焦煤
     */
    .directive("lianjiaomei", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='lianjiaomei' style='width: 100px;height: 100px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var lianjiaomei = echarts.init(document.getElementById('lianjiaomei'));
                    var option = {
                        color: ['#c23531', '#61a0a8', '#d48265'],
                        series: [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius: ['50%', '70%'],
                                avoidLabelOverlap: false,
                                label: {
                                    normal: {
                                        show: false,
                                        position: 'center'
                                    },
                                    emphasis: {
                                        show: true,
                                        textStyle: {
                                            fontSize: '10',
                                            fontWeight: 'bold'
                                        }
                                    }
                                },
                                labelLine: {
                                    normal: {
                                        show: false
                                    }
                                }
                            }
                        ]
                    };
                    option.series[0].data = $scope.data;
                    lianjiaomei.setOption(option);
                    setInterval(function () {
                        lianjiaomei.setOption(option);
                    }, 1000)

                })
            }
        };
    }])
    /**
     * 原煤
     */
    .directive("yuanmei", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='yuanmei' style='width: 100px;height: 100px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var yuanmei = echarts.init(document.getElementById('yuanmei'));
                    var option = {
                        color: ['#c23531', '#61a0a8', '#d48265'],
                        series: [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius: ['50%', '70%'],
                                avoidLabelOverlap: false,
                                label: {
                                    normal: {
                                        show: false,
                                        position: 'center'
                                    },
                                    emphasis: {
                                        show: true,
                                        textStyle: {
                                            fontSize: '10',
                                            fontWeight: 'bold'
                                        }
                                    }
                                },
                                labelLine: {
                                    normal: {
                                        show: false
                                    }
                                }
                            }
                        ]
                    };
                    option.series[0].data = $scope.data;
                    yuanmei.setOption(option);
                    setInterval(function () {
                        yuanmei.setOption(option);
                    }, 1000)

                })
            }
        };
    }])
    /**
     * 浏览量
     */
    .directive("browse", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='browse' style='width: 400px;height: 150px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var browse = echarts.init(document.getElementById('browse'));
                    var option = {

                        tooltip: {
                            trigger: 'axis'
                        },
                        legend: {
                            data: []
                        },
                        grid: {
                            left: '1%',
                            right: '4%',
                            bottom: '1%',
                            containLabel: false,

                        },
                        xAxis: {
                            type: 'category',
                            boundaryGap: false,
                            data: ['周一', '周二', '周三', '周四', '周五', '周六', '周日'],
                            show: false
                        },
                        yAxis: {
                            type: 'value',
                            boundaryGap: [],
                            show: false
                        }
                    };
                    option.series = $scope.data;
                    browse.setOption(option);
                    setInterval(function () {
                        browse.setOption(option);
                    }, 1000)
                })
            }
        };
    }])
    /**
     * 金额
     */
    .directive("money", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='money' style='width: 400px;height: 230px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var money = echarts.init(document.getElementById('money'));
                    var option = {
                        tooltip: {
                            trigger: 'axis',
                            axisPointer: {
                                type: 'shadow'
                            }
                        },
                        grid: {
                            left: '4%',
                            right: '4%',
                            bottom: '3%',
                            containLabel: true
                        },
                        xAxis: {
                            show: false,
                            type: 'value',
                            boundaryGap: [0]
                        },
                        yAxis: {
                            type: 'category',
                            data: [
                                {
                                    value: '商业承兑',
                                    textStyle: {
                                        fontSize: 6,
                                        color: '#3069BE'
                                    }
                                }, {
                                    value: '银行承兑',
                                    textStyle: {
                                        fontSize: 6,
                                        color: '#d48265'
                                    }
                                }, {
                                    value: '现汇结算',
                                    textStyle: {
                                        fontSize: 6,
                                        color: '#54D475'
                                    }
                                }, {
                                    value: '全部',
                                    textStyle: {
                                        fontSize: 6,
                                        color: '#91c7ae'
                                    }
                                }
                            ]
                        },
                        series: [
                            {
                                type: 'bar',
                                data: [
                                    {
                                        value: 23438,
                                        itemStyle: {
                                            normal: {
                                                color: '#3069BE',
                                            }
                                        }
                                    }, {
                                        value: 31000,
                                        itemStyle: {
                                            normal: {
                                                color: '#d48265',
                                            }
                                        }
                                    }, {
                                        value: 121594,
                                        itemStyle: {
                                            normal: {
                                                color: '#54D475',
                                            }
                                        }
                                    }, {
                                        value: 134141,
                                        itemStyle: {
                                            normal: {
                                                color: '#91c7ae',
                                            }
                                        }
                                    }]
                            }
                        ]
                    };
                    money.setOption(option);
                    // setInterval(function () {
                    //     console.log('111',option.series[0].data[0].value)
                    //     for(var i=0; i<100;i++){
                    //         option.series[0].data[0].value++;
                    //         money.setOption(option);
                    //     }
                    //     console.log('111',option.series[0].data[0].value)
                    // },1000)
                })
            }
        };
    }])
    /**
     * 转化
     */
    .directive("change", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='change' style='width: 400px;height: 200px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var change = echarts.init(document.getElementById('change'));
                    var option = {
                        color: ['#c23531', '#2f4554', '#61a0a8', '#d48265', '#91c7ae'],
                        tooltip: {
                            trigger: 'axis',
                            axisPointer: {
                                type: 'shadow'
                            }
                        },
                        grid: {
                            left: '4%',
                            right: '4%',
                            bottom: '3%',
                            containLabel: true
                        },
                        xAxis: {
                            show: false,
                            type: 'category',
                            data: []

                        },
                        yAxis: {
                            show: false,
                            type: 'value',

                        },
                        series: [{
                            type: 'line',
                            data: [0, 120, 210, 130, 200, 62, 0],
                            areaStyle: {
                                normal: {

                                    color: '#DCB42F',
                                    opacity: 0.6
                                }
                            },
                            lineStyle: {
                                normal: {

                                    color: '#DCB42F',
                                    opacity: 0.6
                                }
                            }
                        }]
                    };

                    change.setOption(option);
                })
            }
        };
    }])