/**
 * Created by Administrator on 2017/6/6 0006.
 */
angular.module('rsc.directive', [])
/**
 * 交易
 */
    .directive("trade", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='trade' style='width: auto;height:1024px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('trade');
                    height.style.height = window.screen.height - 200 + 'px';

                    var trade = echarts.init(document.getElementById('trade'));
                    var geoCoordMap = {
                        "海门": [121.15, 31.89],
                        "鄂尔多斯": [109.781327, 39.608266],
                        "招远": [120.38, 37.35],
                        "舟山": [122.207216, 29.985295],
                        "齐齐哈尔": [123.97, 47.33],
                        "盐城": [120.13, 33.38],
                        "赤峰": [118.87, 42.28],
                        "青岛": [120.33, 36.07],
                        "乳山": [121.52, 36.89],
                        "金昌": [102.188043, 38.520089],
                        "泉州": [118.58, 24.93],
                        "莱西": [120.53, 36.86],
                        "日照": [119.46, 35.42],
                        "胶南": [119.97, 35.88],
                        "南通": [121.05, 32.08],
                        "拉萨": [91.11, 29.97],
                        "云浮": [112.02, 22.93],
                        "梅州": [116.1, 24.55],
                        "文登": [122.05, 37.2],
                        "上海": [121.48, 31.22],
                        "攀枝花": [101.718637, 26.582347],
                        "威海": [122.1, 37.5],
                        "承德": [117.93, 40.97],
                        "厦门": [118.1, 24.46],
                        "汕尾": [115.375279, 22.786211],
                        "潮州": [116.63, 23.68],
                        "丹东": [124.37, 40.13],
                        "太仓": [121.1, 31.45],
                        "曲靖": [103.79, 25.51],
                        "烟台": [121.39, 37.52],
                        "福州": [119.3, 26.08],
                        "瓦房店": [121.979603, 39.627114],
                        "即墨": [120.45, 36.38],
                        "抚顺": [123.97, 41.97],
                        "玉溪": [102.52, 24.35],
                        "张家口": [114.87, 40.82],
                        "阳泉": [113.57, 37.85],
                        "莱州": [119.942327, 37.177017],
                        "湖州": [120.1, 30.86],
                        "汕头": [116.69, 23.39],
                        "昆山": [120.95, 31.39],
                        "宁波": [121.56, 29.86],
                        "湛江": [110.359377, 21.270708],
                        "揭阳": [116.35, 23.55],
                        "荣成": [122.41, 37.16],
                        "连云港": [119.16, 34.59],
                        "葫芦岛": [120.836932, 40.711052],
                        "常熟": [120.74, 31.64],
                        "东莞": [113.75, 23.04],
                        "河源": [114.68, 23.73],
                        "淮安": [119.15, 33.5],
                        "泰州": [119.9, 32.49],
                        "南宁": [108.33, 22.84],
                        "营口": [122.18, 40.65],
                        "惠州": [114.4, 23.09],
                        "江阴": [120.26, 31.91],
                        "蓬莱": [120.75, 37.8],
                        "韶关": [113.62, 24.84],
                        "嘉峪关": [98.289152, 39.77313],
                        "广州": [113.23, 23.16],
                        "延安": [109.47, 36.6],
                        "太原": [112.53, 37.87],
                        "清远": [113.01, 23.7],
                        "中山": [113.38, 22.52],
                        "昆明": [102.73, 25.04],
                        "寿光": [118.73, 36.86],
                        "盘锦": [122.070714, 41.119997],
                        "长治": [113.08, 36.18],
                        "深圳": [114.07, 22.62],
                        "珠海": [113.52, 22.3],
                        "宿迁": [118.3, 33.96],
                        "咸阳": [108.72, 34.36],
                        "铜川": [109.11, 35.09],
                        "平度": [119.97, 36.77],
                        "佛山": [113.11, 23.05],
                        "海口": [110.35, 20.02],
                        "江门": [113.06, 22.61],
                        "章丘": [117.53, 36.72],
                        "肇庆": [112.44, 23.05],
                        "大连": [121.62, 38.92],
                        "临汾": [111.5, 36.08],
                        "吴江": [120.63, 31.16],
                        "石嘴山": [106.39, 39.04],
                        "沈阳": [123.38, 41.8],
                        "苏州": [120.62, 31.32],
                        "茂名": [110.88, 21.68],
                        "嘉兴": [120.76, 30.77],
                        "长春": [125.35, 43.88],
                        "胶州": [120.03336, 36.264622],
                        "银川": [106.27, 38.47],
                        "张家港": [120.555821, 31.875428],
                        "三门峡": [111.19, 34.76],
                        "锦州": [121.15, 41.13],
                        "南昌": [115.89, 28.68],
                        "柳州": [109.4, 24.33],
                        "三亚": [109.511909, 18.252847],
                        "自贡": [104.778442, 29.33903],
                        "吉林": [126.57, 43.87],
                        "阳江": [111.95, 21.85],
                        "泸州": [105.39, 28.91],
                        "西宁": [101.74, 36.56],
                        "宜宾": [104.56, 29.77],
                        "呼和浩特": [111.65, 40.82],
                        "成都": [104.06, 30.67],
                        "大同": [113.3, 40.12],
                        "镇江": [119.44, 32.2],
                        "桂林": [110.28, 25.29],
                        "张家界": [110.479191, 29.117096],
                        "宜兴": [119.82, 31.36],
                        "北海": [109.12, 21.49],
                        "西安": [108.95, 34.27],
                        "金坛": [119.56, 31.74],
                        "东营": [118.49, 37.46],
                        "牡丹江": [129.58, 44.6],
                        "遵义": [106.9, 27.7],
                        "绍兴": [120.58, 30.01],
                        "扬州": [119.42, 32.39],
                        "常州": [119.95, 31.79],
                        "潍坊": [119.1, 36.62],
                        "重庆": [106.54, 29.59],
                        "台州": [121.420757, 28.656386],
                        "南京": [118.78, 32.04],
                        "滨州": [118.03, 37.36],
                        "贵阳": [106.71, 26.57],
                        "无锡": [120.29, 31.59],
                        "本溪": [123.73, 41.3],
                        "克拉玛依": [84.77, 45.59],
                        "渭南": [109.5, 34.52],
                        "马鞍山": [118.48, 31.56],
                        "宝鸡": [107.15, 34.38],
                        "焦作": [113.21, 35.24],
                        "句容": [119.16, 31.95],
                        "北京": [116.46, 39.92],
                        "徐州": [117.2, 34.26],
                        "衡水": [115.72, 37.72],
                        "包头": [110, 40.58],
                        "绵阳": [104.73, 31.48],
                        "乌鲁木齐": [87.68, 43.77],
                        "枣庄": [117.57, 34.86],
                        "杭州": [120.19, 30.26],
                        "淄博": [118.05, 36.78],
                        "鞍山": [122.85, 41.12],
                        "溧阳": [119.48, 31.43],
                        "库尔勒": [86.06, 41.68],
                        "安阳": [114.35, 36.1],
                        "开封": [114.35, 34.79],
                        "济南": [117, 36.65],
                        "德阳": [104.37, 31.13],
                        "温州": [120.65, 28.01],
                        "九江": [115.97, 29.71],
                        "邯郸": [114.47, 36.6],
                        "临安": [119.72, 30.23],
                        "兰州": [103.73, 36.03],
                        "沧州": [116.83, 38.33],
                        "临沂": [118.35, 35.05],
                        "南充": [106.110698, 30.837793],
                        "天津": [117.2, 39.13],
                        "富阳": [119.95, 30.07],
                        "泰安": [117.13, 36.18],
                        "诸暨": [120.23, 29.71],
                        "郑州": [113.65, 34.76],
                        "哈尔滨": [126.63, 45.75],
                        "聊城": [115.97, 36.45],
                        "芜湖": [118.38, 31.33],
                        "唐山": [118.02, 39.63],
                        "平顶山": [113.29, 33.75],
                        "邢台": [114.48, 37.05],
                        "德州": [116.29, 37.45],
                        "济宁": [116.59, 35.38],
                        "荆州": [112.239741, 30.335165],
                        "宜昌": [111.3, 30.7],
                        "义乌": [120.06, 29.32],
                        "丽水": [119.92, 28.45],
                        "洛阳": [112.44, 34.7],
                        "秦皇岛": [119.57, 39.95],
                        "株洲": [113.16, 27.83],
                        "石家庄": [114.48, 38.03],
                        "莱芜": [117.67, 36.19],
                        "常德": [111.69, 29.05],
                        "保定": [115.48, 38.85],
                        "湘潭": [112.91, 27.87],
                        "金华": [119.64, 29.12],
                        "岳阳": [113.09, 29.37],
                        "长沙": [113, 28.21],
                        "衢州": [118.88, 28.97],
                        "廊坊": [116.7, 39.53],
                        "菏泽": [115.480656, 35.23375],
                        "合肥": [117.27, 31.86],
                        "武汉": [114.31, 30.52],
                        "大庆": [125.03, 46.58]
                    };

                    var data = [
                        {name: "海门", value: 9},
                        {name: "鄂尔多斯", value: 12},
                        {name: "招远", value: 12},
                        {name: "舟山", value: 12},
                        {name: "齐齐哈尔", value: 14},
                        {name: "盐城", value: 15},
                        {name: "赤峰", value: 16},
                        {name: "青岛", value: 18},
                        {name: "乳山", value: 18},
                        {name: "金昌", value: 19},
                        {name: "泉州", value: 21},
                        {name: "莱西", value: 21},
                        {name: "日照", value: 21},
                        {name: "胶南", value: 22},
                        {name: "南通", value: 23},
                        {name: "拉萨", value: 24},
                        {name: "云浮", value: 24},
                        {name: "梅州", value: 25},
                        {name: "文登", value: 25},
                        {name: "上海", value: 25},
                        {name: "攀枝花", value: 25},
                        {name: "威海", value: 25},
                        {name: "承德", value: 25},
                        {name: "厦门", value: 26},
                        {name: "汕尾", value: 26},
                        {name: "潮州", value: 26},
                        {name: "丹东", value: 27},
                        {name: "太仓", value: 27},
                        {name: "曲靖", value: 27},
                        {name: "烟台", value: 28},
                        {name: "福州", value: 29},
                        {name: "瓦房店", value: 30},
                        {name: "即墨", value: 30},
                        {name: "抚顺", value: 31},
                        {name: "玉溪", value: 31},
                        {name: "张家口", value: 31},
                        {name: "阳泉", value: 31},
                        {name: "莱州", value: 32},
                        {name: "湖州", value: 32},
                        {name: "汕头", value: 32},
                        {name: "昆山", value: 33},
                        {name: "宁波", value: 33},
                        {name: "湛江", value: 33},
                        {name: "揭阳", value: 34},
                        {name: "荣成", value: 34},
                        {name: "连云港", value: 35},
                        {name: "葫芦岛", value: 35},
                        {name: "常熟", value: 36},
                        {name: "东莞", value: 36},
                        {name: "河源", value: 36},
                        {name: "淮安", value: 36},
                        {name: "泰州", value: 36},
                        {name: "南宁", value: 37},
                        {name: "营口", value: 37},
                        {name: "惠州", value: 37},
                        {name: "江阴", value: 37},
                        {name: "蓬莱", value: 37},
                        {name: "韶关", value: 38},
                        {name: "嘉峪关", value: 38},
                        {name: "广州", value: 38},
                        {name: "延安", value: 38},
                        {name: "太原", value: 39},
                        {name: "清远", value: 39},
                        {name: "中山", value: 39},
                        {name: "昆明", value: 39},
                        {name: "寿光", value: 40},
                        {name: "盘锦", value: 40},
                        {name: "长治", value: 41},
                        {name: "深圳", value: 41},
                        {name: "珠海", value: 42},
                        {name: "宿迁", value: 43},
                        {name: "咸阳", value: 43},
                        {name: "铜川", value: 44},
                        {name: "平度", value: 44},
                        {name: "佛山", value: 44},
                        {name: "海口", value: 44},
                        {name: "江门", value: 45},
                        {name: "章丘", value: 45},
                        {name: "肇庆", value: 46},
                        {name: "大连", value: 47},
                        {name: "临汾", value: 47},
                        {name: "吴江", value: 47},
                        {name: "石嘴山", value: 49},
                        {name: "沈阳", value: 50},
                        {name: "苏州", value: 50},
                        {name: "茂名", value: 50},
                        {name: "嘉兴", value: 51},
                        {name: "长春", value: 51},
                        {name: "胶州", value: 52},
                        {name: "银川", value: 52},
                        {name: "张家港", value: 52},
                        {name: "三门峡", value: 53},
                        {name: "锦州", value: 54},
                        {name: "南昌", value: 54},
                        {name: "柳州", value: 54},
                        {name: "三亚", value: 54},
                        {name: "自贡", value: 56},
                        {name: "吉林", value: 56},
                        {name: "阳江", value: 57},
                        {name: "泸州", value: 57},
                        {name: "西宁", value: 57},
                        {name: "宜宾", value: 58},
                        {name: "呼和浩特", value: 58},
                        {name: "成都", value: 58},
                        {name: "大同", value: 58},
                        {name: "镇江", value: 59},
                        {name: "桂林", value: 59},
                        {name: "张家界", value: 59},
                        {name: "宜兴", value: 59},
                        {name: "北海", value: 60},
                        {name: "西安", value: 61},
                        {name: "金坛", value: 62},
                        {name: "东营", value: 62},
                        {name: "牡丹江", value: 63},
                        {name: "遵义", value: 63},
                        {name: "绍兴", value: 63},
                        {name: "扬州", value: 64},
                        {name: "常州", value: 64},
                        {name: "潍坊", value: 65},
                        {name: "重庆", value: 66},
                        {name: "台州", value: 67},
                        {name: "南京", value: 67},
                        {name: "滨州", value: 70},
                        {name: "贵阳", value: 71},
                        {name: "无锡", value: 71},
                        {name: "本溪", value: 71},
                        {name: "克拉玛依", value: 72},
                        {name: "渭南", value: 72},
                        {name: "马鞍山", value: 72},
                        {name: "宝鸡", value: 72},
                        {name: "焦作", value: 75},
                        {name: "句容", value: 75},
                        {name: "北京", value: 79},
                        {name: "徐州", value: 79},
                        {name: "衡水", value: 80},
                        {name: "包头", value: 80},
                        {name: "绵阳", value: 80},
                        {name: "乌鲁木齐", value: 84},
                        {name: "枣庄", value: 84},
                        {name: "杭州", value: 84},
                        {name: "淄博", value: 85},
                        {name: "鞍山", value: 86},
                        {name: "溧阳", value: 86},
                        {name: "库尔勒", value: 86},
                        {name: "安阳", value: 90},
                        {name: "开封", value: 90},
                        {name: "济南", value: 92},
                        {name: "德阳", value: 93},
                        {name: "温州", value: 95},
                        {name: "九江", value: 96},
                        {name: "邯郸", value: 98},
                        {name: "临安", value: 99},
                        {name: "兰州", value: 99},
                        {name: "沧州", value: 100},
                        {name: "临沂", value: 103},
                        {name: "南充", value: 104},
                        {name: "天津", value: 105},
                        {name: "富阳", value: 106},
                        {name: "泰安", value: 112},
                        {name: "诸暨", value: 112},
                        {name: "郑州", value: 113},
                        {name: "哈尔滨", value: 114},
                        {name: "聊城", value: 116},
                        {name: "芜湖", value: 117},
                        {name: "唐山", value: 119},
                        {name: "平顶山", value: 119},
                        {name: "邢台", value: 119},
                        {name: "德州", value: 120},
                        {name: "济宁", value: 120},
                        {name: "荆州", value: 127},
                        {name: "宜昌", value: 130},
                        {name: "义乌", value: 132},
                        {name: "丽水", value: 133},
                        {name: "洛阳", value: 134},
                        {name: "秦皇岛", value: 136},
                        {name: "株洲", value: 143},
                        {name: "石家庄", value: 147},
                        {name: "莱芜", value: 148},
                        {name: "常德", value: 152},
                        {name: "保定", value: 153},
                        {name: "湘潭", value: 154},
                        {name: "金华", value: 157},
                        {name: "岳阳", value: 169},
                        {name: "长沙", value: 175},
                        {name: "衢州", value: 177},
                        {name: "廊坊", value: 193},
                        {name: "菏泽", value: 194},
                        {name: "合肥", value: 229},
                        {name: "武汉", value: 273},
                        {name: "大庆", value: 279}
                    ];

                    var convertData = function (data) {
                        var res = [];
                        for (var i = 0; i < data.length; i++) {
                            var geoCoord = geoCoordMap[data[i].name];
                            if (geoCoord) {
                                res.push({
                                    name: data[i].name,
                                    value: geoCoord.concat(data[i].value)
                                });
                            }
                        }
                        return res;
                    };

                    var convertedData = [
                        convertData(data),
                        convertData(data.sort(function (a, b) {
                            return b.value - a.value;
                        }).slice(0, 6))
                    ];


                    var option = {
                        backgroundColor: '#404a59',
                        animation: true,
                        animationDuration: 1000,
                        animationEasing: 'cubicInOut',
                        animationDurationUpdate: 1000,
                        animationEasingUpdate: 'cubicInOut',
                        title: [
                            {
                                text: '全国主要城市 PM 2.5',
                                subtext: 'data from PM25.in',
                                sublink: 'http://www.pm25.in',
                                left: 'center',
                                textStyle: {
                                    color: '#fff'
                                }
                            },
                            {
                                id: 'statistic',
                                right: 120,
                                top: 40,
                                width: 100,
                                textStyle: {
                                    color: '#fff',
                                    fontSize: 16
                                }
                            }
                        ],
                        toolbox: {
                            iconStyle: {
                                normal: {
                                    borderColor: '#fff'
                                },
                                emphasis: {
                                    borderColor: '#b1e4ff'
                                }
                            }
                        },
                        brush: {
                            outOfBrush: {
                                color: '#abc'
                            },
                            brushStyle: {
                                borderWidth: 2,
                                color: 'rgba(0,0,0,0.2)',
                                borderColor: 'rgba(0,0,0,0.5)',
                            },
                            seriesIndex: [0, 1],
                            throttleType: 'debounce',
                            throttleDelay: 300,
                            geoIndex: 0
                        },
                        geo: {
                            map: 'china',
                            left: '10',
                            right: '35%',
                            center: [117.98561551896913, 31.205000490896193],
                            zoom: 2.5,
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#111'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            }
                        },
                        tooltip: {
                            trigger: 'item'
                        },
                        grid: {
                            right: 40,
                            top: 100,
                            bottom: 40,
                            width: '30%'
                        },
                        xAxis: {
                            type: 'value',
                            scale: true,
                            position: 'top',
                            boundaryGap: false,
                            splitLine: {show: false},
                            axisLine: {show: false},
                            axisTick: {show: false},
                            axisLabel: {margin: 2, textStyle: {color: '#aaa'}},
                        },
                        yAxis: {
                            type: 'category',
                            name: 'TOP 20',
                            nameGap: 16,
                            axisLine: {show: false, lineStyle: {color: '#ddd'}},
                            axisTick: {show: false, lineStyle: {color: '#ddd'}},
                            axisLabel: {interval: 0, textStyle: {color: '#ddd'}},
                            data: []
                        },
                        series: [
                            {
                                name: 'pm2.5',
                                type: 'scatter',
                                coordinateSystem: 'geo',
                                data: convertedData[0],
                                symbolSize: function (val) {
                                    return Math.max(val[2] / 10, 8);
                                },
                                label: {
                                    normal: {
                                        formatter: '{b}',
                                        position: 'right',
                                        show: false
                                    },
                                    emphasis: {
                                        show: true
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#ddb926'
                                    }
                                }
                            },
                            {
                                name: 'Top 5',
                                type: 'effectScatter',
                                coordinateSystem: 'geo',
                                data: convertedData[1],
                                symbolSize: function (val) {
                                    return Math.max(val[2] / 10, 8);
                                },
                                showEffectOn: 'emphasis',
                                rippleEffect: {
                                    brushType: 'stroke'
                                },
                                hoverAnimation: true,
                                label: {
                                    normal: {
                                        formatter: '{b}',
                                        position: 'right',
                                        show: true
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#f4e925',
                                        shadowBlur: 10,
                                        shadowColor: '#333'
                                    }
                                },
                                zlevel: 1
                            },
                            {
                                id: 'bar',
                                zlevel: 2,
                                type: 'bar',
                                symbol: 'none',
                                itemStyle: {
                                    normal: {
                                        color: '#ddb926'
                                    }
                                },
                                data: []
                            }
                        ]
                    };

                    trade.on('brushselected', renderBrushed);

                    setTimeout(function () {
                        trade.dispatchAction({
                            type: 'brush',
                            areas: [
                                {
                                    geoIndex: 0,
                                    brushType: 'polygon',
                                    coordRange: [[119.72, 34.85], [119.68, 34.85], [119.5, 34.84], [119.19, 34.77], [118.76, 34.63], [118.6, 34.6], [118.46, 34.6], [118.33, 34.57], [118.05, 34.56], [117.6, 34.56], [117.41, 34.56], [117.25, 34.56], [117.11, 34.56], [117.02, 34.56], [117, 34.56], [116.94, 34.56], [116.94, 34.55], [116.9, 34.5], [116.88, 34.44], [116.88, 34.37], [116.88, 34.33], [116.88, 34.24], [116.92, 34.15], [116.98, 34.09], [117.05, 34.06], [117.19, 33.96], [117.29, 33.9], [117.43, 33.8], [117.49, 33.75], [117.54, 33.68], [117.6, 33.65], [117.62, 33.61], [117.64, 33.59], [117.68, 33.58], [117.7, 33.52], [117.74, 33.5], [117.74, 33.46], [117.8, 33.44], [117.82, 33.41], [117.86, 33.37], [117.9, 33.3], [117.9, 33.28], [117.9, 33.27], [118.09, 32.97], [118.21, 32.7], [118.29, 32.56], [118.31, 32.5], [118.35, 32.46], [118.35, 32.42], [118.35, 32.36], [118.35, 32.34], [118.37, 32.24], [118.37, 32.14], [118.37, 32.09], [118.44, 32.05], [118.46, 32.01], [118.54, 31.98], [118.6, 31.93], [118.68, 31.86], [118.72, 31.8], [118.74, 31.78], [118.76, 31.74], [118.78, 31.7], [118.82, 31.64], [118.82, 31.62], [118.86, 31.58], [118.86, 31.55], [118.88, 31.54], [118.88, 31.52], [118.9, 31.51], [118.91, 31.48], [118.93, 31.43], [118.95, 31.4], [118.97, 31.39], [118.97, 31.37], [118.97, 31.34], [118.97, 31.27], [118.97, 31.21], [118.97, 31.17], [118.97, 31.12], [118.97, 31.02], [118.97, 30.93], [118.97, 30.87], [118.97, 30.85], [118.95, 30.8], [118.95, 30.77], [118.95, 30.76], [118.93, 30.7], [118.91, 30.63], [118.91, 30.61], [118.91, 30.6], [118.9, 30.6], [118.88, 30.54], [118.88, 30.51], [118.86, 30.51], [118.86, 30.46], [118.72, 30.18], [118.68, 30.1], [118.66, 30.07], [118.62, 29.91], [118.56, 29.73], [118.52, 29.63], [118.48, 29.51], [118.44, 29.42], [118.44, 29.32], [118.43, 29.19], [118.43, 29.14], [118.43, 29.08], [118.44, 29.05], [118.46, 29.05], [118.6, 28.95], [118.64, 28.94], [119.07, 28.51], [119.25, 28.41], [119.36, 28.28], [119.46, 28.19], [119.54, 28.13], [119.66, 28.03], [119.78, 28], [119.87, 27.94], [120.03, 27.86], [120.17, 27.79], [120.23, 27.76], [120.3, 27.72], [120.42, 27.66], [120.52, 27.64], [120.58, 27.63], [120.64, 27.63], [120.77, 27.63], [120.89, 27.61], [120.97, 27.6], [121.07, 27.59], [121.15, 27.59], [121.28, 27.59], [121.38, 27.61], [121.56, 27.73], [121.73, 27.89], [122.03, 28.2], [122.3, 28.5], [122.46, 28.72], [122.5, 28.77], [122.54, 28.82], [122.56, 28.82], [122.58, 28.85], [122.6, 28.86], [122.61, 28.91], [122.71, 29.02], [122.73, 29.08], [122.93, 29.44], [122.99, 29.54], [123.03, 29.66], [123.05, 29.73], [123.16, 29.92], [123.24, 30.02], [123.28, 30.13], [123.32, 30.29], [123.36, 30.36], [123.36, 30.55], [123.36, 30.74], [123.36, 31.05], [123.36, 31.14], [123.36, 31.26], [123.38, 31.42], [123.46, 31.74], [123.48, 31.83], [123.48, 31.95], [123.46, 32.09], [123.34, 32.25], [123.22, 32.39], [123.12, 32.46], [123.07, 32.48], [123.05, 32.49], [122.97, 32.53], [122.91, 32.59], [122.83, 32.81], [122.77, 32.87], [122.71, 32.9], [122.56, 32.97], [122.38, 33.05], [122.3, 33.12], [122.26, 33.15], [122.22, 33.21], [122.22, 33.3], [122.22, 33.39], [122.18, 33.44], [122.07, 33.56], [121.99, 33.69], [121.89, 33.78], [121.69, 34.02], [121.66, 34.05], [121.64, 34.08]]
                                }
                            ]
                        });
                    }, 0);


                    function renderBrushed(params) {
                        var mainSeries = params.batch[0].selected[0];

                        var selectedItems = [];
                        var categoryData = [];
                        var barData = [];
                        var maxBar = 30;
                        var sum = 0;
                        var count = 0;

                        for (var i = 0; i < mainSeries.dataIndex.length; i++) {
                            var rawIndex = mainSeries.dataIndex[i];
                            var dataItem = convertedData[0][rawIndex];
                            var pmValue = dataItem.value[2];

                            sum += pmValue;
                            count++;

                            selectedItems.push(dataItem);
                        }

                        selectedItems.sort(function (a, b) {
                            return a.value[2] - b.value[2];
                        });

                        for (var i = 0; i < Math.min(selectedItems.length, maxBar); i++) {
                            categoryData.push(selectedItems[i].name);
                            barData.push(selectedItems[i].value[2]);
                        }

                        this.setOption({
                            yAxis: {
                                data: categoryData
                            },
                            xAxis: {
                                axisLabel: {show: !!count}
                            },
                            title: {
                                id: 'statistic',
                                text: count ? '平均: ' + (sum / count).toFixed(4) : ''
                            },
                            series: {
                                id: 'bar',
                                data: barData
                            }
                        });
                    }

                    trade.setOption(option);
                })
            }
        };
    }])

    /**
     * 物流
     */
    .directive("pass", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='pass' style='width: auto;height:1024px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('pass');
                    height.style.height = window.screen.height - 200 + 'px';
                    var pass = echarts.init(document.getElementById('pass'));
                    var geoCoordMap = {
                        '上海': [121.4648, 31.2891],
                        '东莞': [113.8953, 22.901],
                        '东营': [118.7073, 37.5513],
                        '中山': [113.4229, 22.478],
                        '临汾': [111.4783, 36.1615],
                        '临沂': [118.3118, 35.2936],
                        '丹东': [124.541, 40.4242],
                        '丽水': [119.5642, 28.1854],
                        '乌鲁木齐': [87.9236, 43.5883],
                        '佛山': [112.8955, 23.1097],
                        '保定': [115.0488, 39.0948],
                        '兰州': [103.5901, 36.3043],
                        '包头': [110.3467, 41.4899],
                        '北京': [116.4551, 40.2539],
                        '北海': [109.314, 21.6211],
                        '南京': [118.8062, 31.9208],
                        '南宁': [108.479, 23.1152],
                        '南昌': [116.0046, 28.6633],
                        '南通': [121.1023, 32.1625],
                        '厦门': [118.1689, 24.6478],
                        '台州': [121.1353, 28.6688],
                        '合肥': [117.29, 32.0581],
                        '呼和浩特': [111.4124, 40.4901],
                        '咸阳': [108.4131, 34.8706],
                        '哈尔滨': [127.9688, 45.368],
                        '唐山': [118.4766, 39.6826],
                        '嘉兴': [120.9155, 30.6354],
                        '大同': [113.7854, 39.8035],
                        '大连': [122.2229, 39.4409],
                        '天津': [117.4219, 39.4189],
                        '太原': [112.3352, 37.9413],
                        '威海': [121.9482, 37.1393],
                        '宁波': [121.5967, 29.6466],
                        '宝鸡': [107.1826, 34.3433],
                        '宿迁': [118.5535, 33.7775],
                        '常州': [119.4543, 31.5582],
                        '广州': [113.5107, 23.2196],
                        '廊坊': [116.521, 39.0509],
                        '延安': [109.1052, 36.4252],
                        '张家口': [115.1477, 40.8527],
                        '徐州': [117.5208, 34.3268],
                        '德州': [116.6858, 37.2107],
                        '惠州': [114.6204, 23.1647],
                        '成都': [103.9526, 30.7617],
                        '扬州': [119.4653, 32.8162],
                        '承德': [117.5757, 41.4075],
                        '拉萨': [91.1865, 30.1465],
                        '无锡': [120.3442, 31.5527],
                        '日照': [119.2786, 35.5023],
                        '昆明': [102.9199, 25.4663],
                        '杭州': [119.5313, 29.8773],
                        '枣庄': [117.323, 34.8926],
                        '柳州': [109.3799, 24.9774],
                        '株洲': [113.5327, 27.0319],
                        '武汉': [114.3896, 30.6628],
                        '汕头': [117.1692, 23.3405],
                        '江门': [112.6318, 22.1484],
                        '沈阳': [123.1238, 42.1216],
                        '沧州': [116.8286, 38.2104],
                        '河源': [114.917, 23.9722],
                        '泉州': [118.3228, 25.1147],
                        '泰安': [117.0264, 36.0516],
                        '泰州': [120.0586, 32.5525],
                        '济南': [117.1582, 36.8701],
                        '济宁': [116.8286, 35.3375],
                        '海口': [110.3893, 19.8516],
                        '淄博': [118.0371, 36.6064],
                        '淮安': [118.927, 33.4039],
                        '深圳': [114.5435, 22.5439],
                        '清远': [112.9175, 24.3292],
                        '温州': [120.498, 27.8119],
                        '渭南': [109.7864, 35.0299],
                        '湖州': [119.8608, 30.7782],
                        '湘潭': [112.5439, 27.7075],
                        '滨州': [117.8174, 37.4963],
                        '潍坊': [119.0918, 36.524],
                        '烟台': [120.7397, 37.5128],
                        '玉溪': [101.9312, 23.8898],
                        '珠海': [113.7305, 22.1155],
                        '盐城': [120.2234, 33.5577],
                        '盘锦': [121.9482, 41.0449],
                        '石家庄': [114.4995, 38.1006],
                        '福州': [119.4543, 25.9222],
                        '秦皇岛': [119.2126, 40.0232],
                        '绍兴': [120.564, 29.7565],
                        '聊城': [115.9167, 36.4032],
                        '肇庆': [112.1265, 23.5822],
                        '舟山': [122.2559, 30.2234],
                        '苏州': [120.6519, 31.3989],
                        '莱芜': [117.6526, 36.2714],
                        '菏泽': [115.6201, 35.2057],
                        '营口': [122.4316, 40.4297],
                        '葫芦岛': [120.1575, 40.578],
                        '衡水': [115.8838, 37.7161],
                        '衢州': [118.6853, 28.8666],
                        '西宁': [101.4038, 36.8207],
                        '西安': [109.1162, 34.2004],
                        '贵阳': [106.6992, 26.7682],
                        '连云港': [119.1248, 34.552],
                        '邢台': [114.8071, 37.2821],
                        '邯郸': [114.4775, 36.535],
                        '郑州': [113.4668, 34.6234],
                        '鄂尔多斯': [108.9734, 39.2487],
                        '重庆': [107.7539, 30.1904],
                        '金华': [120.0037, 29.1028],
                        '铜川': [109.0393, 35.1947],
                        '银川': [106.3586, 38.1775],
                        '镇江': [119.4763, 31.9702],
                        '长春': [125.8154, 44.2584],
                        '长沙': [113.0823, 28.2568],
                        '长治': [112.8625, 36.4746],
                        '阳泉': [113.4778, 38.0951],
                        '青岛': [120.4651, 36.3373],
                        '韶关': [113.7964, 24.7028]
                    };

                    var BJData = [
                        [{name: '成都'}, {name: '潍坊', value: 5}],
                        [{name: '潍坊'}, {name: '西宁', value: 5}],
                        [{name: '西宁'}, {name: '温州', value: 5}],
                        [{name: '温州'}, {name: '东莞', value: 5}],
                        [{name: '东莞'}, {name: '汕头', value: 5}],
                        [{name: '汕头'}, {name: '福州', value: 5}],
                        [{name: '福州'}, {name: '连云港', value: 5}],
                        [{name: '连云港'}, {name: '长春', value: 5}],
                        [{name: '长春'}, {name: '南昌', value: 5}],
                        [{name: '南昌'}, {name: '咸阳', value: 5}],
                        [{name: '咸阳'}, {name: '廊坊', value: 5}],
                        [{name: '廊坊'}, {name: '沈阳', value: 5}],
                        [{name: '沈阳'}, {name: '西安', value: 5}],
                        [{name: '西安'}, {name: '南京', value: 5}],
                        [{name: '南京'}, {name: '连云港', value: 5}],
                        [{name: '连云港'}, {name: '深圳', value: 5}],
                        [{name: '深圳'}, {name: '泰安', value: 5}],
                        [{name: '泰安'}, {name: '武汉', value: 5}],
                        [{name: '武汉'}, {name: '昆明', value: 5}],
                        [{name: '昆明'}, {name: '南京', value: 5}],
                        [{name: '南京'}, {name: '武汉', value: 5}],
                        [{name: '武汉'}, {name: '烟台', value: 5}],
                        [{name: '烟台'}, {name: '长春', value: 5}],
                        [{name: '长春'}, {name: '贵阳', value: 5}],
                        [{name: '贵阳'}, {name: '宿迁', value: 5}],
                        [{name: '宿迁'}, {name: '徐州', value: 5}],
                        [{name: '徐州'}, {name: '丽水', value: 5}],
                        [{name: '丽水'}, {name: '长沙', value: 5}],
                        [{name: '长沙'}, {name: '沧州', value: 5}],
                        [{name: '沧州'}, {name: '盐城', value: 5}],
                        [{name: '盐城'}, {name: '宁波', value: 5}],
                        [{name: '宁波'}, {name: '宁波', value: 5}],
                        [{name: '宁波'}, {name: '泰安', value: 5}],
                        [{name: '泰安'}, {name: '厦门', value: 5}],
                        [{name: '厦门'}, {name: '保定', value: 5}],
                        [{name: '保定'}, {name: '宿迁', value: 5}],
                        [{name: '宿迁'}, {name: '深圳', value: 5}],
                        [{name: '深圳'}, {name: '贵阳', value: 5}],
                        [{name: '贵阳'}, {name: '金华', value: 5}],
                        [{name: '金华'}, {name: '肇庆', value: 5}],
                        [{name: '肇庆'}, {name: '金华', value: 5}],
                        [{name: '金华'}, {name: '苏州', value: 5}],
                        [{name: '苏州'}, {name: '东莞', value: 5}],
                        [{name: '东莞'}, {name: '惠州', value: 5}],
                        [{name: '惠州'}, {name: '邯郸', value: 5}],
                        [{name: '邯郸'}, {name: '玉溪', value: 5}],
                        [{name: '玉溪'}, {name: '中山', value: 5}],
                        [{name: '中山'}, {name: '乌鲁木齐', value: 5}],
                        [{name: '乌鲁木齐'}, {name: '廊坊', value: 5}],
                        [{name: '廊坊'}, {name: '廊坊', value: 5}]
                    ];


                    var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';

                    var convertData = function (data) {
                        var res = [];
                        for (var i = 0; i < data.length; i++) {
                            var dataItem = data[i];
                            var fromCoord = geoCoordMap[dataItem[0].name];
                            var toCoord = geoCoordMap[dataItem[1].name];
                            if (fromCoord && toCoord) {
                                res.push({
                                    fromName: dataItem[0].name,
                                    toName: dataItem[1].name,
                                    coords: [fromCoord, toCoord]
                                });
                            }
                        }
                        return res;
                    };

                    var color = ['#a6c84c', '#ffa022', '#46bee9'];
                    var series = [];
                    [['北京', BJData]].forEach(function (item, i) {
                        series.push({
                                name: item[0] + ' Top10',
                                type: 'lines',
                                zlevel: 1,
                                effect: {
                                    show: true,
                                    period: 6,
                                    trailLength: 0.7,
                                    color: '#fff',
                                    symbolSize: 3
                                },
                                lineStyle: {
                                    normal: {
                                        color: color[i],
                                        width: 0,
                                        curveness: 0.2
                                    }
                                },
                                data: convertData(item[1])
                            },
                            {
                                name: item[0] + ' Top10',
                                type: 'lines',
                                zlevel: 2,
                                effect: {
                                    show: true,
                                    period: 6,
                                    trailLength: 0,
                                    //symbol: planePath,
                                    symbolSize: 5
                                },
                                lineStyle: {
                                    normal: {
                                        color: color[i],
                                        width: 1,
                                        opacity: 0.4,
                                        curveness: 0.2
                                    }
                                },
                                data: convertData(item[1])
                            },
                            {
                                name: item[0] + ' Top10',
                                type: 'effectScatter',
                                coordinateSystem: 'geo',
                                zlevel: 2,
                                rippleEffect: {
                                    brushType: 'stroke'
                                },
                                label: {
                                    normal: {
                                        show: true,
                                        position: 'right',
                                        formatter: '{b}'
                                    }
                                },
                                symbolSize: function (val) {
                                    return val[2] / 8;
                                },
                                itemStyle: {
                                    normal: {
                                        color: color[i]
                                    }
                                },
                                data: item[1].map(function (dataItem) {
                                    return {
                                        name: dataItem[1].name,
                                        value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
                                    };
                                })
                            });
                    });

                    var option = {
                        backgroundColor: '#404a59',
                        title: {
                            text: '旅行路线',
                            subtext: '数据纯属虚构',
                            left: 'center',
                            textStyle: {
                                color: '#fff'
                            }
                        },
                        tooltip: {
                            trigger: 'item'
                        },
                        legend: {
                            orient: 'vertical',
                            top: 'bottom',
                            left: 'right',
                            data: [],
                            textStyle: {
                                color: '#fff'
                            },
                            selectedMode: 'single'
                        },
                        geo: {
                            map: 'china',
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#404a59'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            }
                        },
                        series: series
                    };
                    pass.setOption(option);
                })
            }
        };
    }])
    /**
     * 司机
     */
    .directive("car", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='car' style='width: auto;height:1024px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('car');
                    height.style.height = window.screen.height - 200 + 'px';
                    var car = echarts.init(document.getElementById('car'));
                    var allData = {
                        "citys": [{
                            "name": "延寿",
                            "value": [128.331644, 45.451897, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "临江",
                            "value": [126.918087, 41.811979, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "嘉兴",
                            "value": [120.755486, 30.746129, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "四平",
                            "value": [124.350398, 43.16642, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "营口",
                            "value": [122.235418, 40.667012, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "密云",
                            "value": [116.801346, 40.35874, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "威海",
                            "value": [122.12042, 37.513068, 32],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "杭州",
                            "value": [120.15507, 30.274085, 10],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "集安",
                            "value": [126.194031, 41.125307, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "贵阳",
                            "value": [106.630154, 26.647661, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "抚顺",
                            "value": [123.957208, 41.880872, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海门",
                            "value": [121.181615, 31.871173, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "珠海",
                            "value": [113.576726, 22.270715, 9],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "河北",
                            "value": [114.475704, 38.584854, -19],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "深圳",
                            "value": [114.057868, 22.543099, 14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "黄浦",
                            "value": [121.484443, 31.231763, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "蓬莱",
                            "value": [120.758848, 37.810661, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "吉林",
                            "value": [126.549572, 43.837883, -364],
                            "symbolSize": 14,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "甘肃",
                            "value": [103.826308, 36.059421, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "龙井",
                            "value": [129.427066, 42.766311, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "茂名",
                            "value": [110.925456, 21.662999, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "丹东",
                            "value": [124.354707, 40.0005, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "晋中",
                            "value": [112.752695, 37.687024, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "浙江",
                            "value": [120.152792, 30.267447, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "海城",
                            "value": [122.685217, 40.882377, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "溆浦",
                            "value": [110.594921, 27.908281, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "北京",
                            "value": [116.407526, 39.90403, -14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "铁岭",
                            "value": [123.726166, 42.223769, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "大同",
                            "value": [113.61244, 40.040295, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "金坛",
                            "value": [119.597897, 31.723247, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "齐齐哈尔",
                            "value": [126.661669, 45.742347, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "咸阳",
                            "value": [108.708991, 34.329605, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "四川",
                            "value": [104.075931, 30.651652, -5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "福田",
                            "value": [114.055036, 22.52153, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "盘锦",
                            "value": [122.070714, 41.119997, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "中山",
                            "value": [113.392782, 22.517646, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "福建",
                            "value": [119.295144, 26.10078, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "泰顺",
                            "value": [119.717649, 27.556884, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "宝山",
                            "value": [131.401589, 46.577167, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "庆安",
                            "value": [127.507825, 46.880102, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海淀",
                            "value": [116.298056, 39.959912, 32],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "大兴",
                            "value": [116.341395, 39.726929, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "桦川",
                            "value": [130.719081, 47.023001, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "惠州",
                            "value": [114.416196, 23.111847, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "青岛",
                            "value": [120.38264, 36.067082, 52],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "朝阳",
                            "value": [116.443108, 39.92147, 17],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "沈阳",
                            "value": [123.431475, 41.805698, 41],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "菏泽",
                            "value": [115.480656, 35.23375, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南通",
                            "value": [120.894291, 31.980172, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南充",
                            "value": [106.110698, 30.837793, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "双城",
                            "value": [126.312745, 45.383263, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南京",
                            "value": [118.796877, 32.060255, 17],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "新疆",
                            "value": [87.627704, 43.793026, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "成都",
                            "value": [104.066541, 30.572269, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "陕西",
                            "value": [108.954239, 34.265472, -2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "黄岛",
                            "value": [120.04619, 35.872664, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "温州",
                            "value": [120.699367, 27.994267, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "石家庄",
                            "value": [114.51486, 38.042307, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "邢台",
                            "value": [114.504844, 37.070589, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "赣州",
                            "value": [114.93503, 25.831829, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "义乌",
                            "value": [120.075058, 29.306841, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "南昌",
                            "value": [115.858198, 28.682892, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "闵行",
                            "value": [121.381709, 31.112813, 18],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "长宁",
                            "value": [121.424624, 31.220367, 7],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "道里",
                            "value": [126.616957, 45.755777, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "乳山",
                            "value": [121.539765, 36.919816, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "双流",
                            "value": [103.923648, 30.574473, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "广州",
                            "value": [113.264435, 23.129163, 13],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "西城",
                            "value": [116.365868, 39.912289, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "佳木斯",
                            "value": [130.318917, 46.799923, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "皇姑",
                            "value": [123.44197, 41.824796, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "榆树",
                            "value": [126.533146, 44.840288, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "临汾",
                            "value": [111.518976, 36.088005, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "上海",
                            "value": [121.473701, 31.230416, 44],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "内蒙古",
                            "value": [111.765618, 40.817498, -23],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "尚志",
                            "value": [128.009895, 45.209586, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "湖里",
                            "value": [118.146769, 24.512905, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "台州",
                            "value": [121.420757, 28.656386, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "潍坊",
                            "value": [119.161756, 36.706774, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "苏州",
                            "value": [120.585316, 31.298886, 14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "房山",
                            "value": [116.143267, 39.749144, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "即墨",
                            "value": [120.447128, 36.389639, 15],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "舒兰",
                            "value": [126.965607, 44.406106, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "延吉",
                            "value": [129.508946, 42.891255, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "三河",
                            "value": [117.078295, 39.982718, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "大连",
                            "value": [121.614682, 38.914003, 40],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "辉南",
                            "value": [126.046912, 42.684993, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "无锡",
                            "value": [120.31191, 31.49117, 14],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "常州",
                            "value": [119.973987, 31.810689, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "广西",
                            "value": [108.327546, 22.815478, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "泉州",
                            "value": [118.675676, 24.874132, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "昌平",
                            "value": [116.231204, 40.22066, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海阳",
                            "value": [121.158434, 36.776378, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "郑州",
                            "value": [113.625368, 34.7466, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "东城",
                            "value": [116.416357, 39.928353, 10],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "黄骅",
                            "value": [117.330048, 38.371383, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "武侯",
                            "value": [104.04339, 30.641982, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "鸡东",
                            "value": [131.12408, 45.260412, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "龙口",
                            "value": [120.477813, 37.646108, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "汤原",
                            "value": [129.905072, 46.730706, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "湖北",
                            "value": [114.341862, 30.546498, -4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "克拉玛依",
                            "value": [84.889207, 45.579889, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "厦门",
                            "value": [118.089425, 24.479834, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "哈尔滨",
                            "value": [126.534967, 45.803775, 8],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "秦皇岛",
                            "value": [119.600493, 39.935385, 7],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "江苏",
                            "value": [118.763232, 32.061707, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "常熟",
                            "value": [120.752481, 31.654376, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "烟台",
                            "value": [121.447935, 37.463822, 24],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "和平",
                            "value": [117.21451, 39.116949, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "环翠",
                            "value": [122.123444, 37.501991, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "宣武门外东大街",
                            "value": [116.378888, 39.899332, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "张家港",
                            "value": [120.553284, 31.870367, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "临安",
                            "value": [119.724733, 30.233873, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "延安",
                            "value": [109.489727, 36.585455, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "天津",
                            "value": [117.200983, 39.084158, 28],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "城阳",
                            "value": [120.39631, 36.307064, 15],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "石景山",
                            "value": [116.222982, 39.906611, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "长沙",
                            "value": [112.938814, 28.228209, 5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "安徽",
                            "value": [117.284923, 31.861184, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "昆山",
                            "value": [120.980737, 31.385598, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "徐汇",
                            "value": [121.436525, 31.188523, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "东港",
                            "value": [124.152705, 39.863008, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "廊坊",
                            "value": [116.683752, 39.538047, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "鞍山",
                            "value": [122.994329, 41.108647, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "海陵",
                            "value": [119.919425, 32.491016, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "黑龙江",
                            "value": [126.661669, 45.742347, -198],
                            "symbolSize": 8,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "西藏",
                            "value": [91.117212, 29.646923, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "河南",
                            "value": [113.274379, 34.445122, 0],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "湖南",
                            "value": [112.98381, 28.112444, -1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "佛山",
                            "value": [113.121416, 23.021548, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "珲春",
                            "value": [130.366036, 42.862821, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "扬州",
                            "value": [119.412966, 32.39421, 5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "日照",
                            "value": [119.526888, 35.416377, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "唐山",
                            "value": [118.180194, 39.630867, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "同江",
                            "value": [132.510919, 47.642707, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "荣成",
                            "value": [122.486658, 37.16516, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "虎林",
                            "value": [132.93721, 45.762686, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "武汉",
                            "value": [114.305393, 30.593099, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "合肥",
                            "value": [117.227239, 31.820587, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "荆州",
                            "value": [112.239741, 30.335165, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "丰台",
                            "value": [116.287149, 39.858427, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "山东",
                            "value": [117.020359, 36.66853, -6],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "舟山",
                            "value": [122.207216, 29.985295, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "连云港",
                            "value": [119.221611, 34.596653, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "西安",
                            "value": [108.940175, 34.341568, 3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "济南",
                            "value": [117.12, 36.651216, 4],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "绵阳",
                            "value": [104.679114, 31.46745, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "辽宁",
                            "value": [123.42944, 41.835441, -58],
                            "symbolSize": 3,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "山西",
                            "value": [112.562398, 37.873532, -3],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#58B3CC"}}
                        }, {
                            "name": "呼和浩特",
                            "value": [111.749181, 40.842585, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "河西",
                            "value": [117.223372, 39.109563, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "兴和",
                            "value": [113.834173, 40.872301, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "重庆",
                            "value": [106.551557, 29.56301, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "胶州",
                            "value": [120.033382, 36.26468, 5],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "宁波",
                            "value": [121.550357, 29.874557, 10],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "滨海",
                            "value": [119.820831, 33.990334, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "太原",
                            "value": [112.548879, 37.87059, 2],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "鸡西",
                            "value": [130.969333, 45.295075, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "兰山",
                            "value": [118.347707, 35.051729, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "阳泉",
                            "value": [113.580519, 37.856972, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "勃利",
                            "value": [130.592171, 45.755063, 1],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }, {
                            "name": "长春",
                            "value": [125.323544, 43.817072, 8],
                            "symbolSize": 2,
                            "itemStyle": {"normal": {"color": "#F58158"}}
                        }],
                        "moveLines": [{
                            "fromName": "黑龙江",
                            "toName": "珠海",
                            "coords": [[126.661669, 45.742347], [113.576726, 22.270715]]
                        }, {"fromName": "黑龙江", "toName": "舒兰", "coords": [[126.661669, 45.742347], [126.965607, 44.406106]]}, {
                            "fromName": "黑龙江",
                            "toName": "大连",
                            "coords": [[126.661669, 45.742347], [121.614682, 38.914003]]
                        }, {"fromName": "辽宁", "toName": "集安", "coords": [[123.42944, 41.835441], [126.194031, 41.125307]]}, {
                            "fromName": "吉林",
                            "toName": "抚顺",
                            "coords": [[126.549572, 43.837883], [123.957208, 41.880872]]
                        }, {"fromName": "山东", "toName": "南京", "coords": [[117.020359, 36.66853], [118.796877, 32.060255]]}, {
                            "fromName": "北京",
                            "toName": "沈阳",
                            "coords": [[116.407526, 39.90403], [123.431475, 41.805698]]
                        }, {"fromName": "黑龙江", "toName": "环翠", "coords": [[126.661669, 45.742347], [122.123444, 37.501991]]}, {
                            "fromName": "天津",
                            "toName": "大连",
                            "coords": [[117.200983, 39.084158], [121.614682, 38.914003]]
                        }, {"fromName": "吉林", "toName": "兴和", "coords": [[126.549572, 43.837883], [113.834173, 40.872301]]}, {
                            "fromName": "河北",
                            "toName": "勃利",
                            "coords": [[114.475704, 38.584854], [130.592171, 45.755063]]
                        }, {"fromName": "吉林", "toName": "大连", "coords": [[126.549572, 43.837883], [121.614682, 38.914003]]}, {
                            "fromName": "吉林",
                            "toName": "沈阳",
                            "coords": [[126.549572, 43.837883], [123.431475, 41.805698]]
                        }, {"fromName": "黑龙江", "toName": "闵行", "coords": [[126.661669, 45.742347], [121.381709, 31.112813]]}, {
                            "fromName": "天津",
                            "toName": "朝阳",
                            "coords": [[117.200983, 39.084158], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "黄岛", "coords": [[126.549572, 43.837883], [120.04619, 35.872664]]}, {
                            "fromName": "内蒙古",
                            "toName": "上海",
                            "coords": [[111.765618, 40.817498], [121.473701, 31.230416]]
                        }, {"fromName": "内蒙古", "toName": "南京", "coords": [[111.765618, 40.817498], [118.796877, 32.060255]]}, {
                            "fromName": "辽宁",
                            "toName": "杭州",
                            "coords": [[123.42944, 41.835441], [120.15507, 30.274085]]
                        }, {"fromName": "黑龙江", "toName": "海城", "coords": [[126.661669, 45.742347], [122.685217, 40.882377]]}, {
                            "fromName": "吉林",
                            "toName": "西城",
                            "coords": [[126.549572, 43.837883], [116.365868, 39.912289]]
                        }, {"fromName": "四川", "toName": "上海", "coords": [[104.075931, 30.651652], [121.473701, 31.230416]]}, {
                            "fromName": "黑龙江",
                            "toName": "西城",
                            "coords": [[126.661669, 45.742347], [116.365868, 39.912289]]
                        }, {"fromName": "吉林", "toName": "丹东", "coords": [[126.549572, 43.837883], [124.354707, 40.0005]]}, {
                            "fromName": "吉林",
                            "toName": "宁波",
                            "coords": [[126.549572, 43.837883], [121.550357, 29.874557]]
                        }, {"fromName": "辽宁", "toName": "海淀", "coords": [[123.42944, 41.835441], [116.298056, 39.959912]]}, {
                            "fromName": "辽宁",
                            "toName": "青岛",
                            "coords": [[123.42944, 41.835441], [120.38264, 36.067082]]
                        }, {"fromName": "吉林", "toName": "苏州", "coords": [[126.549572, 43.837883], [120.585316, 31.298886]]}, {
                            "fromName": "黑龙江",
                            "toName": "抚顺",
                            "coords": [[126.661669, 45.742347], [123.957208, 41.880872]]
                        }, {"fromName": "吉林", "toName": "临安", "coords": [[126.549572, 43.837883], [119.724733, 30.233873]]}, {
                            "fromName": "辽宁",
                            "toName": "烟台",
                            "coords": [[123.42944, 41.835441], [121.447935, 37.463822]]
                        }, {"fromName": "黑龙江", "toName": "海淀", "coords": [[126.661669, 45.742347], [116.298056, 39.959912]]}, {
                            "fromName": "黑龙江",
                            "toName": "南昌",
                            "coords": [[126.661669, 45.742347], [115.858198, 28.682892]]
                        }, {"fromName": "内蒙古", "toName": "沈阳", "coords": [[111.765618, 40.817498], [123.431475, 41.805698]]}, {
                            "fromName": "山西",
                            "toName": "城阳",
                            "coords": [[112.562398, 37.873532], [120.39631, 36.307064]]
                        }, {"fromName": "吉林", "toName": "广州", "coords": [[126.549572, 43.837883], [113.264435, 23.129163]]}, {
                            "fromName": "上海",
                            "toName": "沈阳",
                            "coords": [[121.473701, 31.230416], [123.431475, 41.805698]]
                        }, {"fromName": "四川", "toName": "阳泉", "coords": [[104.075931, 30.651652], [113.580519, 37.856972]]}, {
                            "fromName": "河北",
                            "toName": "桦川",
                            "coords": [[114.475704, 38.584854], [130.719081, 47.023001]]
                        }, {"fromName": "内蒙古", "toName": "海淀", "coords": [[111.765618, 40.817498], [116.298056, 39.959912]]}, {
                            "fromName": "安徽",
                            "toName": "河北",
                            "coords": [[117.284923, 31.861184], [114.475704, 38.584854]]
                        }, {"fromName": "辽宁", "toName": "呼和浩特", "coords": [[123.42944, 41.835441], [111.749181, 40.842585]]}, {
                            "fromName": "广西",
                            "toName": "茂名",
                            "coords": [[108.327546, 22.815478], [110.925456, 21.662999]]
                        }, {"fromName": "吉林", "toName": "东城", "coords": [[126.549572, 43.837883], [116.416357, 39.928353]]}, {
                            "fromName": "内蒙古",
                            "toName": "盘锦",
                            "coords": [[111.765618, 40.817498], [122.070714, 41.119997]]
                        }, {"fromName": "山东", "toName": "哈尔滨", "coords": [[117.020359, 36.66853], [126.534967, 45.803775]]}, {
                            "fromName": "黑龙江",
                            "toName": "沈阳",
                            "coords": [[126.661669, 45.742347], [123.431475, 41.805698]]
                        }, {"fromName": "黑龙江", "toName": "丰台", "coords": [[126.661669, 45.742347], [116.287149, 39.858427]]}, {
                            "fromName": "四川",
                            "toName": "盘锦",
                            "coords": [[104.075931, 30.651652], [122.070714, 41.119997]]
                        }, {"fromName": "黑龙江", "toName": "皇姑", "coords": [[126.661669, 45.742347], [123.44197, 41.824796]]}, {
                            "fromName": "河北",
                            "toName": "虎林",
                            "coords": [[114.475704, 38.584854], [132.93721, 45.762686]]
                        }, {"fromName": "辽宁", "toName": "宝山", "coords": [[123.42944, 41.835441], [131.401589, 46.577167]]}, {
                            "fromName": "黑龙江",
                            "toName": "吉林",
                            "coords": [[126.661669, 45.742347], [126.549572, 43.837883]]
                        }, {"fromName": "黑龙江", "toName": "青岛", "coords": [[126.661669, 45.742347], [120.38264, 36.067082]]}, {
                            "fromName": "吉林",
                            "toName": "烟台",
                            "coords": [[126.549572, 43.837883], [121.447935, 37.463822]]
                        }, {"fromName": "山东", "toName": "临江", "coords": [[117.020359, 36.66853], [126.918087, 41.811979]]}, {
                            "fromName": "黑龙江",
                            "toName": "黄岛",
                            "coords": [[126.661669, 45.742347], [120.04619, 35.872664]]
                        }, {"fromName": "吉林", "toName": "石家庄", "coords": [[126.549572, 43.837883], [114.51486, 38.042307]]}, {
                            "fromName": "吉林",
                            "toName": "汤原",
                            "coords": [[126.549572, 43.837883], [129.905072, 46.730706]]
                        }, {"fromName": "黑龙江", "toName": "临江", "coords": [[126.661669, 45.742347], [126.918087, 41.811979]]}, {
                            "fromName": "吉林",
                            "toName": "济南",
                            "coords": [[126.549572, 43.837883], [117.12, 36.651216]]
                        }, {"fromName": "吉林", "toName": "太原", "coords": [[126.549572, 43.837883], [112.548879, 37.87059]]}, {
                            "fromName": "吉林",
                            "toName": "威海",
                            "coords": [[126.549572, 43.837883], [122.12042, 37.513068]]
                        }, {"fromName": "湖北", "toName": "深圳", "coords": [[114.341862, 30.546498], [114.057868, 22.543099]]}, {
                            "fromName": "内蒙古",
                            "toName": "荣成",
                            "coords": [[111.765618, 40.817498], [122.486658, 37.16516]]
                        }, {"fromName": "辽宁", "toName": "郑州", "coords": [[123.42944, 41.835441], [113.625368, 34.7466]]}, {
                            "fromName": "黑龙江",
                            "toName": "朝阳",
                            "coords": [[126.661669, 45.742347], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "昆山", "coords": [[126.549572, 43.837883], [120.980737, 31.385598]]}, {
                            "fromName": "吉林",
                            "toName": "双城",
                            "coords": [[126.549572, 43.837883], [126.312745, 45.383263]]
                        }, {"fromName": "黑龙江", "toName": "克拉玛依", "coords": [[126.661669, 45.742347], [84.889207, 45.579889]]}, {
                            "fromName": "辽宁",
                            "toName": "上海",
                            "coords": [[123.42944, 41.835441], [121.473701, 31.230416]]
                        }, {"fromName": "吉林", "toName": "海阳", "coords": [[126.549572, 43.837883], [121.158434, 36.776378]]}, {
                            "fromName": "吉林",
                            "toName": "宣武门外东大街",
                            "coords": [[126.549572, 43.837883], [116.378888, 39.899332]]
                        }, {"fromName": "山东", "toName": "海淀", "coords": [[117.020359, 36.66853], [116.298056, 39.959912]]}, {
                            "fromName": "内蒙古",
                            "toName": "威海",
                            "coords": [[111.765618, 40.817498], [122.12042, 37.513068]]
                        }, {"fromName": "黑龙江", "toName": "晋中", "coords": [[126.661669, 45.742347], [112.752695, 37.687024]]}, {
                            "fromName": "西藏",
                            "toName": "广州",
                            "coords": [[91.117212, 29.646923], [113.264435, 23.129163]]
                        }, {"fromName": "辽宁", "toName": "无锡", "coords": [[123.42944, 41.835441], [120.31191, 31.49117]]}, {
                            "fromName": "黑龙江",
                            "toName": "城阳",
                            "coords": [[126.661669, 45.742347], [120.39631, 36.307064]]
                        }, {"fromName": "河北", "toName": "丰台", "coords": [[114.475704, 38.584854], [116.287149, 39.858427]]}, {
                            "fromName": "黑龙江",
                            "toName": "扬州",
                            "coords": [[126.661669, 45.742347], [119.412966, 32.39421]]
                        }, {"fromName": "辽宁", "toName": "天津", "coords": [[123.42944, 41.835441], [117.200983, 39.084158]]}, {
                            "fromName": "吉林",
                            "toName": "扬州",
                            "coords": [[126.549572, 43.837883], [119.412966, 32.39421]]
                        }, {"fromName": "吉林", "toName": "嘉兴", "coords": [[126.549572, 43.837883], [120.755486, 30.746129]]}, {
                            "fromName": "河北",
                            "toName": "延寿",
                            "coords": [[114.475704, 38.584854], [128.331644, 45.451897]]
                        }, {"fromName": "吉林", "toName": "义乌", "coords": [[126.549572, 43.837883], [120.075058, 29.306841]]}, {
                            "fromName": "吉林",
                            "toName": "张家港",
                            "coords": [[126.549572, 43.837883], [120.553284, 31.870367]]
                        }, {"fromName": "辽宁", "toName": "贵阳", "coords": [[123.42944, 41.835441], [106.630154, 26.647661]]}, {
                            "fromName": "吉林",
                            "toName": "辽宁",
                            "coords": [[126.549572, 43.837883], [123.42944, 41.835441]]
                        }, {"fromName": "河南", "toName": "营口", "coords": [[113.274379, 34.445122], [122.235418, 40.667012]]}, {
                            "fromName": "吉林",
                            "toName": "合肥",
                            "coords": [[126.549572, 43.837883], [117.227239, 31.820587]]
                        }, {"fromName": "黑龙江", "toName": "苏州", "coords": [[126.661669, 45.742347], [120.585316, 31.298886]]}, {
                            "fromName": "黑龙江",
                            "toName": "榆树",
                            "coords": [[126.661669, 45.742347], [126.533146, 44.840288]]
                        }, {"fromName": "吉林", "toName": "常熟", "coords": [[126.549572, 43.837883], [120.752481, 31.654376]]}, {
                            "fromName": "吉林",
                            "toName": "乳山",
                            "coords": [[126.549572, 43.837883], [121.539765, 36.919816]]
                        }, {"fromName": "四川", "toName": "青岛", "coords": [[104.075931, 30.651652], [120.38264, 36.067082]]}, {
                            "fromName": "黑龙江",
                            "toName": "深圳",
                            "coords": [[126.661669, 45.742347], [114.057868, 22.543099]]
                        }, {"fromName": "天津", "toName": "东城", "coords": [[117.200983, 39.084158], [116.416357, 39.928353]]}, {
                            "fromName": "黑龙江",
                            "toName": "上海",
                            "coords": [[126.661669, 45.742347], [121.473701, 31.230416]]
                        }, {"fromName": "天津", "toName": "宁波", "coords": [[117.200983, 39.084158], [121.550357, 29.874557]]}, {
                            "fromName": "吉林",
                            "toName": "海门",
                            "coords": [[126.549572, 43.837883], [121.181615, 31.871173]]
                        }, {"fromName": "山西", "toName": "沈阳", "coords": [[112.562398, 37.873532], [123.431475, 41.805698]]}, {
                            "fromName": "吉林",
                            "toName": "成都",
                            "coords": [[126.549572, 43.837883], [104.066541, 30.572269]]
                        }, {"fromName": "吉林", "toName": "南昌", "coords": [[126.549572, 43.837883], [115.858198, 28.682892]]}, {
                            "fromName": "黑龙江",
                            "toName": "常州",
                            "coords": [[126.661669, 45.742347], [119.973987, 31.810689]]
                        }, {"fromName": "内蒙古", "toName": "兰山", "coords": [[111.765618, 40.817498], [118.347707, 35.051729]]}, {
                            "fromName": "吉林",
                            "toName": "河南",
                            "coords": [[126.549572, 43.837883], [113.274379, 34.445122]]
                        }, {"fromName": "黑龙江", "toName": "福田", "coords": [[126.661669, 45.742347], [114.055036, 22.52153]]}, {
                            "fromName": "吉林",
                            "toName": "常州",
                            "coords": [[126.549572, 43.837883], [119.973987, 31.810689]]
                        }, {"fromName": "吉林", "toName": "双流", "coords": [[126.549572, 43.837883], [103.923648, 30.574473]]}, {
                            "fromName": "吉林",
                            "toName": "潍坊",
                            "coords": [[126.549572, 43.837883], [119.161756, 36.706774]]
                        }, {"fromName": "吉林", "toName": "延安", "coords": [[126.549572, 43.837883], [109.489727, 36.585455]]}, {
                            "fromName": "辽宁",
                            "toName": "长春",
                            "coords": [[123.42944, 41.835441], [125.323544, 43.817072]]
                        }, {"fromName": "黑龙江", "toName": "南京", "coords": [[126.661669, 45.742347], [118.796877, 32.060255]]}, {
                            "fromName": "辽宁",
                            "toName": "和平",
                            "coords": [[123.42944, 41.835441], [117.21451, 39.116949]]
                        }, {"fromName": "北京", "toName": "哈尔滨", "coords": [[116.407526, 39.90403], [126.534967, 45.803775]]}, {
                            "fromName": "吉林",
                            "toName": "武汉",
                            "coords": [[126.549572, 43.837883], [114.305393, 30.593099]]
                        }, {"fromName": "吉林", "toName": "海陵", "coords": [[126.549572, 43.837883], [119.919425, 32.491016]]}, {
                            "fromName": "吉林",
                            "toName": "日照",
                            "coords": [[126.549572, 43.837883], [119.526888, 35.416377]]
                        }, {"fromName": "吉林", "toName": "台州", "coords": [[126.549572, 43.837883], [121.420757, 28.656386]]}, {
                            "fromName": "辽宁",
                            "toName": "厦门",
                            "coords": [[123.42944, 41.835441], [118.089425, 24.479834]]
                        }, {"fromName": "黑龙江", "toName": "贵阳", "coords": [[126.661669, 45.742347], [106.630154, 26.647661]]}, {
                            "fromName": "吉林",
                            "toName": "鞍山",
                            "coords": [[126.549572, 43.837883], [122.994329, 41.108647]]
                        }, {"fromName": "辽宁", "toName": "荣成", "coords": [[123.42944, 41.835441], [122.486658, 37.16516]]}, {
                            "fromName": "黑龙江",
                            "toName": "天津",
                            "coords": [[126.661669, 45.742347], [117.200983, 39.084158]]
                        }, {"fromName": "黑龙江", "toName": "河西", "coords": [[126.661669, 45.742347], [117.223372, 39.109563]]}, {
                            "fromName": "黑龙江",
                            "toName": "秦皇岛",
                            "coords": [[126.661669, 45.742347], [119.600493, 39.935385]]
                        }, {"fromName": "吉林", "toName": "荆州", "coords": [[126.549572, 43.837883], [112.239741, 30.335165]]}, {
                            "fromName": "黑龙江",
                            "toName": "东城",
                            "coords": [[126.661669, 45.742347], [116.416357, 39.928353]]
                        }, {"fromName": "吉林", "toName": "即墨", "coords": [[126.549572, 43.837883], [120.447128, 36.389639]]}, {
                            "fromName": "辽宁",
                            "toName": "西城",
                            "coords": [[123.42944, 41.835441], [116.365868, 39.912289]]
                        }, {"fromName": "黑龙江", "toName": "大兴", "coords": [[126.661669, 45.742347], [116.341395, 39.726929]]}, {
                            "fromName": "河北",
                            "toName": "哈尔滨",
                            "coords": [[114.475704, 38.584854], [126.534967, 45.803775]]
                        }, {"fromName": "黑龙江", "toName": "江苏", "coords": [[126.661669, 45.742347], [118.763232, 32.061707]]}, {
                            "fromName": "吉林",
                            "toName": "和平",
                            "coords": [[126.549572, 43.837883], [117.21451, 39.116949]]
                        }, {"fromName": "江苏", "toName": "鸡东", "coords": [[118.763232, 32.061707], [131.12408, 45.260412]]}, {
                            "fromName": "辽宁",
                            "toName": "辉南",
                            "coords": [[123.42944, 41.835441], [126.046912, 42.684993]]
                        }, {"fromName": "吉林", "toName": "深圳", "coords": [[126.549572, 43.837883], [114.057868, 22.543099]]}, {
                            "fromName": "福建",
                            "toName": "泰顺",
                            "coords": [[119.295144, 26.10078], [119.717649, 27.556884]]
                        }, {"fromName": "上海", "toName": "深圳", "coords": [[121.473701, 31.230416], [114.057868, 22.543099]]}, {
                            "fromName": "吉林",
                            "toName": "秦皇岛",
                            "coords": [[126.549572, 43.837883], [119.600493, 39.935385]]
                        }, {"fromName": "吉林", "toName": "徐汇", "coords": [[126.549572, 43.837883], [121.436525, 31.188523]]}, {
                            "fromName": "吉林",
                            "toName": "石景山",
                            "coords": [[126.549572, 43.837883], [116.222982, 39.906611]]
                        }, {"fromName": "辽宁", "toName": "城阳", "coords": [[123.42944, 41.835441], [120.39631, 36.307064]]}, {
                            "fromName": "黑龙江",
                            "toName": "威海",
                            "coords": [[126.661669, 45.742347], [122.12042, 37.513068]]
                        }, {"fromName": "黑龙江", "toName": "惠州", "coords": [[126.661669, 45.742347], [114.416196, 23.111847]]}, {
                            "fromName": "吉林",
                            "toName": "龙口",
                            "coords": [[126.549572, 43.837883], [120.477813, 37.646108]]
                        }, {"fromName": "黑龙江", "toName": "四平", "coords": [[126.661669, 45.742347], [124.350398, 43.16642]]}, {
                            "fromName": "吉林",
                            "toName": "南充",
                            "coords": [[126.549572, 43.837883], [106.110698, 30.837793]]
                        }, {"fromName": "河北", "toName": "东港", "coords": [[114.475704, 38.584854], [124.152705, 39.863008]]}, {
                            "fromName": "辽宁",
                            "toName": "西安",
                            "coords": [[123.42944, 41.835441], [108.940175, 34.341568]]
                        }, {"fromName": "内蒙古", "toName": "滨海", "coords": [[111.765618, 40.817498], [119.820831, 33.990334]]}, {
                            "fromName": "河南",
                            "toName": "青岛",
                            "coords": [[113.274379, 34.445122], [120.38264, 36.067082]]
                        }, {"fromName": "黑龙江", "toName": "昆山", "coords": [[126.661669, 45.742347], [120.980737, 31.385598]]}, {
                            "fromName": "辽宁",
                            "toName": "长沙",
                            "coords": [[123.42944, 41.835441], [112.938814, 28.228209]]
                        }, {"fromName": "吉林", "toName": "哈尔滨", "coords": [[126.549572, 43.837883], [126.534967, 45.803775]]}, {
                            "fromName": "河北",
                            "toName": "尚志",
                            "coords": [[114.475704, 38.584854], [128.009895, 45.209586]]
                        }, {"fromName": "辽宁", "toName": "东城", "coords": [[123.42944, 41.835441], [116.416357, 39.928353]]}, {
                            "fromName": "辽宁",
                            "toName": "珠海",
                            "coords": [[123.42944, 41.835441], [113.576726, 22.270715]]
                        }, {"fromName": "黑龙江", "toName": "铁岭", "coords": [[126.661669, 45.742347], [123.726166, 42.223769]]}, {
                            "fromName": "黑龙江",
                            "toName": "蓬莱",
                            "coords": [[126.661669, 45.742347], [120.758848, 37.810661]]
                        }, {"fromName": "北京", "toName": "天津", "coords": [[116.407526, 39.90403], [117.200983, 39.084158]]}, {
                            "fromName": "内蒙古",
                            "toName": "天津",
                            "coords": [[111.765618, 40.817498], [117.200983, 39.084158]]
                        }, {"fromName": "黑龙江", "toName": "宁波", "coords": [[126.661669, 45.742347], [121.550357, 29.874557]]}, {
                            "fromName": "吉林",
                            "toName": "上海",
                            "coords": [[126.549572, 43.837883], [121.473701, 31.230416]]
                        }, {"fromName": "辽宁", "toName": "佛山", "coords": [[123.42944, 41.835441], [113.121416, 23.021548]]}, {
                            "fromName": "吉林",
                            "toName": "长宁",
                            "coords": [[126.549572, 43.837883], [121.424624, 31.220367]]
                        }, {"fromName": "黑龙江", "toName": "珲春", "coords": [[126.661669, 45.742347], [130.366036, 42.862821]]}, {
                            "fromName": "山东",
                            "toName": "黄浦",
                            "coords": [[117.020359, 36.66853], [121.484443, 31.231763]]
                        }, {"fromName": "辽宁", "toName": "威海", "coords": [[123.42944, 41.835441], [122.12042, 37.513068]]}, {
                            "fromName": "天津",
                            "toName": "长春",
                            "coords": [[117.200983, 39.084158], [125.323544, 43.817072]]
                        }, {"fromName": "新疆", "toName": "上海", "coords": [[87.627704, 43.793026], [121.473701, 31.230416]]}, {
                            "fromName": "河北",
                            "toName": "鸡西",
                            "coords": [[114.475704, 38.584854], [130.969333, 45.295075]]
                        }, {"fromName": "陕西", "toName": "呼和浩特", "coords": [[108.954239, 34.265472], [111.749181, 40.842585]]}, {
                            "fromName": "吉林",
                            "toName": "连云港",
                            "coords": [[126.549572, 43.837883], [119.221611, 34.596653]]
                        }, {"fromName": "黑龙江", "toName": "杭州", "coords": [[126.661669, 45.742347], [120.15507, 30.274085]]}, {
                            "fromName": "黑龙江",
                            "toName": "嘉兴",
                            "coords": [[126.661669, 45.742347], [120.755486, 30.746129]]
                        }, {"fromName": "陕西", "toName": "盘锦", "coords": [[108.954239, 34.265472], [122.070714, 41.119997]]}, {
                            "fromName": "河北",
                            "toName": "同江",
                            "coords": [[114.475704, 38.584854], [132.510919, 47.642707]]
                        }, {"fromName": "吉林", "toName": "杭州", "coords": [[126.549572, 43.837883], [120.15507, 30.274085]]}, {
                            "fromName": "黑龙江",
                            "toName": "舟山",
                            "coords": [[126.661669, 45.742347], [122.207216, 29.985295]]
                        }, {"fromName": "河南", "toName": "大连", "coords": [[113.274379, 34.445122], [121.614682, 38.914003]]}, {
                            "fromName": "辽宁",
                            "toName": "绵阳",
                            "coords": [[123.42944, 41.835441], [104.679114, 31.46745]]
                        }, {"fromName": "吉林", "toName": "溆浦", "coords": [[126.549572, 43.837883], [110.594921, 27.908281]]}, {
                            "fromName": "吉林",
                            "toName": "朝阳",
                            "coords": [[126.549572, 43.837883], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "无锡", "coords": [[126.549572, 43.837883], [120.31191, 31.49117]]}, {
                            "fromName": "浙江",
                            "toName": "沈阳",
                            "coords": [[120.152792, 30.267447], [123.431475, 41.805698]]
                        }, {"fromName": "吉林", "toName": "湖里", "coords": [[126.549572, 43.837883], [118.146769, 24.512905]]}, {
                            "fromName": "黑龙江",
                            "toName": "无锡",
                            "coords": [[126.661669, 45.742347], [120.31191, 31.49117]]
                        }, {"fromName": "黑龙江", "toName": "长宁", "coords": [[126.661669, 45.742347], [121.424624, 31.220367]]}, {
                            "fromName": "辽宁",
                            "toName": "胶州",
                            "coords": [[123.42944, 41.835441], [120.033382, 36.26468]]
                        }, {"fromName": "吉林", "toName": "青岛", "coords": [[126.549572, 43.837883], [120.38264, 36.067082]]}, {
                            "fromName": "河北",
                            "toName": "海淀",
                            "coords": [[114.475704, 38.584854], [116.298056, 39.959912]]
                        }, {"fromName": "黑龙江", "toName": "厦门", "coords": [[126.661669, 45.742347], [118.089425, 24.479834]]}, {
                            "fromName": "黑龙江",
                            "toName": "中山",
                            "coords": [[126.661669, 45.742347], [113.392782, 22.517646]]
                        }, {"fromName": "河北", "toName": "太原", "coords": [[114.475704, 38.584854], [112.548879, 37.87059]]}, {
                            "fromName": "新疆",
                            "toName": "吉林",
                            "coords": [[87.627704, 43.793026], [126.549572, 43.837883]]
                        }, {"fromName": "吉林", "toName": "武侯", "coords": [[126.549572, 43.837883], [104.04339, 30.641982]]}, {
                            "fromName": "北京",
                            "toName": "廊坊",
                            "coords": [[116.407526, 39.90403], [116.683752, 39.538047]]
                        }, {"fromName": "浙江", "toName": "临汾", "coords": [[120.152792, 30.267447], [111.518976, 36.088005]]}, {
                            "fromName": "湖北",
                            "toName": "天津",
                            "coords": [[114.341862, 30.546498], [117.200983, 39.084158]]
                        }, {"fromName": "黑龙江", "toName": "泉州", "coords": [[126.661669, 45.742347], [118.675676, 24.874132]]}, {
                            "fromName": "黑龙江",
                            "toName": "温州",
                            "coords": [[126.661669, 45.742347], [120.699367, 27.994267]]
                        }, {"fromName": "黑龙江", "toName": "唐山", "coords": [[126.661669, 45.742347], [118.180194, 39.630867]]}, {
                            "fromName": "北京",
                            "toName": "铁岭",
                            "coords": [[116.407526, 39.90403], [123.726166, 42.223769]]
                        }, {"fromName": "辽宁", "toName": "即墨", "coords": [[123.42944, 41.835441], [120.447128, 36.389639]]}, {
                            "fromName": "北京",
                            "toName": "上海",
                            "coords": [[116.407526, 39.90403], [121.473701, 31.230416]]
                        }, {"fromName": "黑龙江", "toName": "广州", "coords": [[126.661669, 45.742347], [113.264435, 23.129163]]}, {
                            "fromName": "吉林",
                            "toName": "廊坊",
                            "coords": [[126.549572, 43.837883], [116.683752, 39.538047]]
                        }, {"fromName": "黑龙江", "toName": "荣成", "coords": [[126.661669, 45.742347], [122.486658, 37.16516]]}, {
                            "fromName": "吉林",
                            "toName": "海城",
                            "coords": [[126.549572, 43.837883], [122.685217, 40.882377]]
                        }, {"fromName": "湖南", "toName": "沈阳", "coords": [[112.98381, 28.112444], [123.431475, 41.805698]]}, {
                            "fromName": "北京",
                            "toName": "青岛",
                            "coords": [[116.407526, 39.90403], [120.38264, 36.067082]]
                        }, {"fromName": "河北", "toName": "大连", "coords": [[114.475704, 38.584854], [121.614682, 38.914003]]}, {
                            "fromName": "内蒙古",
                            "toName": "珠海",
                            "coords": [[111.765618, 40.817498], [113.576726, 22.270715]]
                        }, {"fromName": "黑龙江", "toName": "房山", "coords": [[126.661669, 45.742347], [116.143267, 39.749144]]}, {
                            "fromName": "黑龙江",
                            "toName": "金坛",
                            "coords": [[126.661669, 45.742347], [119.597897, 31.723247]]
                        }, {"fromName": "河北", "toName": "齐齐哈尔", "coords": [[114.475704, 38.584854], [126.661669, 45.742347]]}, {
                            "fromName": "吉林",
                            "toName": "大兴",
                            "coords": [[126.549572, 43.837883], [116.341395, 39.726929]]
                        }, {"fromName": "吉林", "toName": "密云", "coords": [[126.549572, 43.837883], [116.801346, 40.35874]]}, {
                            "fromName": "黑龙江",
                            "toName": "和平",
                            "coords": [[126.661669, 45.742347], [117.21451, 39.116949]]
                        }, {"fromName": "内蒙古", "toName": "龙井", "coords": [[111.765618, 40.817498], [129.427066, 42.766311]]}, {
                            "fromName": "吉林",
                            "toName": "道里",
                            "coords": [[126.549572, 43.837883], [126.616957, 45.755777]]
                        }, {"fromName": "山东", "toName": "武汉", "coords": [[117.020359, 36.66853], [114.305393, 30.593099]]}, {
                            "fromName": "甘肃",
                            "toName": "常熟",
                            "coords": [[103.826308, 36.059421], [120.752481, 31.654376]]
                        }, {"fromName": "黑龙江", "toName": "烟台", "coords": [[126.661669, 45.742347], [121.447935, 37.463822]]}, {
                            "fromName": "吉林",
                            "toName": "海淀",
                            "coords": [[126.549572, 43.837883], [116.298056, 39.959912]]
                        }, {"fromName": "黑龙江", "toName": "长沙", "coords": [[126.661669, 45.742347], [112.938814, 28.228209]]}, {
                            "fromName": "天津",
                            "toName": "石家庄",
                            "coords": [[117.200983, 39.084158], [114.51486, 38.042307]]
                        }, {"fromName": "吉林", "toName": "佛山", "coords": [[126.549572, 43.837883], [113.121416, 23.021548]]}, {
                            "fromName": "辽宁",
                            "toName": "黄骅",
                            "coords": [[123.42944, 41.835441], [117.330048, 38.371383]]
                        }, {"fromName": "内蒙古", "toName": "中山", "coords": [[111.765618, 40.817498], [113.392782, 22.517646]]}, {
                            "fromName": "黑龙江",
                            "toName": "北京",
                            "coords": [[126.661669, 45.742347], [116.407526, 39.90403]]
                        }, {"fromName": "黑龙江", "toName": "三河", "coords": [[126.661669, 45.742347], [117.078295, 39.982718]]}, {
                            "fromName": "河北",
                            "toName": "庆安",
                            "coords": [[114.475704, 38.584854], [127.507825, 46.880102]]
                        }, {"fromName": "吉林", "toName": "长沙", "coords": [[126.549572, 43.837883], [112.938814, 28.228209]]}, {
                            "fromName": "黑龙江",
                            "toName": "西安",
                            "coords": [[126.661669, 45.742347], [108.940175, 34.341568]]
                        }, {"fromName": "内蒙古", "toName": "朝阳", "coords": [[111.765618, 40.817498], [116.443108, 39.92147]]}, {
                            "fromName": "辽宁",
                            "toName": "丰台",
                            "coords": [[123.42944, 41.835441], [116.287149, 39.858427]]
                        }, {"fromName": "黑龙江", "toName": "延吉", "coords": [[126.661669, 45.742347], [129.508946, 42.891255]]}, {
                            "fromName": "黑龙江",
                            "toName": "长春",
                            "coords": [[126.661669, 45.742347], [125.323544, 43.817072]]
                        }, {"fromName": "吉林", "toName": "天津", "coords": [[126.549572, 43.837883], [117.200983, 39.084158]]}, {
                            "fromName": "吉林",
                            "toName": "昌平",
                            "coords": [[126.549572, 43.837883], [116.231204, 40.22066]]
                        }, {"fromName": "吉林", "toName": "赣州", "coords": [[126.549572, 43.837883], [114.93503, 25.831829]]}, {
                            "fromName": "吉林",
                            "toName": "厦门",
                            "coords": [[126.549572, 43.837883], [118.089425, 24.479834]]
                        }, {"fromName": "内蒙古", "toName": "秦皇岛", "coords": [[111.765618, 40.817498], [119.600493, 39.935385]]}, {
                            "fromName": "内蒙古",
                            "toName": "菏泽",
                            "coords": [[111.765618, 40.817498], [115.480656, 35.23375]]
                        }, {"fromName": "吉林", "toName": "闵行", "coords": [[126.549572, 43.837883], [121.381709, 31.112813]]}, {
                            "fromName": "辽宁",
                            "toName": "石景山",
                            "coords": [[123.42944, 41.835441], [116.222982, 39.906611]]
                        }, {"fromName": "吉林", "toName": "珠海", "coords": [[126.549572, 43.837883], [113.576726, 22.270715]]}, {
                            "fromName": "内蒙古",
                            "toName": "青岛",
                            "coords": [[111.765618, 40.817498], [120.38264, 36.067082]]
                        }, {"fromName": "北京", "toName": "海门", "coords": [[116.407526, 39.90403], [121.181615, 31.871173]]}, {
                            "fromName": "内蒙古",
                            "toName": "长春",
                            "coords": [[111.765618, 40.817498], [125.323544, 43.817072]]
                        }, {"fromName": "吉林", "toName": "城阳", "coords": [[126.549572, 43.837883], [120.39631, 36.307064]]}, {
                            "fromName": "吉林",
                            "toName": "大同",
                            "coords": [[126.549572, 43.837883], [113.61244, 40.040295]]
                        }, {"fromName": "湖北", "toName": "邢台", "coords": [[114.341862, 30.546498], [114.504844, 37.070589]]}, {
                            "fromName": "吉林",
                            "toName": "胶州",
                            "coords": [[126.549572, 43.837883], [120.033382, 36.26468]]
                        }, {"fromName": "吉林", "toName": "重庆", "coords": [[126.549572, 43.837883], [106.551557, 29.56301]]}, {
                            "fromName": "河北",
                            "toName": "佳木斯",
                            "coords": [[114.475704, 38.584854], [130.318917, 46.799923]]
                        }, {"fromName": "甘肃", "toName": "大连", "coords": [[103.826308, 36.059421], [121.614682, 38.914003]]}, {
                            "fromName": "吉林",
                            "toName": "南京",
                            "coords": [[126.549572, 43.837883], [118.796877, 32.060255]]
                        }, {"fromName": "内蒙古", "toName": "日照", "coords": [[111.765618, 40.817498], [119.526888, 35.416377]]}, {
                            "fromName": "吉林",
                            "toName": "鸡东",
                            "coords": [[126.549572, 43.837883], [131.12408, 45.260412]]
                        }, {"fromName": "黑龙江", "toName": "即墨", "coords": [[126.661669, 45.742347], [120.447128, 36.389639]]}, {
                            "fromName": "江苏",
                            "toName": "朝阳",
                            "coords": [[118.763232, 32.061707], [116.443108, 39.92147]]
                        }, {"fromName": "吉林", "toName": "南通", "coords": [[126.549572, 43.837883], [120.894291, 31.980172]]}, {
                            "fromName": "黑龙江",
                            "toName": "张家港",
                            "coords": [[126.661669, 45.742347], [120.553284, 31.870367]]
                        }, {"fromName": "吉林", "toName": "三河", "coords": [[126.549572, 43.837883], [117.078295, 39.982718]]}, {
                            "fromName": "吉林",
                            "toName": "咸阳",
                            "coords": [[126.549572, 43.837883], [108.708991, 34.329605]]
                        }, {"fromName": "吉林", "toName": "中山", "coords": [[126.549572, 43.837883], [113.392782, 22.517646]]}, {
                            "fromName": "黑龙江",
                            "toName": "胶州",
                            "coords": [[126.661669, 45.742347], [120.033382, 36.26468]]
                        }]
                    };

                    var option = {
                        backgroundColor: '#404a59',
                        title: {
                            text: '朴姓人口迁徙图',
                            left: 'center',
                            textStyle: {
                                color: '#fff'
                            }
                        },
                        legend: {
                            show: false,
                            orient: 'vertical',
                            top: 'bottom',
                            left: 'right',
                            data: ['地点', '线路'],
                            textStyle: {
                                color: '#fff'
                            }
                        },
                        geo: {
                            map: 'china',
                            label: {
                                emphasis: {
                                    show: false
                                }
                            },
                            roam: true,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#404a59'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            }
                        },
                        series: [{
                            name: '地点',
                            type: 'effectScatter',
                            coordinateSystem: 'geo',
                            zlevel: 2,
                            rippleEffect: {
                                brushType: 'stroke'
                            },
                            label: {
                                emphasis: {
                                    show: true,
                                    position: 'right',
                                    formatter: '{b}'
                                }
                            },
                            symbolSize: 2,
                            showEffectOn: 'render',
                            itemStyle: {
                                normal: {
                                    color: '#46bee9'
                                }
                            },
                            data: allData.citys
                        }, {
                            name: '线路',
                            type: 'lines',
                            coordinateSystem: 'geo',
                            zlevel: 2,
                            large: true,
                            effect: {
                                show: true,
                                constantSpeed: 30,
                                symbol: 'pin',
                                symbolSize: 3,
                                trailLength: 0,
                            },
                            lineStyle: {
                                normal: {
                                    color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                                        offset: 0, color: '#58B3CC'
                                    }, {
                                        offset: 1, color: '#F58158'
                                    }], false),
                                    width: 1,
                                    opacity: 0.2,
                                    curveness: 0.1
                                }
                            },
                            data: allData.moveLines
                        }]
                    };
                    car.setOption(option);
                })
            }
        };
    }])
    /**
     * 企业关系
     */
    .directive("relation", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='relation' style='width: auto;height:1024px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $http) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('relation');
                    height.style.height = window.screen.height - 200 + 'px';
                    var relation = echarts.init(document.getElementById('relation'));
                    relation.showLoading();
                    var json = {
                        "nodes": [{
                            "color": "#4f19c7",
                            "label": "jquery",
                            "attributes": {},
                            "y": -404.26147,
                            "x": -739.36383,
                            "id": "jquery",
                            "size": 4.7252817
                        }, {
                            "color": "#c71969",
                            "label": "backbone",
                            "attributes": {},
                            "y": -862.7517,
                            "x": -134.2215,
                            "id": "backbone",
                            "size": 6.1554675
                        }, {
                            "color": "#c71969",
                            "label": "underscore",
                            "attributes": {},
                            "y": -734.4221,
                            "x": -75.53079,
                            "id": "underscore",
                            "size": 100.0
                        }, {
                            "color": "#c71969",
                            "label": "faye",
                            "attributes": {},
                            "y": 624.50604,
                            "x": -818.97516,
                            "id": "faye",
                            "size": 0.67816025
                        }, {
                            "color": "#c71919",
                            "label": "socket.io",
                            "attributes": {},
                            "y": 120.37976,
                            "x": -710.59204,
                            "id": "socket.io",
                            "size": 19.818306
                        }, {
                            "color": "#c71969",
                            "label": "requirejs",
                            "attributes": {},
                            "y": -612.5541,
                            "x": 71.52897,
                            "id": "requirejs",
                            "size": 4.0862627
                        }, {
                            "color": "#c71969",
                            "label": "amdefine",
                            "attributes": {},
                            "y": -556.3107,
                            "x": 1202.1166,
                            "id": "amdefine",
                            "size": 2.3822114
                        }, {
                            "color": "#1984c7",
                            "label": "mongoose",
                            "attributes": {},
                            "y": 378.15536,
                            "x": -1150.2018,
                            "id": "mongoose",
                            "size": 10.81118
                        }, {
                            "color": "#c76919",
                            "label": "underscore.deferred",
                            "attributes": {},
                            "y": 477.03778,
                            "x": -127.03764,
                            "id": "underscore.deferred",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "cheerio",
                            "attributes": {},
                            "y": -404.62427,
                            "x": -338.03128,
                            "id": "cheerio",
                            "size": 8.163814
                        }, {
                            "color": "#c76919",
                            "label": "lodash",
                            "attributes": {},
                            "y": -380.16626,
                            "x": 118.30771,
                            "id": "lodash",
                            "size": 18.935852
                        }, {
                            "color": "#c71969",
                            "label": "faye-websocket",
                            "attributes": {},
                            "y": 649.6795,
                            "x": -697.4635,
                            "id": "faye-websocket",
                            "size": 1.0128845
                        }, {
                            "color": "#c71969",
                            "label": "dateformat",
                            "attributes": {},
                            "y": -531.28235,
                            "x": 381.10724,
                            "id": "dateformat",
                            "size": 3.3863845
                        }, {
                            "color": "#c79f19",
                            "label": "mkdirp",
                            "attributes": {},
                            "y": -224.0287,
                            "x": 317.77667,
                            "id": "mkdirp",
                            "size": 23.713282
                        }, {
                            "color": "#c71919",
                            "label": "express",
                            "attributes": {},
                            "y": -230.14833,
                            "x": -644.2716,
                            "id": "express",
                            "size": 49.608772
                        }, {
                            "color": "#c71919",
                            "label": "connect",
                            "attributes": {},
                            "y": 294.88266,
                            "x": -933.4234,
                            "id": "connect",
                            "size": 19.574871
                        }, {
                            "color": "#c71919",
                            "label": "consolidate",
                            "attributes": {},
                            "y": 495.22098,
                            "x": -101.796974,
                            "id": "consolidate",
                            "size": 3.0212305
                        }, {
                            "color": "#c78419",
                            "label": "hogan.js",
                            "attributes": {},
                            "y": 79.99539,
                            "x": 930.74255,
                            "id": "hogan.js",
                            "size": 3.2646663
                        }, {
                            "color": "#c719b9",
                            "label": "node-uuid",
                            "attributes": {},
                            "y": 815.4766,
                            "x": -378.0424,
                            "id": "node-uuid",
                            "size": 13.488974
                        }, {
                            "color": "#1984c7",
                            "label": "async",
                            "attributes": {},
                            "y": 41.25936,
                            "x": 157.57562,
                            "id": "async",
                            "size": 73.161194
                        }, {
                            "color": "#c719b9",
                            "label": "redis",
                            "attributes": {},
                            "y": 56.938953,
                            "x": -895.56586,
                            "id": "redis",
                            "size": 17.475237
                        }, {
                            "color": "#199fc7",
                            "label": "backoff",
                            "attributes": {},
                            "y": 810.54626,
                            "x": -275.69714,
                            "id": "backoff",
                            "size": 0.58687174
                        }, {
                            "color": "#9f19c7",
                            "label": "bytes",
                            "attributes": {},
                            "y": 380.12103,
                            "x": -1005.2705,
                            "id": "bytes",
                            "size": 0.8607372
                        }, {
                            "color": "#1984c7",
                            "label": "temp",
                            "attributes": {},
                            "y": 144.45488,
                            "x": 1057.7959,
                            "id": "temp",
                            "size": 4.0558333
                        }, {
                            "color": "#69c719",
                            "label": "mustache",
                            "attributes": {},
                            "y": -554.3333,
                            "x": -554.2029,
                            "id": "mustache",
                            "size": 3.7819674
                        }, {
                            "color": "#8419c7",
                            "label": "request",
                            "attributes": {},
                            "y": 241.89249,
                            "x": -147.57906,
                            "id": "request",
                            "size": 64.54965
                        }, {
                            "color": "#c71969",
                            "label": "underscore.string",
                            "attributes": {},
                            "y": -528.7333,
                            "x": 58.392773,
                            "id": "underscore.string",
                            "size": 7.311788
                        }, {
                            "color": "#c71969",
                            "label": "jquery-browserify",
                            "attributes": {},
                            "y": 385.31375,
                            "x": -231.44426,
                            "id": "jquery-browserify",
                            "size": 0.83030766
                        }, {
                            "color": "#8419c7",
                            "label": "event-stream",
                            "attributes": {},
                            "y": 858.8598,
                            "x": 313.5104,
                            "id": "event-stream",
                            "size": 3.0212305
                        }, {
                            "color": "#19c719",
                            "label": "log4js",
                            "attributes": {},
                            "y": 350.19534,
                            "x": 7.309183,
                            "id": "log4js",
                            "size": 3.4776726
                        }, {
                            "color": "#19c719",
                            "label": "optimist",
                            "attributes": {},
                            "y": 171.80579,
                            "x": 599.53815,
                            "id": "optimist",
                            "size": 48.6046
                        }, {
                            "color": "#1919c7",
                            "label": "mocha",
                            "attributes": {},
                            "y": -178.11076,
                            "x": -393.3754,
                            "id": "mocha",
                            "size": 7.889948
                        }, {
                            "color": "#1984c7",
                            "label": "should",
                            "attributes": {},
                            "y": -198.63869,
                            "x": -334.43466,
                            "id": "should",
                            "size": 4.7252817
                        }, {
                            "color": "#c79f19",
                            "label": "semver",
                            "attributes": {},
                            "y": 375.80014,
                            "x": 414.43912,
                            "id": "semver",
                            "size": 8.711545
                        }, {
                            "color": "#69c719",
                            "label": "q",
                            "attributes": {},
                            "y": -389.02567,
                            "x": -423.78125,
                            "id": "q",
                            "size": 12.54566
                        }, {
                            "color": "#c74f19",
                            "label": "node-fs",
                            "attributes": {},
                            "y": -94.528114,
                            "x": -319.42093,
                            "id": "node-fs",
                            "size": 1.225891
                        }, {
                            "color": "#19c7b9",
                            "label": "colorize",
                            "attributes": {},
                            "y": -432.71243,
                            "x": 37.15866,
                            "id": "colorize",
                            "size": 0.55644226
                        }, {
                            "color": "#c76919",
                            "label": "github",
                            "attributes": {},
                            "y": 244.62839,
                            "x": -383.83453,
                            "id": "github",
                            "size": 1.6519039
                        }, {
                            "color": "#19c719",
                            "label": "prompt",
                            "attributes": {},
                            "y": 819.16583,
                            "x": 748.4038,
                            "id": "prompt",
                            "size": 4.1471214
                        }, {
                            "color": "#19c719",
                            "label": "colors",
                            "attributes": {},
                            "y": -265.6326,
                            "x": 694.03375,
                            "id": "colors",
                            "size": 33.359425
                        }, {
                            "color": "#19c7b9",
                            "label": "commander",
                            "attributes": {},
                            "y": -682.1726,
                            "x": -479.44443,
                            "id": "commander",
                            "size": 43.21858
                        }, {
                            "color": "#9fc719",
                            "label": "validator",
                            "attributes": {},
                            "y": -429.05365,
                            "x": -668.0554,
                            "id": "validator",
                            "size": 3.6602497
                        }, {
                            "color": "#c7b919",
                            "label": "grunt",
                            "attributes": {},
                            "y": -710.3381,
                            "x": 683.8534,
                            "id": "grunt",
                            "size": 9.959153
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-clean",
                            "attributes": {},
                            "y": -386.1587,
                            "x": -292.83875,
                            "id": "grunt-contrib-clean",
                            "size": 1.0128845
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-concat",
                            "attributes": {},
                            "y": 224.41283,
                            "x": 99.38902,
                            "id": "grunt-contrib-concat",
                            "size": 0.76944876
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-less",
                            "attributes": {},
                            "y": -611.3146,
                            "x": -215.58498,
                            "id": "grunt-contrib-less",
                            "size": 0.6173013
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-jshint",
                            "attributes": {},
                            "y": -938.3397,
                            "x": 548.61926,
                            "id": "grunt-contrib-jshint",
                            "size": 1.3171794
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-uglify",
                            "attributes": {},
                            "y": -871.8892,
                            "x": 160.96982,
                            "id": "grunt-contrib-uglify",
                            "size": 1.1346025
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-watch",
                            "attributes": {},
                            "y": 80.96627,
                            "x": -616.9189,
                            "id": "grunt-contrib-watch",
                            "size": 0.8607372
                        }, {
                            "color": "#19c719",
                            "label": "http-proxy",
                            "attributes": {},
                            "y": 418.763,
                            "x": 711.7106,
                            "id": "http-proxy",
                            "size": 4.6339936
                        }, {
                            "color": "#b9c719",
                            "label": "mime",
                            "attributes": {},
                            "y": 34.348167,
                            "x": -284.14108,
                            "id": "mime",
                            "size": 14.858301
                        }, {
                            "color": "#c78419",
                            "label": "ycssmin",
                            "attributes": {},
                            "y": -392.55402,
                            "x": -199.6149,
                            "id": "ycssmin",
                            "size": 0.4651538
                        }, {
                            "color": "#3419c7",
                            "label": "mongodb",
                            "attributes": {},
                            "y": 522.375,
                            "x": -1089.2416,
                            "id": "mongodb",
                            "size": 11.237192
                        }, {
                            "color": "#19b9c7",
                            "label": "ini",
                            "attributes": {},
                            "y": 357.40076,
                            "x": 1076.3447,
                            "id": "ini",
                            "size": 1.5301858
                        }, {
                            "color": "#c79f19",
                            "label": "slide",
                            "attributes": {},
                            "y": -272.38953,
                            "x": 928.9824,
                            "id": "slide",
                            "size": 0.40429485
                        }, {
                            "color": "#c79f19",
                            "label": "abbrev",
                            "attributes": {},
                            "y": -185.45026,
                            "x": 1187.2019,
                            "id": "abbrev",
                            "size": 0.43472436
                        }, {
                            "color": "#c79f19",
                            "label": "graceful-fs",
                            "attributes": {},
                            "y": -400.4116,
                            "x": 864.7834,
                            "id": "graceful-fs",
                            "size": 1.8649102
                        }, {
                            "color": "#c79f19",
                            "label": "minimatch",
                            "attributes": {},
                            "y": -332.82092,
                            "x": 923.4708,
                            "id": "minimatch",
                            "size": 4.6339936
                        }, {
                            "color": "#c79f19",
                            "label": "nopt",
                            "attributes": {},
                            "y": 0.9246719,
                            "x": 648.4921,
                            "id": "nopt",
                            "size": 5.303442
                        }, {
                            "color": "#c79f19",
                            "label": "rimraf",
                            "attributes": {},
                            "y": -169.53479,
                            "x": 842.5285,
                            "id": "rimraf",
                            "size": 7.159641
                        }, {
                            "color": "#c79f19",
                            "label": "which",
                            "attributes": {},
                            "y": -237.25739,
                            "x": 1191.029,
                            "id": "which",
                            "size": 1.8649102
                        }, {
                            "color": "#c79f19",
                            "label": "tar",
                            "attributes": {},
                            "y": -160.8614,
                            "x": 572.6111,
                            "id": "tar",
                            "size": 3.2646663
                        }, {
                            "color": "#c79f19",
                            "label": "fstream",
                            "attributes": {},
                            "y": -86.683586,
                            "x": 522.8266,
                            "id": "fstream",
                            "size": 2.5343587
                        }, {
                            "color": "#c79f19",
                            "label": "inherits",
                            "attributes": {},
                            "y": 289.38367,
                            "x": 639.7362,
                            "id": "inherits",
                            "size": 3.4472432
                        }, {
                            "color": "#c79f19",
                            "label": "read",
                            "attributes": {},
                            "y": 376.2344,
                            "x": 537.65076,
                            "id": "read",
                            "size": 1.4997563
                        }, {
                            "color": "#c719b9",
                            "label": "lru-cache",
                            "attributes": {},
                            "y": 63.76733,
                            "x": 758.7636,
                            "id": "lru-cache",
                            "size": 2.1996343
                        }, {
                            "color": "#c79f19",
                            "label": "node-gyp",
                            "attributes": {},
                            "y": -206.755,
                            "x": 941.12946,
                            "id": "node-gyp",
                            "size": 1.165032
                        }, {
                            "color": "#c79f19",
                            "label": "fstream-npm",
                            "attributes": {},
                            "y": 172.07289,
                            "x": 792.2891,
                            "id": "fstream-npm",
                            "size": 0.52601284
                        }, {
                            "color": "#c79f19",
                            "label": "archy",
                            "attributes": {},
                            "y": -15.182732,
                            "x": 1288.449,
                            "id": "archy",
                            "size": 0.67816025
                        }, {
                            "color": "#c79f19",
                            "label": "npmlog",
                            "attributes": {},
                            "y": -713.69055,
                            "x": 856.64276,
                            "id": "npmlog",
                            "size": 1.4084679
                        }, {
                            "color": "#c79f19",
                            "label": "ansi",
                            "attributes": {},
                            "y": -722.70416,
                            "x": 996.9021,
                            "id": "ansi",
                            "size": 1.165032
                        }, {
                            "color": "#c79f19",
                            "label": "npm-registry-client",
                            "attributes": {},
                            "y": -163.23782,
                            "x": 770.89215,
                            "id": "npm-registry-client",
                            "size": 0.70858973
                        }, {
                            "color": "#c79f19",
                            "label": "read-package-json",
                            "attributes": {},
                            "y": -328.63486,
                            "x": 835.7924,
                            "id": "read-package-json",
                            "size": 0.6173013
                        }, {
                            "color": "#c79f19",
                            "label": "glob",
                            "attributes": {},
                            "y": -542.05096,
                            "x": 502.02698,
                            "id": "glob",
                            "size": 14.88873
                        }, {
                            "color": "#c79f19",
                            "label": "osenv",
                            "attributes": {},
                            "y": 83.11953,
                            "x": 1170.4095,
                            "id": "osenv",
                            "size": 0.67816025
                        }, {
                            "color": "#c76919",
                            "label": "retry",
                            "attributes": {},
                            "y": -149.41582,
                            "x": 1088.8419,
                            "id": "retry",
                            "size": 0.55644226
                        }, {
                            "color": "#34c719",
                            "label": "once",
                            "attributes": {},
                            "y": 632.73914,
                            "x": 692.4719,
                            "id": "once",
                            "size": 0.92159617
                        }, {
                            "color": "#c79f19",
                            "label": "npmconf",
                            "attributes": {},
                            "y": 263.6715,
                            "x": 880.9455,
                            "id": "npmconf",
                            "size": 0.70858973
                        }, {
                            "color": "#c79f19",
                            "label": "opener",
                            "attributes": {},
                            "y": 30.311459,
                            "x": 1306.2058,
                            "id": "opener",
                            "size": 0.43472436
                        }, {
                            "color": "#3419c7",
                            "label": "append",
                            "attributes": {},
                            "y": -216.35048,
                            "x": 23.50861,
                            "id": "append",
                            "size": 0.4651538
                        }, {
                            "color": "#3419c7",
                            "label": "clone",
                            "attributes": {},
                            "y": 52.33028,
                            "x": -407.7309,
                            "id": "clone",
                            "size": 2.4430702
                        }, {
                            "color": "#c71919",
                            "label": "ejs",
                            "attributes": {},
                            "y": 264.84995,
                            "x": -421.52237,
                            "id": "ejs",
                            "size": 11.298051
                        }, {
                            "color": "#9f19c7",
                            "label": "debug",
                            "attributes": {},
                            "y": -75.5553,
                            "x": -880.5015,
                            "id": "debug",
                            "size": 15.923333
                        }, {
                            "color": "#9f19c7",
                            "label": "out",
                            "attributes": {},
                            "y": -141.5042,
                            "x": -27.64139,
                            "id": "out",
                            "size": 0.43472436
                        }, {
                            "color": "#1919c7",
                            "label": "when",
                            "attributes": {},
                            "y": -798.01276,
                            "x": -874.1786,
                            "id": "when",
                            "size": 3.8123972
                        }, {
                            "color": "#c78419",
                            "label": "coffee-script",
                            "attributes": {},
                            "y": -915.89026,
                            "x": 81.49971,
                            "id": "coffee-script",
                            "size": 44.131462
                        }, {
                            "color": "#c79f19",
                            "label": "adm-zip",
                            "attributes": {},
                            "y": 198.17334,
                            "x": 893.567,
                            "id": "adm-zip",
                            "size": 1.3780384
                        }, {
                            "color": "#c7b919",
                            "label": "findup-sync",
                            "attributes": {},
                            "y": -535.91614,
                            "x": 345.53296,
                            "id": "findup-sync",
                            "size": 0.6173013
                        }, {
                            "color": "#c78419",
                            "label": "node-minify",
                            "attributes": {},
                            "y": -772.7816,
                            "x": 284.06558,
                            "id": "node-minify",
                            "size": 0.76944876
                        }, {
                            "color": "#19c719",
                            "label": "watch",
                            "attributes": {},
                            "y": 794.0542,
                            "x": 1113.2292,
                            "id": "watch",
                            "size": 3.7211087
                        }, {
                            "color": "#19c784",
                            "label": "bal-util",
                            "attributes": {},
                            "y": 630.7962,
                            "x": 1637.5715,
                            "id": "bal-util",
                            "size": 1.0128845
                        }, {
                            "color": "#19c784",
                            "label": "extendr",
                            "attributes": {},
                            "y": 674.9556,
                            "x": 1661.8947,
                            "id": "extendr",
                            "size": 0.4651538
                        }, {
                            "color": "#19c784",
                            "label": "taskgroup",
                            "attributes": {},
                            "y": 557.3904,
                            "x": 1473.007,
                            "id": "taskgroup",
                            "size": 0.67816025
                        }, {
                            "color": "#19c784",
                            "label": "typechecker",
                            "attributes": {},
                            "y": 655.7608,
                            "x": 1672.5186,
                            "id": "typechecker",
                            "size": 0.4651538
                        }, {
                            "color": "#c7199f",
                            "label": "underscorem",
                            "attributes": {},
                            "y": -865.8074,
                            "x": -106.96772,
                            "id": "underscorem",
                            "size": 0.6173013
                        }, {
                            "color": "#c719b9",
                            "label": "hubot",
                            "attributes": {},
                            "y": -683.4332,
                            "x": -280.204,
                            "id": "hubot",
                            "size": 1.165032
                        }, {
                            "color": "#1969c7",
                            "label": "ndarray-ops",
                            "attributes": {},
                            "y": -1321.741,
                            "x": 518.3953,
                            "id": "ndarray-ops",
                            "size": 0.58687174
                        }, {
                            "color": "#1969c7",
                            "label": "ndarray",
                            "attributes": {},
                            "y": -1302.119,
                            "x": 501.15656,
                            "id": "ndarray",
                            "size": 1.1041731
                        }, {
                            "color": "#1969c7",
                            "label": "typedarray-pool",
                            "attributes": {},
                            "y": -1032.3728,
                            "x": 964.9717,
                            "id": "typedarray-pool",
                            "size": 0.6173013
                        }, {
                            "color": "#c71919",
                            "label": "jade",
                            "attributes": {},
                            "y": -449.40155,
                            "x": -173.24167,
                            "id": "jade",
                            "size": 20.031315
                        }, {
                            "color": "#b9c719",
                            "label": "nodemailer",
                            "attributes": {},
                            "y": -531.05963,
                            "x": 847.43915,
                            "id": "nodemailer",
                            "size": 3.873256
                        }, {
                            "color": "#9fc719",
                            "label": "pkginfo",
                            "attributes": {},
                            "y": 1029.6494,
                            "x": 657.2629,
                            "id": "pkginfo",
                            "size": 8.498538
                        }, {
                            "color": "#c78419",
                            "label": "eco",
                            "attributes": {},
                            "y": -986.8328,
                            "x": 61.016094,
                            "id": "eco",
                            "size": 2.230064
                        }, {
                            "color": "#19c7b9",
                            "label": "github-flavored-markdown",
                            "attributes": {},
                            "y": -805.08057,
                            "x": -594.8061,
                            "id": "github-flavored-markdown",
                            "size": 0.92159617
                        }, {
                            "color": "#c79f19",
                            "label": "filed",
                            "attributes": {},
                            "y": 123.003525,
                            "x": -254.39879,
                            "id": "filed",
                            "size": 1.3780384
                        }, {
                            "color": "#19c7b9",
                            "label": "wrench",
                            "attributes": {},
                            "y": -524.69977,
                            "x": -186.77402,
                            "id": "wrench",
                            "size": 8.559398
                        }, {
                            "color": "#c71984",
                            "label": "flatiron",
                            "attributes": {},
                            "y": 816.91064,
                            "x": 876.8348,
                            "id": "flatiron",
                            "size": 1.9561987
                        }, {
                            "color": "#19b9c7",
                            "label": "winston",
                            "attributes": {},
                            "y": 695.1258,
                            "x": 881.2038,
                            "id": "winston",
                            "size": 11.845781
                        }, {
                            "color": "#c71919",
                            "label": "coffeekup",
                            "attributes": {},
                            "y": -987.40234,
                            "x": 85.66932,
                            "id": "coffeekup",
                            "size": 0.55644226
                        }, {
                            "color": "#c78419",
                            "label": "stylus",
                            "attributes": {},
                            "y": -620.4443,
                            "x": -586.76886,
                            "id": "stylus",
                            "size": 10.020013
                        }, {
                            "color": "#8419c7",
                            "label": "querystring",
                            "attributes": {},
                            "y": 1011.7739,
                            "x": 758.26154,
                            "id": "querystring",
                            "size": 1.9257691
                        }, {
                            "color": "#8419c7",
                            "label": "xml2json",
                            "attributes": {},
                            "y": 806.3456,
                            "x": -601.0259,
                            "id": "xml2json",
                            "size": 1.6214744
                        }, {
                            "color": "#1984c7",
                            "label": "nano",
                            "attributes": {},
                            "y": -75.38197,
                            "x": -114.47825,
                            "id": "nano",
                            "size": 1.5910448
                        }, {
                            "color": "#c78419",
                            "label": "less",
                            "attributes": {},
                            "y": -358.01407,
                            "x": -128.87897,
                            "id": "less",
                            "size": 9.928724
                        }, {
                            "color": "#c78419",
                            "label": "uglify-js",
                            "attributes": {},
                            "y": -699.5852,
                            "x": 177.18362,
                            "id": "uglify-js",
                            "size": 22.252666
                        }, {
                            "color": "#c78419",
                            "label": "clean-css",
                            "attributes": {},
                            "y": -807.94244,
                            "x": -442.73334,
                            "id": "clean-css",
                            "size": 3.7819674
                        }, {
                            "color": "#19c719",
                            "label": "filesize",
                            "attributes": {},
                            "y": -56.161583,
                            "x": -210.30255,
                            "id": "filesize",
                            "size": 0.52601284
                        }, {
                            "color": "#c71984",
                            "label": "strftime",
                            "attributes": {},
                            "y": 209.59007,
                            "x": -0.24881881,
                            "id": "strftime",
                            "size": 0.70858973
                        }, {
                            "color": "#4f19c7",
                            "label": "canvas",
                            "attributes": {},
                            "y": 463.22067,
                            "x": -290.9267,
                            "id": "canvas",
                            "size": 3.1429486
                        }, {
                            "color": "#b9c719",
                            "label": "common",
                            "attributes": {},
                            "y": 500.33102,
                            "x": -227.09238,
                            "id": "common",
                            "size": 0.83030766
                        }, {
                            "color": "#19b9c7",
                            "label": "structr",
                            "attributes": {},
                            "y": -1252.3774,
                            "x": 318.85583,
                            "id": "structr",
                            "size": 1.4997563
                        }, {
                            "color": "#1934c7",
                            "label": "simple-mime",
                            "attributes": {},
                            "y": -174.76685,
                            "x": 7.712948,
                            "id": "simple-mime",
                            "size": 0.40429485
                        }, {
                            "color": "#1934c7",
                            "label": "haml",
                            "attributes": {},
                            "y": 221.30989,
                            "x": 174.83754,
                            "id": "haml",
                            "size": 0.55644226
                        }, {
                            "color": "#19b9c7",
                            "label": "step",
                            "attributes": {},
                            "y": -1171.119,
                            "x": 261.83853,
                            "id": "step",
                            "size": 4.2688394
                        }, {
                            "color": "#1934c7",
                            "label": "datetime",
                            "attributes": {},
                            "y": 419.69788,
                            "x": 791.56323,
                            "id": "datetime",
                            "size": 0.4955833
                        }, {
                            "color": "#c71969",
                            "label": "inflection",
                            "attributes": {},
                            "y": -550.88916,
                            "x": 1271.2019,
                            "id": "inflection",
                            "size": 1.3476089
                        }, {
                            "color": "#1934c7",
                            "label": "vows",
                            "attributes": {},
                            "y": 398.0463,
                            "x": 791.03455,
                            "id": "vows",
                            "size": 3.751538
                        }, {
                            "color": "#c78419",
                            "label": "docco",
                            "attributes": {},
                            "y": -878.3072,
                            "x": -420.23013,
                            "id": "docco",
                            "size": 1.0737435
                        }, {
                            "color": "#34c719",
                            "label": "readable-stream",
                            "attributes": {},
                            "y": 492.42526,
                            "x": -531.76953,
                            "id": "readable-stream",
                            "size": 3.873256
                        }, {
                            "color": "#8419c7",
                            "label": "sax",
                            "attributes": {},
                            "y": 610.6721,
                            "x": -534.7558,
                            "id": "sax",
                            "size": 2.7169356
                        }, {
                            "color": "#8419c7",
                            "label": "xml2js",
                            "attributes": {},
                            "y": 210.87439,
                            "x": -510.32123,
                            "id": "xml2js",
                            "size": 8.894122
                        }, {
                            "color": "#8419c7",
                            "label": "libxmljs",
                            "attributes": {},
                            "y": 92.88487,
                            "x": -1068.4481,
                            "id": "libxmljs",
                            "size": 1.7431923
                        }, {
                            "color": "#c7b919",
                            "label": "handlebars",
                            "attributes": {},
                            "y": -423.4632,
                            "x": 590.7474,
                            "id": "handlebars",
                            "size": 8.285532
                        }, {
                            "color": "#1969c7",
                            "label": "numeric",
                            "attributes": {},
                            "y": -247.50432,
                            "x": -210.03926,
                            "id": "numeric",
                            "size": 0.58687174
                        }, {
                            "color": "#c71969",
                            "label": "tap",
                            "attributes": {},
                            "y": -312.4931,
                            "x": 551.4122,
                            "id": "tap",
                            "size": 1.4693269
                        }, {
                            "color": "#69c719",
                            "label": "boo",
                            "attributes": {},
                            "y": -200.40657,
                            "x": 75.31598,
                            "id": "boo",
                            "size": 0.58687174
                        }, {
                            "color": "#19c7b9",
                            "label": "walk",
                            "attributes": {},
                            "y": -584.2039,
                            "x": 383.56738,
                            "id": "walk",
                            "size": 2.3517818
                        }, {
                            "color": "#8419c7",
                            "label": "errs",
                            "attributes": {},
                            "y": 45.422947,
                            "x": -102.39036,
                            "id": "errs",
                            "size": 0.6173013
                        }, {
                            "color": "#199fc7",
                            "label": "through",
                            "attributes": {},
                            "y": 649.42224,
                            "x": 320.47504,
                            "id": "through",
                            "size": 10.14173
                        }, {
                            "color": "#199fc7",
                            "label": "duplexer",
                            "attributes": {},
                            "y": 940.3869,
                            "x": 251.87953,
                            "id": "duplexer",
                            "size": 1.3476089
                        }, {
                            "color": "#199fc7",
                            "label": "shell-quote",
                            "attributes": {},
                            "y": 850.67114,
                            "x": 118.35625,
                            "id": "shell-quote",
                            "size": 0.52601284
                        }, {
                            "color": "#199fc7",
                            "label": "split",
                            "attributes": {},
                            "y": 750.0239,
                            "x": 348.1923,
                            "id": "split",
                            "size": 1.1346025
                        }, {
                            "color": "#3419c7",
                            "label": "csv",
                            "attributes": {},
                            "y": 509.271,
                            "x": -160.78777,
                            "id": "csv",
                            "size": 1.7127627
                        }, {
                            "color": "#c719b9",
                            "label": "memcached",
                            "attributes": {},
                            "y": 1149.197,
                            "x": -234.76114,
                            "id": "memcached",
                            "size": 1.0128845
                        }, {
                            "color": "#c78419",
                            "label": "express-resource",
                            "attributes": {},
                            "y": -175.72437,
                            "x": -1060.0989,
                            "id": "express-resource",
                            "size": 0.7998782
                        }, {
                            "color": "#c71919",
                            "label": "connect-assets",
                            "attributes": {},
                            "y": -554.7191,
                            "x": -72.89341,
                            "id": "connect-assets",
                            "size": 0.7998782
                        }, {
                            "color": "#1984c7",
                            "label": "knox",
                            "attributes": {},
                            "y": -5.803794,
                            "x": -617.46643,
                            "id": "knox",
                            "size": 3.112519
                        }, {
                            "color": "#b9c719",
                            "label": "aws-sdk",
                            "attributes": {},
                            "y": 359.47635,
                            "x": -628.1506,
                            "id": "aws-sdk",
                            "size": 1.4693269
                        }, {
                            "color": "#19c7b9",
                            "label": "fs-extra",
                            "attributes": {},
                            "y": -203.57794,
                            "x": 428.15845,
                            "id": "fs-extra",
                            "size": 4.2079806
                        }, {
                            "color": "#c71969",
                            "label": "awssum",
                            "attributes": {},
                            "y": -279.23215,
                            "x": -325.59766,
                            "id": "awssum",
                            "size": 0.83030766
                        }, {
                            "color": "#84c719",
                            "label": "walker",
                            "attributes": {},
                            "y": -165.20312,
                            "x": -280.2626,
                            "id": "walker",
                            "size": 0.7390192
                        }, {
                            "color": "#84c719",
                            "label": "batchflow",
                            "attributes": {},
                            "y": 405.85773,
                            "x": -213.34535,
                            "id": "batchflow",
                            "size": 0.43472436
                        }, {
                            "color": "#84c719",
                            "label": "path-extra",
                            "attributes": {},
                            "y": 310.982,
                            "x": -367.00104,
                            "id": "path-extra",
                            "size": 0.43472436
                        }, {
                            "color": "#1984c7",
                            "label": "cradle",
                            "attributes": {},
                            "y": 356.7393,
                            "x": -42.904198,
                            "id": "cradle",
                            "size": 2.1996343
                        }, {
                            "color": "#194fc7",
                            "label": "cli-color",
                            "attributes": {},
                            "y": -1213.5996,
                            "x": 135.87648,
                            "id": "cli-color",
                            "size": 4.4514165
                        }, {
                            "color": "#c719b9",
                            "label": "hoek",
                            "attributes": {},
                            "y": 357.1927,
                            "x": 298.65424,
                            "id": "hoek",
                            "size": 0.8911666
                        }, {
                            "color": "#c78419",
                            "label": "csso",
                            "attributes": {},
                            "y": -265.18994,
                            "x": 159.92708,
                            "id": "csso",
                            "size": 0.8607372
                        }, {
                            "color": "#c78419",
                            "label": "html-minifier",
                            "attributes": {},
                            "y": 347.3478,
                            "x": 106.32629,
                            "id": "html-minifier",
                            "size": 1.1346025
                        }, {
                            "color": "#19b9c7",
                            "label": "hashish",
                            "attributes": {},
                            "y": -983.94257,
                            "x": 691.4775,
                            "id": "hashish",
                            "size": 1.3780384
                        }, {
                            "color": "#34c719",
                            "label": "htmlparser2",
                            "attributes": {},
                            "y": 32.03244,
                            "x": -571.7144,
                            "id": "htmlparser2",
                            "size": 1.3780384
                        }, {
                            "color": "#c78419",
                            "label": "node-zip",
                            "attributes": {},
                            "y": 322.0001,
                            "x": 25.3843,
                            "id": "node-zip",
                            "size": 0.7390192
                        }, {
                            "color": "#9f19c7",
                            "label": "batch",
                            "attributes": {},
                            "y": -315.33505,
                            "x": -502.78232,
                            "id": "batch",
                            "size": 1.8953397
                        }, {
                            "color": "#1969c7",
                            "label": "emitter-component",
                            "attributes": {},
                            "y": 217.5223,
                            "x": -994.7767,
                            "id": "emitter-component",
                            "size": 1.3171794
                        }, {
                            "color": "#19c7b9",
                            "label": "netmask",
                            "attributes": {},
                            "y": -974.2597,
                            "x": 39.66092,
                            "id": "netmask",
                            "size": 0.43472436
                        }, {
                            "color": "#c78419",
                            "label": "pkgcloud",
                            "attributes": {},
                            "y": 435.87173,
                            "x": 112.212494,
                            "id": "pkgcloud",
                            "size": 0.83030766
                        }, {
                            "color": "#c76919",
                            "label": "eventemitter2",
                            "attributes": {},
                            "y": 383.04288,
                            "x": 1152.9218,
                            "id": "eventemitter2",
                            "size": 4.3905573
                        }, {
                            "color": "#c7194f",
                            "label": "lingo",
                            "attributes": {},
                            "y": -344.86972,
                            "x": -1027.0432,
                            "id": "lingo",
                            "size": 1.165032
                        }, {
                            "color": "#b9c719",
                            "label": "mailparser",
                            "attributes": {},
                            "y": 74.95499,
                            "x": -381.3953,
                            "id": "mailparser",
                            "size": 0.7998782
                        }, {
                            "color": "#1984c7",
                            "label": "moment",
                            "attributes": {},
                            "y": -792.2076,
                            "x": -998.14185,
                            "id": "moment",
                            "size": 12.180507
                        }, {
                            "color": "#8419c7",
                            "label": "iconv",
                            "attributes": {},
                            "y": 92.13313,
                            "x": -414.8885,
                            "id": "iconv",
                            "size": 1.5910448
                        }, {
                            "color": "#c719b9",
                            "label": "websocket",
                            "attributes": {},
                            "y": -280.031,
                            "x": -68.44273,
                            "id": "websocket",
                            "size": 1.8344806
                        }, {
                            "color": "#c79f19",
                            "label": "portfinder",
                            "attributes": {},
                            "y": -113.6123,
                            "x": 371.73843,
                            "id": "portfinder",
                            "size": 0.92159617
                        }, {
                            "color": "#c71919",
                            "label": "node-markdown",
                            "attributes": {},
                            "y": -332.64737,
                            "x": 434.20547,
                            "id": "node-markdown",
                            "size": 1.6823332
                        }, {
                            "color": "#c79f19",
                            "label": "forever-monitor",
                            "attributes": {},
                            "y": 626.0845,
                            "x": 984.5066,
                            "id": "forever-monitor",
                            "size": 1.1041731
                        }, {
                            "color": "#c7194f",
                            "label": "mysql",
                            "attributes": {},
                            "y": 526.6606,
                            "x": -133.69568,
                            "id": "mysql",
                            "size": 4.8165703
                        }, {
                            "color": "#9fc719",
                            "label": "passport",
                            "attributes": {},
                            "y": 1162.1132,
                            "x": 529.5607,
                            "id": "passport",
                            "size": 4.1471214
                        }, {
                            "color": "#c78419",
                            "label": "jshint",
                            "attributes": {},
                            "y": -839.91656,
                            "x": 533.37573,
                            "id": "jshint",
                            "size": 3.0212305
                        }, {
                            "color": "#c78419",
                            "label": "nib",
                            "attributes": {},
                            "y": -691.36115,
                            "x": -655.49725,
                            "id": "nib",
                            "size": 3.9341152
                        }, {
                            "color": "#4f19c7",
                            "label": "cssom",
                            "attributes": {},
                            "y": -490.82297,
                            "x": -805.296,
                            "id": "cssom",
                            "size": 0.95202565
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-lib-contrib",
                            "attributes": {},
                            "y": -830.87317,
                            "x": -221.20235,
                            "id": "grunt-lib-contrib",
                            "size": 1.8040513
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-copy",
                            "attributes": {},
                            "y": 223.77101,
                            "x": 57.86038,
                            "id": "grunt-contrib-copy",
                            "size": 0.76944876
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-stylus",
                            "attributes": {},
                            "y": -673.43256,
                            "x": -653.4811,
                            "id": "grunt-contrib-stylus",
                            "size": 0.4955833
                        }, {
                            "color": "#1984c7",
                            "label": "phantom",
                            "attributes": {},
                            "y": 1001.26575,
                            "x": -280.97418,
                            "id": "phantom",
                            "size": 0.6173013
                        }, {
                            "color": "#19c7b9",
                            "label": "jslint",
                            "attributes": {},
                            "y": -4.006271,
                            "x": 613.1153,
                            "id": "jslint",
                            "size": 0.67816025
                        }, {
                            "color": "#8419c7",
                            "label": "xtend",
                            "attributes": {},
                            "y": 974.34454,
                            "x": 25.975996,
                            "id": "xtend",
                            "size": 3.2038076
                        }, {
                            "color": "#1984c7",
                            "label": "bufferstream",
                            "attributes": {},
                            "y": 1160.7294,
                            "x": 152.05467,
                            "id": "bufferstream",
                            "size": 0.67816025
                        }, {
                            "color": "#c78419",
                            "label": "browserify",
                            "attributes": {},
                            "y": 786.3091,
                            "x": 195.28586,
                            "id": "browserify",
                            "size": 5.8816023
                        }, {
                            "color": "#c79f19",
                            "label": "insert-css",
                            "attributes": {},
                            "y": 279.7769,
                            "x": -6.9432707,
                            "id": "insert-css",
                            "size": 0.40429485
                        }, {
                            "color": "#b9c719",
                            "label": "uuid",
                            "attributes": {},
                            "y": -77.014244,
                            "x": -279.67914,
                            "id": "uuid",
                            "size": 1.0737435
                        }, {
                            "color": "#9f19c7",
                            "label": "bindings",
                            "attributes": {},
                            "y": 80.179634,
                            "x": -1028.0078,
                            "id": "bindings",
                            "size": 3.3559546
                        }, {
                            "color": "#c71919",
                            "label": "argsparser",
                            "attributes": {},
                            "y": -178.20844,
                            "x": -244.5057,
                            "id": "argsparser",
                            "size": 0.64773077
                        }, {
                            "color": "#c719b9",
                            "label": "byline",
                            "attributes": {},
                            "y": -380.787,
                            "x": -21.57464,
                            "id": "byline",
                            "size": 0.67816025
                        }, {
                            "color": "#4f19c7",
                            "label": "nodeunit",
                            "attributes": {},
                            "y": -515.95337,
                            "x": 278.70786,
                            "id": "nodeunit",
                            "size": 2.8995125
                        }, {
                            "color": "#19b9c7",
                            "label": "vine",
                            "attributes": {},
                            "y": -1349.9265,
                            "x": 138.67784,
                            "id": "vine",
                            "size": 0.70858973
                        }, {
                            "color": "#19b9c7",
                            "label": "sprintf",
                            "attributes": {},
                            "y": -107.171104,
                            "x": -1031.4116,
                            "id": "sprintf",
                            "size": 2.929942
                        }, {
                            "color": "#19b9c7",
                            "label": "tq",
                            "attributes": {},
                            "y": -1175.0505,
                            "x": 101.18756,
                            "id": "tq",
                            "size": 0.4651538
                        }, {
                            "color": "#19c74f",
                            "label": "findit",
                            "attributes": {},
                            "y": -1036.1184,
                            "x": 751.62134,
                            "id": "findit",
                            "size": 3.05166
                        }, {
                            "color": "#19b9c7",
                            "label": "plugin",
                            "attributes": {},
                            "y": -1226.2068,
                            "x": 268.24854,
                            "id": "plugin",
                            "size": 0.95202565
                        }, {
                            "color": "#19b9c7",
                            "label": "crema",
                            "attributes": {},
                            "y": -1152.8553,
                            "x": 114.24345,
                            "id": "crema",
                            "size": 0.43472436
                        }, {
                            "color": "#19b9c7",
                            "label": "outcome",
                            "attributes": {},
                            "y": -1357.6165,
                            "x": 158.47685,
                            "id": "outcome",
                            "size": 1.3476089
                        }, {
                            "color": "#19b9c7",
                            "label": "comerr",
                            "attributes": {},
                            "y": -216.2576,
                            "x": -258.3082,
                            "id": "comerr",
                            "size": 0.58687174
                        }, {
                            "color": "#b919c7",
                            "label": "bean",
                            "attributes": {},
                            "y": -1213.9034,
                            "x": -1086.2054,
                            "id": "bean",
                            "size": 0.8607372
                        }, {
                            "color": "#19b9c7",
                            "label": "sk",
                            "attributes": {},
                            "y": -781.8526,
                            "x": 333.07233,
                            "id": "sk",
                            "size": 0.58687174
                        }, {
                            "color": "#19c719",
                            "label": "growl",
                            "attributes": {},
                            "y": -508.24026,
                            "x": -921.39386,
                            "id": "growl",
                            "size": 2.3517818
                        }, {
                            "color": "#c78419",
                            "label": "stitch",
                            "attributes": {},
                            "y": -365.59622,
                            "x": 27.93561,
                            "id": "stitch",
                            "size": 0.70858973
                        }, {
                            "color": "#c71969",
                            "label": "jasmine-node",
                            "attributes": {},
                            "y": -579.92035,
                            "x": 27.825665,
                            "id": "jasmine-node",
                            "size": 2.108346
                        }, {
                            "color": "#c71969",
                            "label": "file",
                            "attributes": {},
                            "y": -1062.3031,
                            "x": -77.094055,
                            "id": "file",
                            "size": 1.0737435
                        }, {
                            "color": "#4f19c7",
                            "label": "jsdom",
                            "attributes": {},
                            "y": -263.90924,
                            "x": -799.74493,
                            "id": "jsdom",
                            "size": 9.56357
                        }, {
                            "color": "#c71919",
                            "label": "inotify",
                            "attributes": {},
                            "y": 313.49222,
                            "x": 89.25136,
                            "id": "inotify",
                            "size": 0.4651538
                        }, {
                            "color": "#9f19c7",
                            "label": "superagent",
                            "attributes": {},
                            "y": 182.74373,
                            "x": -907.1791,
                            "id": "superagent",
                            "size": 5.0904355
                        }, {
                            "color": "#19c7b9",
                            "label": "marked",
                            "attributes": {},
                            "y": -871.4397,
                            "x": -500.8899,
                            "id": "marked",
                            "size": 8.224673
                        }, {
                            "color": "#19c7b9",
                            "label": "highlight",
                            "attributes": {},
                            "y": -94.81895,
                            "x": -209.03227,
                            "id": "highlight",
                            "size": 0.8607372
                        }, {
                            "color": "#c74f19",
                            "label": "sugar",
                            "attributes": {},
                            "y": 226.64883,
                            "x": 1280.8156,
                            "id": "sugar",
                            "size": 2.3517818
                        }, {
                            "color": "#c719b9",
                            "label": "msgpack",
                            "attributes": {},
                            "y": 428.69183,
                            "x": -51.497612,
                            "id": "msgpack",
                            "size": 0.67816025
                        }, {
                            "color": "#1919c7",
                            "label": "chai",
                            "attributes": {},
                            "y": 174.10605,
                            "x": 1250.3047,
                            "id": "chai",
                            "size": 2.9603715
                        }, {
                            "color": "#19c7b9",
                            "label": "readdirp",
                            "attributes": {},
                            "y": -405.0667,
                            "x": 915.12866,
                            "id": "readdirp",
                            "size": 0.95202565
                        }, {
                            "color": "#c719b9",
                            "label": "ws",
                            "attributes": {},
                            "y": -317.98154,
                            "x": -871.0914,
                            "id": "ws",
                            "size": 4.5731344
                        }, {
                            "color": "#c7194f",
                            "label": "node-xmpp",
                            "attributes": {},
                            "y": 598.0257,
                            "x": -410.16193,
                            "id": "node-xmpp",
                            "size": 1.3780384
                        }, {
                            "color": "#c78419",
                            "label": "csslint",
                            "attributes": {},
                            "y": 478.5039,
                            "x": -61.05299,
                            "id": "csslint",
                            "size": 0.7390192
                        }, {
                            "color": "#19c784",
                            "label": "watchr",
                            "attributes": {},
                            "y": 655.0502,
                            "x": 1623.2988,
                            "id": "watchr",
                            "size": 2.0779166
                        }, {
                            "color": "#19c7b9",
                            "label": "open",
                            "attributes": {},
                            "y": -1175.2716,
                            "x": -371.70215,
                            "id": "open",
                            "size": 2.169205
                        }, {
                            "color": "#19b9c7",
                            "label": "celeri",
                            "attributes": {},
                            "y": -1163.5059,
                            "x": 178.71414,
                            "id": "celeri",
                            "size": 0.83030766
                        }, {
                            "color": "#19c719",
                            "label": "iniparser",
                            "attributes": {},
                            "y": -339.9005,
                            "x": -52.90442,
                            "id": "iniparser",
                            "size": 0.52601284
                        }, {
                            "color": "#69c719",
                            "label": "coa",
                            "attributes": {},
                            "y": -496.67493,
                            "x": -374.48096,
                            "id": "coa",
                            "size": 0.70858973
                        }, {
                            "color": "#69c719",
                            "label": "ometajs",
                            "attributes": {},
                            "y": -563.26465,
                            "x": -248.37671,
                            "id": "ometajs",
                            "size": 0.70858973
                        }, {
                            "color": "#69c719",
                            "label": "q-fs",
                            "attributes": {},
                            "y": -252.13869,
                            "x": -493.3316,
                            "id": "q-fs",
                            "size": 0.55644226
                        }, {
                            "color": "#19c769",
                            "label": "estraverse",
                            "attributes": {},
                            "y": -438.3512,
                            "x": 1230.5919,
                            "id": "estraverse",
                            "size": 0.76944876
                        }, {
                            "color": "#19c769",
                            "label": "esprima",
                            "attributes": {},
                            "y": -492.75586,
                            "x": 1093.5259,
                            "id": "esprima",
                            "size": 4.8165703
                        }, {
                            "color": "#69c719",
                            "label": "vow",
                            "attributes": {},
                            "y": 274.6161,
                            "x": 22.648827,
                            "id": "vow",
                            "size": 0.55644226
                        }, {
                            "color": "#199fc7",
                            "label": "cookies",
                            "attributes": {},
                            "y": 1429.8711,
                            "x": -284.74634,
                            "id": "cookies",
                            "size": 1.5301858
                        }, {
                            "color": "#69c719",
                            "label": "inherit",
                            "attributes": {},
                            "y": 182.67122,
                            "x": 14.1439,
                            "id": "inherit",
                            "size": 0.58687174
                        }, {
                            "color": "#c78419",
                            "label": "dot",
                            "attributes": {},
                            "y": -150.56572,
                            "x": -237.81726,
                            "id": "dot",
                            "size": 0.67816025
                        }, {
                            "color": "#19c7b9",
                            "label": "benchmark",
                            "attributes": {},
                            "y": 497.00113,
                            "x": -186.69818,
                            "id": "benchmark",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "falafel",
                            "attributes": {},
                            "y": -291.48453,
                            "x": 1044.3159,
                            "id": "falafel",
                            "size": 1.4997563
                        }, {
                            "color": "#19c7b9",
                            "label": "cli-table",
                            "attributes": {},
                            "y": -276.09082,
                            "x": 599.47327,
                            "id": "cli-table",
                            "size": 2.3213525
                        }, {
                            "color": "#8419c7",
                            "label": "qs",
                            "attributes": {},
                            "y": 446.33676,
                            "x": -440.75952,
                            "id": "qs",
                            "size": 3.9036858
                        }, {
                            "color": "#84c719",
                            "label": "idgen",
                            "attributes": {},
                            "y": 428.3982,
                            "x": -268.81287,
                            "id": "idgen",
                            "size": 0.52601284
                        }, {
                            "color": "#c71919",
                            "label": "cli",
                            "attributes": {},
                            "y": -816.1008,
                            "x": 467.85532,
                            "id": "cli",
                            "size": 2.047487
                        }, {
                            "color": "#c719b9",
                            "label": "bunyan",
                            "attributes": {},
                            "y": 1165.037,
                            "x": 85.06831,
                            "id": "bunyan",
                            "size": 1.7431923
                        }, {
                            "color": "#c71919",
                            "label": "cookie",
                            "attributes": {},
                            "y": 76.30339,
                            "x": -946.7451,
                            "id": "cookie",
                            "size": 1.5910448
                        }, {
                            "color": "#c7199f",
                            "label": "callsite",
                            "attributes": {},
                            "y": 201.48732,
                            "x": 26.608828,
                            "id": "callsite",
                            "size": 0.7390192
                        }, {
                            "color": "#1969c7",
                            "label": "bit-twiddle",
                            "attributes": {},
                            "y": -1051.561,
                            "x": 969.86316,
                            "id": "bit-twiddle",
                            "size": 0.70858973
                        }, {
                            "color": "#c71984",
                            "label": "utile",
                            "attributes": {},
                            "y": 579.9666,
                            "x": 723.9766,
                            "id": "utile",
                            "size": 1.8040513
                        }, {
                            "color": "#4f19c7",
                            "label": "deep-equal",
                            "attributes": {},
                            "y": 627.13947,
                            "x": 403.1256,
                            "id": "deep-equal",
                            "size": 0.83030766
                        }, {
                            "color": "#c71919",
                            "label": "send",
                            "attributes": {},
                            "y": -25.373653,
                            "x": -798.1167,
                            "id": "send",
                            "size": 2.3822114
                        }, {
                            "color": "#c78419",
                            "label": "jison",
                            "attributes": {},
                            "y": -632.0565,
                            "x": 1053.5453,
                            "id": "jison",
                            "size": 0.7390192
                        }, {
                            "color": "#c71919",
                            "label": "socket.io-client",
                            "attributes": {},
                            "y": -341.4672,
                            "x": -552.156,
                            "id": "socket.io-client",
                            "size": 3.7819674
                        }, {
                            "color": "#19c7b9",
                            "label": "resource",
                            "attributes": {},
                            "y": -41.398632,
                            "x": 1071.8018,
                            "id": "resource",
                            "size": 1.8344806
                        }, {
                            "color": "#c7194f",
                            "label": "node-expat",
                            "attributes": {},
                            "y": 788.2994,
                            "x": -586.8687,
                            "id": "node-expat",
                            "size": 1.3476089
                        }, {
                            "color": "#c71919",
                            "label": "jake",
                            "attributes": {},
                            "y": -456.03333,
                            "x": 963.65735,
                            "id": "jake",
                            "size": 0.92159617
                        }, {
                            "color": "#1934c7",
                            "label": "assert",
                            "attributes": {},
                            "y": 841.56354,
                            "x": -892.81085,
                            "id": "assert",
                            "size": 0.8911666
                        }, {
                            "color": "#c7199f",
                            "label": "bigint",
                            "attributes": {},
                            "y": 420.5151,
                            "x": -74.42052,
                            "id": "bigint",
                            "size": 0.40429485
                        }, {
                            "color": "#c71919",
                            "label": "path",
                            "attributes": {},
                            "y": -293.70203,
                            "x": -306.8733,
                            "id": "path",
                            "size": 1.3476089
                        }, {
                            "color": "#1919c7",
                            "label": "detective",
                            "attributes": {},
                            "y": -324.75464,
                            "x": 1175.4331,
                            "id": "detective",
                            "size": 1.6214744
                        }, {
                            "color": "#c7199f",
                            "label": "bignum",
                            "attributes": {},
                            "y": 447.65332,
                            "x": -88.192,
                            "id": "bignum",
                            "size": 0.6173013
                        }, {
                            "color": "#c78419",
                            "label": "gaze",
                            "attributes": {},
                            "y": -129.82701,
                            "x": -467.96494,
                            "id": "gaze",
                            "size": 1.1346025
                        }, {
                            "color": "#c79f19",
                            "label": "istanbul",
                            "attributes": {},
                            "y": -414.29037,
                            "x": 981.35065,
                            "id": "istanbul",
                            "size": 1.4693269
                        }, {
                            "color": "#1919c7",
                            "label": "sinon",
                            "attributes": {},
                            "y": 241.44598,
                            "x": 121.80424,
                            "id": "sinon",
                            "size": 1.7127627
                        }, {
                            "color": "#c79f19",
                            "label": "tiny-lr",
                            "attributes": {},
                            "y": 272.46545,
                            "x": -702.41003,
                            "id": "tiny-lr",
                            "size": 0.58687174
                        }, {
                            "color": "#19c7b9",
                            "label": "argparse",
                            "attributes": {},
                            "y": -633.0312,
                            "x": 336.41046,
                            "id": "argparse",
                            "size": 1.4388975
                        }, {
                            "color": "#194fc7",
                            "label": "node.extend",
                            "attributes": {},
                            "y": 120.20691,
                            "x": 287.5265,
                            "id": "node.extend",
                            "size": 1.5606153
                        }, {
                            "color": "#19b9c7",
                            "label": "dref",
                            "attributes": {},
                            "y": -1461.0592,
                            "x": 310.44052,
                            "id": "dref",
                            "size": 0.7390192
                        }, {
                            "color": "#19b9c7",
                            "label": "toarray",
                            "attributes": {},
                            "y": -1257.1584,
                            "x": 208.80318,
                            "id": "toarray",
                            "size": 0.55644226
                        }, {
                            "color": "#19b9c7",
                            "label": "type-component",
                            "attributes": {},
                            "y": -1413.6371,
                            "x": 284.43454,
                            "id": "type-component",
                            "size": 0.7998782
                        }, {
                            "color": "#c78419",
                            "label": "java",
                            "attributes": {},
                            "y": -224.4037,
                            "x": -105.301605,
                            "id": "java",
                            "size": 0.4955833
                        }, {
                            "color": "#c78419",
                            "label": "walkdir",
                            "attributes": {},
                            "y": -548.8894,
                            "x": 199.97614,
                            "id": "walkdir",
                            "size": 1.1346025
                        }, {
                            "color": "#c78419",
                            "label": "haml-coffee",
                            "attributes": {},
                            "y": -460.67175,
                            "x": 300.36,
                            "id": "haml-coffee",
                            "size": 0.58687174
                        }, {
                            "color": "#19c769",
                            "label": "prime",
                            "attributes": {},
                            "y": -170.90903,
                            "x": -213.16695,
                            "id": "prime",
                            "size": 0.92159617
                        }, {
                            "color": "#c78419",
                            "label": "asyncjs",
                            "attributes": {},
                            "y": 15.206377,
                            "x": 295.61932,
                            "id": "asyncjs",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "oauth",
                            "attributes": {},
                            "y": 1275.2666,
                            "x": -218.46474,
                            "id": "oauth",
                            "size": 5.0295763
                        }, {
                            "color": "#c71919",
                            "label": "buffertools",
                            "attributes": {},
                            "y": 1148.7097,
                            "x": 164.38617,
                            "id": "buffertools",
                            "size": 1.1346025
                        }, {
                            "color": "#c7199f",
                            "label": "binary",
                            "attributes": {},
                            "y": 684.67883,
                            "x": 4.923739,
                            "id": "binary",
                            "size": 0.83030766
                        }, {
                            "color": "#c71984",
                            "label": "irc",
                            "attributes": {},
                            "y": -76.81115,
                            "x": -224.82208,
                            "id": "irc",
                            "size": 1.8040513
                        }, {
                            "color": "#c7199f",
                            "label": "forever",
                            "attributes": {},
                            "y": 671.5869,
                            "x": 1066.038,
                            "id": "forever",
                            "size": 1.5910448
                        }, {
                            "color": "#c7199f",
                            "label": "buffers",
                            "attributes": {},
                            "y": 735.97046,
                            "x": 18.47544,
                            "id": "buffers",
                            "size": 0.8911666
                        }, {
                            "color": "#19b9c7",
                            "label": "hooks",
                            "attributes": {},
                            "y": 409.85138,
                            "x": -1169.465,
                            "id": "hooks",
                            "size": 0.40429485
                        }, {
                            "color": "#1984c7",
                            "label": "num",
                            "attributes": {},
                            "y": 146.5466,
                            "x": -386.24503,
                            "id": "num",
                            "size": 0.4955833
                        }, {
                            "color": "#c79f19",
                            "label": "shelljs",
                            "attributes": {},
                            "y": -900.85004,
                            "x": 499.16705,
                            "id": "shelljs",
                            "size": 3.234237
                        }, {
                            "color": "#c71919",
                            "label": "serialport",
                            "attributes": {},
                            "y": 89.454384,
                            "x": -131.34398,
                            "id": "serialport",
                            "size": 1.9561987
                        }, {
                            "color": "#c78419",
                            "label": "pegjs",
                            "attributes": {},
                            "y": -289.04016,
                            "x": 164.06274,
                            "id": "pegjs",
                            "size": 1.28675
                        }, {
                            "color": "#c71919",
                            "label": "connect-redis",
                            "attributes": {},
                            "y": 0.25086692,
                            "x": -927.49084,
                            "id": "connect-redis",
                            "size": 1.8649102
                        }, {
                            "color": "#c78419",
                            "label": "optparse",
                            "attributes": {},
                            "y": -843.711,
                            "x": -301.50488,
                            "id": "optparse",
                            "size": 1.0128845
                        }, {
                            "color": "#19b9c7",
                            "label": "dnode",
                            "attributes": {},
                            "y": 1043.8707,
                            "x": -152.54582,
                            "id": "dnode",
                            "size": 2.1387753
                        }, {
                            "color": "#19c7b9",
                            "label": "highlight.js",
                            "attributes": {},
                            "y": -923.82654,
                            "x": -452.9307,
                            "id": "highlight.js",
                            "size": 2.4126408
                        }, {
                            "color": "#c71984",
                            "label": "plates",
                            "attributes": {},
                            "y": -92.00068,
                            "x": 199.20425,
                            "id": "plates",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "after",
                            "attributes": {},
                            "y": -525.1652,
                            "x": 640.8966,
                            "id": "after",
                            "size": 0.55644226
                        }, {
                            "color": "#c71984",
                            "label": "union",
                            "attributes": {},
                            "y": 779.5833,
                            "x": 128.22095,
                            "id": "union",
                            "size": 1.1041731
                        }, {
                            "color": "#c71984",
                            "label": "director",
                            "attributes": {},
                            "y": 868.4869,
                            "x": 851.6432,
                            "id": "director",
                            "size": 1.0128845
                        }, {
                            "color": "#8419c7",
                            "label": "crypto",
                            "attributes": {},
                            "y": 315.04626,
                            "x": -2.5743425,
                            "id": "crypto",
                            "size": 1.8649102
                        }, {
                            "color": "#9fc719",
                            "label": "passport-local",
                            "attributes": {},
                            "y": 1117.0792,
                            "x": 606.08325,
                            "id": "passport-local",
                            "size": 1.3171794
                        }, {
                            "color": "#19c74f",
                            "label": "xmldom",
                            "attributes": {},
                            "y": 555.979,
                            "x": -786.6827,
                            "id": "xmldom",
                            "size": 1.986628
                        }, {
                            "color": "#19c7b9",
                            "label": "markdown",
                            "attributes": {},
                            "y": 14.575827,
                            "x": 610.2677,
                            "id": "markdown",
                            "size": 2.230064
                        }, {
                            "color": "#b9c719",
                            "label": "ent",
                            "attributes": {},
                            "y": 533.3348,
                            "x": 172.2999,
                            "id": "ent",
                            "size": 1.0737435
                        }, {
                            "color": "#1919c7",
                            "label": "node-gd",
                            "attributes": {},
                            "y": -254.01602,
                            "x": -60.33067,
                            "id": "node-gd",
                            "size": 0.40429485
                        }, {
                            "color": "#19c719",
                            "label": "microtime",
                            "attributes": {},
                            "y": 98.89298,
                            "x": -1054.5382,
                            "id": "microtime",
                            "size": 1.1954615
                        }, {
                            "color": "#c7194f",
                            "label": "crc",
                            "attributes": {},
                            "y": 217.0216,
                            "x": 132.25229,
                            "id": "crc",
                            "size": 0.76944876
                        }, {
                            "color": "#19c7b9",
                            "label": "rss",
                            "attributes": {},
                            "y": 76.558815,
                            "x": -446.1457,
                            "id": "rss",
                            "size": 0.7390192
                        }, {
                            "color": "#c71919",
                            "label": "connect-mongodb",
                            "attributes": {},
                            "y": 425.84332,
                            "x": -1039.9854,
                            "id": "connect-mongodb",
                            "size": 0.58687174
                        }, {
                            "color": "#c71919",
                            "label": "express-partials",
                            "attributes": {},
                            "y": -273.29303,
                            "x": -98.9056,
                            "id": "express-partials",
                            "size": 0.43472436
                        }, {
                            "color": "#9fc719",
                            "label": "connect-flash",
                            "attributes": {},
                            "y": 207.55605,
                            "x": -392.5633,
                            "id": "connect-flash",
                            "size": 0.95202565
                        }, {
                            "color": "#19b9c7",
                            "label": "sift",
                            "attributes": {},
                            "y": -1229.2162,
                            "x": 203.28523,
                            "id": "sift",
                            "size": 0.76944876
                        }, {
                            "color": "#19c719",
                            "label": "charm",
                            "attributes": {},
                            "y": -855.05255,
                            "x": 684.35016,
                            "id": "charm",
                            "size": 1.1346025
                        }, {
                            "color": "#c71919",
                            "label": "showdown",
                            "attributes": {},
                            "y": -355.61545,
                            "x": 158.14978,
                            "id": "showdown",
                            "size": 0.8607372
                        }, {
                            "color": "#1984c7",
                            "label": "connect-form",
                            "attributes": {},
                            "y": 620.0338,
                            "x": -932.84155,
                            "id": "connect-form",
                            "size": 0.43472436
                        }, {
                            "color": "#c71919",
                            "label": "yaml",
                            "attributes": {},
                            "y": -317.5982,
                            "x": -279.82288,
                            "id": "yaml",
                            "size": 1.4084679
                        }, {
                            "color": "#c78419",
                            "label": "zombie",
                            "attributes": {},
                            "y": -95.91513,
                            "x": -656.0366,
                            "id": "zombie",
                            "size": 1.4388975
                        }, {
                            "color": "#c78419",
                            "label": "jugglingdb",
                            "attributes": {},
                            "y": -540.2533,
                            "x": 1273.7468,
                            "id": "jugglingdb",
                            "size": 0.6173013
                        }, {
                            "color": "#8419c7",
                            "label": "date-utils",
                            "attributes": {},
                            "y": -571.8109,
                            "x": -1065.7231,
                            "id": "date-utils",
                            "size": 0.98245513
                        }, {
                            "color": "#c7b919",
                            "label": "regexp-quote",
                            "attributes": {},
                            "y": -193.41238,
                            "x": -275.24255,
                            "id": "regexp-quote",
                            "size": 0.43472436
                        }, {
                            "color": "#c719b9",
                            "label": "hiredis",
                            "attributes": {},
                            "y": 115.843506,
                            "x": -1046.4277,
                            "id": "hiredis",
                            "size": 4.23841
                        }, {
                            "color": "#c71919",
                            "label": "swig",
                            "attributes": {},
                            "y": -807.8819,
                            "x": -189.87314,
                            "id": "swig",
                            "size": 1.6214744
                        }, {
                            "color": "#4f19c7",
                            "label": "xmlhttprequest",
                            "attributes": {},
                            "y": -388.15134,
                            "x": -831.295,
                            "id": "xmlhttprequest",
                            "size": 1.8040513
                        }, {
                            "color": "#19c7b9",
                            "label": "keypress",
                            "attributes": {},
                            "y": -1097.4784,
                            "x": -158.4356,
                            "id": "keypress",
                            "size": 1.3171794
                        }, {
                            "color": "#b9c719",
                            "label": "formidable",
                            "attributes": {},
                            "y": 600.273,
                            "x": -921.4781,
                            "id": "formidable",
                            "size": 3.4168139
                        }, {
                            "color": "#19c719",
                            "label": "node-static",
                            "attributes": {},
                            "y": -10.201102,
                            "x": 354.93808,
                            "id": "node-static",
                            "size": 2.929942
                        }, {
                            "color": "#1984c7",
                            "label": "imagemagick",
                            "attributes": {},
                            "y": 215.64548,
                            "x": -360.4117,
                            "id": "imagemagick",
                            "size": 1.6823332
                        }, {
                            "color": "#4f19c7",
                            "label": "bootstrap",
                            "attributes": {},
                            "y": -731.5939,
                            "x": -528.3612,
                            "id": "bootstrap",
                            "size": 0.43472436
                        }, {
                            "color": "#1984c7",
                            "label": "nconf",
                            "attributes": {},
                            "y": 511.7138,
                            "x": 915.0162,
                            "id": "nconf",
                            "size": 4.3905573
                        }, {
                            "color": "#4f19c7",
                            "label": "htmlparser",
                            "attributes": {},
                            "y": -575.9647,
                            "x": -136.95193,
                            "id": "htmlparser",
                            "size": 2.2909229
                        }, {
                            "color": "#19c74f",
                            "label": "seq",
                            "attributes": {},
                            "y": -1037.4547,
                            "x": 734.58215,
                            "id": "seq",
                            "size": 1.7736217
                        }, {
                            "color": "#b9c719",
                            "label": "azure",
                            "attributes": {},
                            "y": -44.75286,
                            "x": -406.81332,
                            "id": "azure",
                            "size": 1.0128845
                        }, {
                            "color": "#19c769",
                            "label": "resolve",
                            "attributes": {},
                            "y": -923.4041,
                            "x": 695.9144,
                            "id": "resolve",
                            "size": 1.6214744
                        }, {
                            "color": "#c7194f",
                            "label": "generic-pool",
                            "attributes": {},
                            "y": -363.04434,
                            "x": -1126.6726,
                            "id": "generic-pool",
                            "size": 1.5301858
                        }, {
                            "color": "#c7194f",
                            "label": "pg",
                            "attributes": {},
                            "y": -251.6094,
                            "x": -1194.4589,
                            "id": "pg",
                            "size": 3.2038076
                        }, {
                            "color": "#c71919",
                            "label": "jqtpl",
                            "attributes": {},
                            "y": -843.789,
                            "x": -155.0798,
                            "id": "jqtpl",
                            "size": 0.67816025
                        }, {
                            "color": "#c79f19",
                            "label": "npm",
                            "attributes": {},
                            "y": -86.14667,
                            "x": 1400.5574,
                            "id": "npm",
                            "size": 5.0904355
                        }, {
                            "color": "#c79f19",
                            "label": "ncp",
                            "attributes": {},
                            "y": 112.65727,
                            "x": 718.81494,
                            "id": "ncp",
                            "size": 2.7169356
                        }, {
                            "color": "#84c719",
                            "label": "promised-io",
                            "attributes": {},
                            "y": 29.489025,
                            "x": -423.36993,
                            "id": "promised-io",
                            "size": 1.1346025
                        }, {
                            "color": "#c719b9",
                            "label": "log",
                            "attributes": {},
                            "y": -523.3549,
                            "x": -19.44641,
                            "id": "log",
                            "size": 1.1041731
                        }, {
                            "color": "#c719b9",
                            "label": "zmq",
                            "attributes": {},
                            "y": 300.038,
                            "x": -294.43927,
                            "id": "zmq",
                            "size": 1.1346025
                        }, {
                            "color": "#19c719",
                            "label": "nomnom",
                            "attributes": {},
                            "y": -597.822,
                            "x": 531.09247,
                            "id": "nomnom",
                            "size": 2.3213525
                        }, {
                            "color": "#1934c7",
                            "label": "JSV",
                            "attributes": {},
                            "y": -247.65616,
                            "x": -240.78343,
                            "id": "JSV",
                            "size": 0.7390192
                        }, {
                            "color": "#9fc719",
                            "label": "passport-oauth",
                            "attributes": {},
                            "y": 1229.6758,
                            "x": 527.8946,
                            "id": "passport-oauth",
                            "size": 3.6602497
                        }, {
                            "color": "#9fc719",
                            "label": "passport-twitter",
                            "attributes": {},
                            "y": 1171.3842,
                            "x": 599.1357,
                            "id": "passport-twitter",
                            "size": 0.52601284
                        }, {
                            "color": "#c79f19",
                            "label": "methods",
                            "attributes": {},
                            "y": -49.73068,
                            "x": -1083.3983,
                            "id": "methods",
                            "size": 1.6823332
                        }, {
                            "color": "#c719b9",
                            "label": "hat",
                            "attributes": {},
                            "y": 428.36014,
                            "x": -233.57118,
                            "id": "hat",
                            "size": 1.0737435
                        }, {
                            "color": "#c71919",
                            "label": "mongoskin",
                            "attributes": {},
                            "y": 548.74744,
                            "x": -1074.1718,
                            "id": "mongoskin",
                            "size": 1.28675
                        }, {
                            "color": "#19b9c7",
                            "label": "traverse",
                            "attributes": {},
                            "y": -869.6334,
                            "x": 607.4505,
                            "id": "traverse",
                            "size": 2.169205
                        }, {
                            "color": "#b919c7",
                            "label": "bonzo",
                            "attributes": {},
                            "y": -1230.6212,
                            "x": -1068.8632,
                            "id": "bonzo",
                            "size": 0.76944876
                        }, {
                            "color": "#c71919",
                            "label": "emailjs",
                            "attributes": {},
                            "y": -827.9733,
                            "x": -1057.115,
                            "id": "emailjs",
                            "size": 0.98245513
                        }, {
                            "color": "#9fc719",
                            "label": "connect-mongo",
                            "attributes": {},
                            "y": 542.9935,
                            "x": -1111.1758,
                            "id": "connect-mongo",
                            "size": 0.98245513
                        }, {
                            "color": "#9fc719",
                            "label": "bcrypt",
                            "attributes": {},
                            "y": 74.34341,
                            "x": -1062.3085,
                            "id": "bcrypt",
                            "size": 2.1387753
                        }, {
                            "color": "#c71919",
                            "label": "ntwitter",
                            "attributes": {},
                            "y": 1392.1279,
                            "x": -288.68558,
                            "id": "ntwitter",
                            "size": 0.98245513
                        }, {
                            "color": "#9f19c7",
                            "label": "juice",
                            "attributes": {},
                            "y": -363.1132,
                            "x": -774.99554,
                            "id": "juice",
                            "size": 0.70858973
                        }, {
                            "color": "#199fc7",
                            "label": "pause-stream",
                            "attributes": {},
                            "y": 747.02313,
                            "x": 325.80133,
                            "id": "pause-stream",
                            "size": 0.76944876
                        }, {
                            "color": "#19c7b9",
                            "label": "aug",
                            "attributes": {},
                            "y": 48.178226,
                            "x": 299.8556,
                            "id": "aug",
                            "size": 0.55644226
                        }, {
                            "color": "#c7194f",
                            "label": "sequelize",
                            "attributes": {},
                            "y": -618.1904,
                            "x": -736.92706,
                            "id": "sequelize",
                            "size": 1.4693269
                        }, {
                            "color": "#c79f19",
                            "label": "tar.gz",
                            "attributes": {},
                            "y": -348.83762,
                            "x": 219.78055,
                            "id": "tar.gz",
                            "size": 0.4955833
                        }, {
                            "color": "#19c7b9",
                            "label": "progress",
                            "attributes": {},
                            "y": 398.53415,
                            "x": -321.36157,
                            "id": "progress",
                            "size": 1.4997563
                        }, {
                            "color": "#c78419",
                            "label": "jqueryify",
                            "attributes": {},
                            "y": -282.94342,
                            "x": -273.135,
                            "id": "jqueryify",
                            "size": 0.52601284
                        }, {
                            "color": "#19c719",
                            "label": "prettyjson",
                            "attributes": {},
                            "y": -330.08105,
                            "x": 677.47784,
                            "id": "prettyjson",
                            "size": 0.55644226
                        }, {
                            "color": "#199fc7",
                            "label": "bops",
                            "attributes": {},
                            "y": 1038.1771,
                            "x": -594.73846,
                            "id": "bops",
                            "size": 0.92159617
                        }, {
                            "color": "#c71919",
                            "label": "string",
                            "attributes": {},
                            "y": 282.6386,
                            "x": 140.15605,
                            "id": "string",
                            "size": 1.9561987
                        }, {
                            "color": "#19c74f",
                            "label": "acorn",
                            "attributes": {},
                            "y": -244.40276,
                            "x": 44.10389,
                            "id": "acorn",
                            "size": 0.52601284
                        }, {
                            "color": "#19c769",
                            "label": "escodegen",
                            "attributes": {},
                            "y": -395.20676,
                            "x": 1190.5619,
                            "id": "escodegen",
                            "size": 2.4734998
                        }, {
                            "color": "#c71969",
                            "label": "ssh2",
                            "attributes": {},
                            "y": -344.42947,
                            "x": -37.119053,
                            "id": "ssh2",
                            "size": 1.043314
                        }, {
                            "color": "#19c74f",
                            "label": "url",
                            "attributes": {},
                            "y": 999.7216,
                            "x": 756.65375,
                            "id": "url",
                            "size": 1.2563205
                        }, {
                            "color": "#c7194f",
                            "label": "ltx",
                            "attributes": {},
                            "y": 729.8443,
                            "x": -564.28973,
                            "id": "ltx",
                            "size": 1.043314
                        }, {
                            "color": "#b9c719",
                            "label": "util",
                            "attributes": {},
                            "y": 835.1216,
                            "x": -901.55054,
                            "id": "util",
                            "size": 1.1041731
                        }, {
                            "color": "#b9c719",
                            "label": "events",
                            "attributes": {},
                            "y": 244.31078,
                            "x": 183.56725,
                            "id": "events",
                            "size": 0.52601284
                        }, {
                            "color": "#c79f19",
                            "label": "bouncy",
                            "attributes": {},
                            "y": 442.78336,
                            "x": 465.8834,
                            "id": "bouncy",
                            "size": 0.76944876
                        }, {
                            "color": "#19c719",
                            "label": "mdns",
                            "attributes": {},
                            "y": -95.6844,
                            "x": -180.63136,
                            "id": "mdns",
                            "size": 0.6173013
                        }, {
                            "color": "#1969c7",
                            "label": "simplicial-complex",
                            "attributes": {},
                            "y": -1043.0298,
                            "x": 952.3011,
                            "id": "simplicial-complex",
                            "size": 0.4651538
                        }, {
                            "color": "#1984c7",
                            "label": "tmp",
                            "attributes": {},
                            "y": 86.25464,
                            "x": 981.84015,
                            "id": "tmp",
                            "size": 1.1041731
                        }, {
                            "color": "#c79f19",
                            "label": "bower",
                            "attributes": {},
                            "y": -25.807001,
                            "x": 950.3085,
                            "id": "bower",
                            "size": 2.3517818
                        }, {
                            "color": "#19c719",
                            "label": "rc",
                            "attributes": {},
                            "y": 288.68192,
                            "x": 964.8844,
                            "id": "rc",
                            "size": 0.7998782
                        }, {
                            "color": "#c79f19",
                            "label": "unzip",
                            "attributes": {},
                            "y": 468.33945,
                            "x": 43.956604,
                            "id": "unzip",
                            "size": 1.4084679
                        }, {
                            "color": "#c71919",
                            "label": "buffer-crc32",
                            "attributes": {},
                            "y": 34.657063,
                            "x": -959.97186,
                            "id": "buffer-crc32",
                            "size": 0.70858973
                        }, {
                            "color": "#c71919",
                            "label": "fresh",
                            "attributes": {},
                            "y": -176.22559,
                            "x": -847.5239,
                            "id": "fresh",
                            "size": 0.55644226
                        }, {
                            "color": "#9f19c7",
                            "label": "scaffolder",
                            "attributes": {},
                            "y": -156.31787,
                            "x": 39.511776,
                            "id": "scaffolder",
                            "size": 0.64773077
                        }, {
                            "color": "#9f19c7",
                            "label": "memory-cache",
                            "attributes": {},
                            "y": -189.8613,
                            "x": -303.6808,
                            "id": "memory-cache",
                            "size": 0.4651538
                        }, {
                            "color": "#8419c7",
                            "label": "restler",
                            "attributes": {},
                            "y": 206.90912,
                            "x": 214.60414,
                            "id": "restler",
                            "size": 2.3213525
                        }, {
                            "color": "#1934c7",
                            "label": "stream-buffers",
                            "attributes": {},
                            "y": 382.2567,
                            "x": -296.40576,
                            "id": "stream-buffers",
                            "size": 0.4955833
                        }, {
                            "color": "#19c719",
                            "label": "hook.io",
                            "attributes": {},
                            "y": 469.00113,
                            "x": 631.8956,
                            "id": "hook.io",
                            "size": 2.7169356
                        }, {
                            "color": "#c71969",
                            "label": "node-promise",
                            "attributes": {},
                            "y": 171.45761,
                            "x": -338.04773,
                            "id": "node-promise",
                            "size": 0.70858973
                        }, {
                            "color": "#c71919",
                            "label": "pty.js",
                            "attributes": {},
                            "y": 413.48465,
                            "x": -96.42841,
                            "id": "pty.js",
                            "size": 0.43472436
                        }, {
                            "color": "#c76919",
                            "label": "fs.extra",
                            "attributes": {},
                            "y": -372.29422,
                            "x": 386.45148,
                            "id": "fs.extra",
                            "size": 1.165032
                        }, {
                            "color": "#c71919",
                            "label": "now",
                            "attributes": {},
                            "y": 172.7239,
                            "x": -784.44946,
                            "id": "now",
                            "size": 0.98245513
                        }, {
                            "color": "#c78419",
                            "label": "ansi-color",
                            "attributes": {},
                            "y": -602.7042,
                            "x": -1037.8462,
                            "id": "ansi-color",
                            "size": 1.0737435
                        }, {
                            "color": "#1969c7",
                            "label": "brfs",
                            "attributes": {},
                            "y": 1.9099157,
                            "x": 882.43463,
                            "id": "brfs",
                            "size": 0.67816025
                        }, {
                            "color": "#19c74f",
                            "label": "bufferjs",
                            "attributes": {},
                            "y": -852.70483,
                            "x": -1094.3876,
                            "id": "bufferjs",
                            "size": 0.98245513
                        }, {
                            "color": "#3419c7",
                            "label": "mongojs",
                            "attributes": {},
                            "y": 527.018,
                            "x": -839.6172,
                            "id": "mongojs",
                            "size": 1.1346025
                        }, {
                            "color": "#8419c7",
                            "label": "feedparser",
                            "attributes": {},
                            "y": 497.93576,
                            "x": -429.6493,
                            "id": "feedparser",
                            "size": 0.98245513
                        }, {
                            "color": "#c71919",
                            "label": "connect-xcors",
                            "attributes": {},
                            "y": 437.05307,
                            "x": -203.66441,
                            "id": "connect-xcors",
                            "size": 0.40429485
                        }, {
                            "color": "#19b9c7",
                            "label": "broadway",
                            "attributes": {},
                            "y": 683.59796,
                            "x": 1014.90295,
                            "id": "broadway",
                            "size": 0.64773077
                        }, {
                            "color": "#c719b9",
                            "label": "restify",
                            "attributes": {},
                            "y": 937.7202,
                            "x": -84.80429,
                            "id": "restify",
                            "size": 2.564788
                        }, {
                            "color": "#c79f19",
                            "label": "cliff",
                            "attributes": {},
                            "y": 465.76242,
                            "x": 1005.90594,
                            "id": "cliff",
                            "size": 0.95202565
                        }, {
                            "color": "#199fc7",
                            "label": "concat-stream",
                            "attributes": {},
                            "y": 804.2095,
                            "x": -39.16583,
                            "id": "concat-stream",
                            "size": 1.5910448
                        }, {
                            "color": "#69c719",
                            "label": "docopt",
                            "attributes": {},
                            "y": 185.8025,
                            "x": 237.28787,
                            "id": "docopt",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "JSONStream",
                            "attributes": {},
                            "y": 726.4061,
                            "x": 285.7015,
                            "id": "JSONStream",
                            "size": 1.9561987
                        }, {
                            "color": "#19c7b9",
                            "label": "merge",
                            "attributes": {},
                            "y": 247.26161,
                            "x": 1.9699359,
                            "id": "merge",
                            "size": 0.43472436
                        }, {
                            "color": "#19c719",
                            "label": "plist",
                            "attributes": {},
                            "y": 534.6398,
                            "x": -769.35736,
                            "id": "plist",
                            "size": 0.7390192
                        }, {
                            "color": "#c71969",
                            "label": "natural",
                            "attributes": {},
                            "y": -906.51306,
                            "x": -159.15141,
                            "id": "natural",
                            "size": 0.7998782
                        }, {
                            "color": "#9fc719",
                            "label": "cjson",
                            "attributes": {},
                            "y": -678.4876,
                            "x": 1057.1864,
                            "id": "cjson",
                            "size": 0.55644226
                        }, {
                            "color": "#c78419",
                            "label": "commondir",
                            "attributes": {},
                            "y": 465.1034,
                            "x": -184.05745,
                            "id": "commondir",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "convert-source-map",
                            "attributes": {},
                            "y": 402.94788,
                            "x": -249.03694,
                            "id": "convert-source-map",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "global",
                            "attributes": {},
                            "y": 729.27844,
                            "x": -729.46423,
                            "id": "global",
                            "size": 0.55644226
                        }, {
                            "color": "#199fc7",
                            "label": "map-stream",
                            "attributes": {},
                            "y": 929.72076,
                            "x": 303.13293,
                            "id": "map-stream",
                            "size": 0.7998782
                        }, {
                            "color": "#1984c7",
                            "label": "ecstatic",
                            "attributes": {},
                            "y": 315.07608,
                            "x": 215.21909,
                            "id": "ecstatic",
                            "size": 1.5301858
                        }, {
                            "color": "#199fc7",
                            "label": "process",
                            "attributes": {},
                            "y": 712.41925,
                            "x": -716.8126,
                            "id": "process",
                            "size": 0.55644226
                        }, {
                            "color": "#9f19c7",
                            "label": "ms",
                            "attributes": {},
                            "y": 124.84042,
                            "x": -896.667,
                            "id": "ms",
                            "size": 1.165032
                        }, {
                            "color": "#c71919",
                            "label": "useragent",
                            "attributes": {},
                            "y": 67.39527,
                            "x": 738.78033,
                            "id": "useragent",
                            "size": 1.1346025
                        }, {
                            "color": "#c71919",
                            "label": "colorful",
                            "attributes": {},
                            "y": -427.3014,
                            "x": -301.80933,
                            "id": "colorful",
                            "size": 0.67816025
                        }, {
                            "color": "#c79f19",
                            "label": "rmdir",
                            "attributes": {},
                            "y": 473.40564,
                            "x": -211.67924,
                            "id": "rmdir",
                            "size": 0.6173013
                        }, {
                            "color": "#c78419",
                            "label": "snockets",
                            "attributes": {},
                            "y": -572.307,
                            "x": -55.683994,
                            "id": "snockets",
                            "size": 1.0128845
                        }, {
                            "color": "#4f19c7",
                            "label": "soupselect",
                            "attributes": {},
                            "y": -568.26624,
                            "x": 82.975624,
                            "id": "soupselect",
                            "size": 0.6173013
                        }, {
                            "color": "#c78419",
                            "label": "mailer",
                            "attributes": {},
                            "y": -432.30478,
                            "x": 783.54236,
                            "id": "mailer",
                            "size": 0.70858973
                        }, {
                            "color": "#3419c7",
                            "label": "bson",
                            "attributes": {},
                            "y": 578.06537,
                            "x": -1087.7448,
                            "id": "bson",
                            "size": 0.64773077
                        }, {
                            "color": "#199fc7",
                            "label": "keygrip",
                            "attributes": {},
                            "y": 1415.7012,
                            "x": -306.24265,
                            "id": "keygrip",
                            "size": 0.67816025
                        }, {
                            "color": "#1919c7",
                            "label": "fibers",
                            "attributes": {},
                            "y": 221.70279,
                            "x": 1370.3695,
                            "id": "fibers",
                            "size": 1.5606153
                        }, {
                            "color": "#c71919",
                            "label": "archiver",
                            "attributes": {},
                            "y": 507.19348,
                            "x": -561.5876,
                            "id": "archiver",
                            "size": 0.76944876
                        }, {
                            "color": "#c71969",
                            "label": "aws2js",
                            "attributes": {},
                            "y": 67.3963,
                            "x": -71.76326,
                            "id": "aws2js",
                            "size": 0.7998782
                        }, {
                            "color": "#9f19c7",
                            "label": "websocket.io",
                            "attributes": {},
                            "y": -217.81973,
                            "x": -922.6484,
                            "id": "websocket.io",
                            "size": 0.4955833
                        }, {
                            "color": "#c7194f",
                            "label": "node-stringprep",
                            "attributes": {},
                            "y": -243.02711,
                            "x": 130.45053,
                            "id": "node-stringprep",
                            "size": 0.4651538
                        }, {
                            "color": "#19c79f",
                            "label": "reducers",
                            "attributes": {},
                            "y": -502.97894,
                            "x": -1274.6791,
                            "id": "reducers",
                            "size": 0.58687174
                        }, {
                            "color": "#19c79f",
                            "label": "reducible",
                            "attributes": {},
                            "y": -515.39526,
                            "x": -1286.8624,
                            "id": "reducible",
                            "size": 0.70858973
                        }, {
                            "color": "#19c769",
                            "label": "coffee-script-redux",
                            "attributes": {},
                            "y": -426.9769,
                            "x": 1172.5735,
                            "id": "coffee-script-redux",
                            "size": 0.58687174
                        }, {
                            "color": "#c78419",
                            "label": "source-map",
                            "attributes": {},
                            "y": -401.11676,
                            "x": 1097.5082,
                            "id": "source-map",
                            "size": 1.5606153
                        }, {
                            "color": "#c78419",
                            "label": "cssmin",
                            "attributes": {},
                            "y": -547.905,
                            "x": -586.3544,
                            "id": "cssmin",
                            "size": 0.4651538
                        }, {
                            "color": "#19b9c7",
                            "label": "stack-trace",
                            "attributes": {},
                            "y": 752.4155,
                            "x": 786.0242,
                            "id": "stack-trace",
                            "size": 1.043314
                        }, {
                            "color": "#19b9c7",
                            "label": "logmagic",
                            "attributes": {},
                            "y": -117.18427,
                            "x": -215.80826,
                            "id": "logmagic",
                            "size": 0.43472436
                        }, {
                            "color": "#9f19c7",
                            "label": "string-to-js",
                            "attributes": {},
                            "y": 364.86655,
                            "x": 76.84316,
                            "id": "string-to-js",
                            "size": 0.40429485
                        }, {
                            "color": "#c78419",
                            "label": "uglifycss",
                            "attributes": {},
                            "y": -300.3197,
                            "x": -238.5077,
                            "id": "uglifycss",
                            "size": 0.67816025
                        }, {
                            "color": "#19c74f",
                            "label": "passerror",
                            "attributes": {},
                            "y": 369.9193,
                            "x": -258.02805,
                            "id": "passerror",
                            "size": 0.40429485
                        }, {
                            "color": "#19c74f",
                            "label": "time",
                            "attributes": {},
                            "y": 1.9313185,
                            "x": -998.3049,
                            "id": "time",
                            "size": 0.55644226
                        }, {
                            "color": "#c78419",
                            "label": "coco",
                            "attributes": {},
                            "y": 243.6456,
                            "x": 25.135742,
                            "id": "coco",
                            "size": 0.40429485
                        }, {
                            "color": "#19b9c7",
                            "label": "eyes",
                            "attributes": {},
                            "y": 484.3233,
                            "x": 1062.8107,
                            "id": "eyes",
                            "size": 2.564788
                        }, {
                            "color": "#19c784",
                            "label": "cson",
                            "attributes": {},
                            "y": -1017.48755,
                            "x": 8.207783,
                            "id": "cson",
                            "size": 0.4955833
                        }, {
                            "color": "#c71984",
                            "label": "resourceful",
                            "attributes": {},
                            "y": 617.45764,
                            "x": 230.89415,
                            "id": "resourceful",
                            "size": 0.70858973
                        }, {
                            "color": "#194fc7",
                            "label": "execSync",
                            "attributes": {},
                            "y": -35.15042,
                            "x": -1274.4426,
                            "id": "execSync",
                            "size": 0.76944876
                        }, {
                            "color": "#c78419",
                            "label": "loader-utils",
                            "attributes": {},
                            "y": -1141.6609,
                            "x": 569.31177,
                            "id": "loader-utils",
                            "size": 0.58687174
                        }, {
                            "color": "#c719b9",
                            "label": "lazy",
                            "attributes": {},
                            "y": 565.9527,
                            "x": 1158.8604,
                            "id": "lazy",
                            "size": 1.2563205
                        }, {
                            "color": "#34c719",
                            "label": "assert-plus",
                            "attributes": {},
                            "y": 1075.4281,
                            "x": 86.17554,
                            "id": "assert-plus",
                            "size": 1.0737435
                        }, {
                            "color": "#c719b9",
                            "label": "node-int64",
                            "attributes": {},
                            "y": 321.1519,
                            "x": 123.714005,
                            "id": "node-int64",
                            "size": 0.40429485
                        }, {
                            "color": "#1919c7",
                            "label": "wd",
                            "attributes": {},
                            "y": -229.05304,
                            "x": -143.04478,
                            "id": "wd",
                            "size": 1.3171794
                        }, {
                            "color": "#34c719",
                            "label": "dtrace-provider",
                            "attributes": {},
                            "y": 1149.9846,
                            "x": 67.68434,
                            "id": "dtrace-provider",
                            "size": 0.4651538
                        }, {
                            "color": "#1919c7",
                            "label": "buster-core",
                            "attributes": {},
                            "y": 174.64687,
                            "x": -2.8802125,
                            "id": "buster-core",
                            "size": 0.76944876
                        }, {
                            "color": "#c78419",
                            "label": "iconv-lite",
                            "attributes": {},
                            "y": 252.77287,
                            "x": -305.2421,
                            "id": "iconv-lite",
                            "size": 2.169205
                        }, {
                            "color": "#c78419",
                            "label": "fs-watch-tree",
                            "attributes": {},
                            "y": -805.3652,
                            "x": -863.2866,
                            "id": "fs-watch-tree",
                            "size": 0.43472436
                        }, {
                            "color": "#c719b9",
                            "label": "cookiejar",
                            "attributes": {},
                            "y": 543.63135,
                            "x": -885.83795,
                            "id": "cookiejar",
                            "size": 0.43472436
                        }, {
                            "color": "#19c7b9",
                            "label": "glob-whatev",
                            "attributes": {},
                            "y": -364.26727,
                            "x": 925.2539,
                            "id": "glob-whatev",
                            "size": 0.58687174
                        }, {
                            "color": "#c719b9",
                            "label": "hapi",
                            "attributes": {},
                            "y": 288.86652,
                            "x": 322.17715,
                            "id": "hapi",
                            "size": 0.8607372
                        }, {
                            "color": "#c79f19",
                            "label": "humanize",
                            "attributes": {},
                            "y": -237.40352,
                            "x": 9.4212,
                            "id": "humanize",
                            "size": 0.43472436
                        }, {
                            "color": "#19c719",
                            "label": "pretty-data",
                            "attributes": {},
                            "y": 520.63293,
                            "x": -202.25743,
                            "id": "pretty-data",
                            "size": 0.4955833
                        }, {
                            "color": "#9f19c7",
                            "label": "printf",
                            "attributes": {},
                            "y": -842.82385,
                            "x": 321.60583,
                            "id": "printf",
                            "size": 0.52601284
                        }, {
                            "color": "#1934c7",
                            "label": "fairmont",
                            "attributes": {},
                            "y": -192.92662,
                            "x": -29.472069,
                            "id": "fairmont",
                            "size": 0.43472436
                        }, {
                            "color": "#c7b919",
                            "label": "typescript",
                            "attributes": {},
                            "y": 451.12564,
                            "x": -113.66281,
                            "id": "typescript",
                            "size": 0.58687174
                        }, {
                            "color": "#19c7b9",
                            "label": "chokidar",
                            "attributes": {},
                            "y": -143.56265,
                            "x": -320.56717,
                            "id": "chokidar",
                            "size": 2.169205
                        }, {
                            "color": "#c71984",
                            "label": "node_hash",
                            "attributes": {},
                            "y": -126.50663,
                            "x": -151.39897,
                            "id": "node_hash",
                            "size": 0.4955833
                        }, {
                            "color": "#b9c719",
                            "label": "imap",
                            "attributes": {},
                            "y": 155.15096,
                            "x": -360.41003,
                            "id": "imap",
                            "size": 0.6173013
                        }, {
                            "color": "#9fc719",
                            "label": "password-hash",
                            "attributes": {},
                            "y": -632.2503,
                            "x": 94.21731,
                            "id": "password-hash",
                            "size": 0.40429485
                        }, {
                            "color": "#c78419",
                            "label": "coffeecup",
                            "attributes": {},
                            "y": -872.26465,
                            "x": -216.88039,
                            "id": "coffeecup",
                            "size": 0.7390192
                        }, {
                            "color": "#4fc719",
                            "label": "libprotein",
                            "attributes": {},
                            "y": -91.98003,
                            "x": -253.22894,
                            "id": "libprotein",
                            "size": 0.4651538
                        }, {
                            "color": "#19c7b9",
                            "label": "js-yaml",
                            "attributes": {},
                            "y": -631.6599,
                            "x": 761.8784,
                            "id": "js-yaml",
                            "size": 5.2121534
                        }, {
                            "color": "#c71919",
                            "label": "dustjs-linkedin",
                            "attributes": {},
                            "y": -43.070652,
                            "x": 271.35666,
                            "id": "dustjs-linkedin",
                            "size": 1.6519039
                        }, {
                            "color": "#1984c7",
                            "label": "deep-extend",
                            "attributes": {},
                            "y": 317.19928,
                            "x": 976.4367,
                            "id": "deep-extend",
                            "size": 0.58687174
                        }, {
                            "color": "#1969c7",
                            "label": "jquery-component",
                            "attributes": {},
                            "y": 406.12448,
                            "x": -189.71065,
                            "id": "jquery-component",
                            "size": 0.4955833
                        }, {
                            "color": "#b919c7",
                            "label": "jeesh",
                            "attributes": {},
                            "y": -1262.0615,
                            "x": -1080.7123,
                            "id": "jeesh",
                            "size": 0.52601284
                        }, {
                            "color": "#c71919",
                            "label": "everyauth",
                            "attributes": {},
                            "y": 365.4934,
                            "x": -683.33185,
                            "id": "everyauth",
                            "size": 0.7998782
                        }, {
                            "color": "#19c719",
                            "label": "node-xml",
                            "attributes": {},
                            "y": -713.54456,
                            "x": -311.38135,
                            "id": "node-xml",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "sanitizer",
                            "attributes": {},
                            "y": 242.19066,
                            "x": -355.07367,
                            "id": "sanitizer",
                            "size": 0.4955833
                        }, {
                            "color": "#69c719",
                            "label": "prelude-ls",
                            "attributes": {},
                            "y": 1009.4159,
                            "x": -703.39124,
                            "id": "prelude-ls",
                            "size": 0.70858973
                        }, {
                            "color": "#c78419",
                            "label": "sqwish",
                            "attributes": {},
                            "y": -771.2408,
                            "x": 393.27988,
                            "id": "sqwish",
                            "size": 0.70858973
                        }, {
                            "color": "#c7b919",
                            "label": "temporary",
                            "attributes": {},
                            "y": 399.0136,
                            "x": 878.17725,
                            "id": "temporary",
                            "size": 0.8911666
                        }, {
                            "color": "#4f19c7",
                            "label": "opts",
                            "attributes": {},
                            "y": 278.39178,
                            "x": -379.19516,
                            "id": "opts",
                            "size": 0.55644226
                        }, {
                            "color": "#84c719",
                            "label": "drip",
                            "attributes": {},
                            "y": -305.52167,
                            "x": -102.83262,
                            "id": "drip",
                            "size": 0.64773077
                        }, {
                            "color": "#84c719",
                            "label": "sherlock",
                            "attributes": {},
                            "y": 137.86107,
                            "x": 272.0998,
                            "id": "sherlock",
                            "size": 0.4651538
                        }, {
                            "color": "#194fc7",
                            "label": "deferred",
                            "attributes": {},
                            "y": -1267.6863,
                            "x": 55.40451,
                            "id": "deferred",
                            "size": 0.8607372
                        }, {
                            "color": "#194fc7",
                            "label": "es5-ext",
                            "attributes": {},
                            "y": -1268.802,
                            "x": 77.727,
                            "id": "es5-ext",
                            "size": 0.67816025
                        }, {
                            "color": "#c71969",
                            "label": "postal",
                            "attributes": {},
                            "y": -829.2972,
                            "x": -171.42653,
                            "id": "postal",
                            "size": 0.43472436
                        }, {
                            "color": "#c71919",
                            "label": "jspack",
                            "attributes": {},
                            "y": 198.374,
                            "x": 48.071236,
                            "id": "jspack",
                            "size": 0.52601284
                        }, {
                            "color": "#c7194f",
                            "label": "sphericalmercator",
                            "attributes": {},
                            "y": -296.1046,
                            "x": -46.726612,
                            "id": "sphericalmercator",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "xml",
                            "attributes": {},
                            "y": 101.8597,
                            "x": -532.62463,
                            "id": "xml",
                            "size": 0.52601284
                        }, {
                            "color": "#19c74f",
                            "label": "ahr2",
                            "attributes": {},
                            "y": -875.5225,
                            "x": -1099.1768,
                            "id": "ahr2",
                            "size": 0.70858973
                        }, {
                            "color": "#199fc7",
                            "label": "negotiator",
                            "attributes": {},
                            "y": 604.249,
                            "x": 149.55948,
                            "id": "negotiator",
                            "size": 0.52601284
                        }, {
                            "color": "#c719b9",
                            "label": "thrift",
                            "attributes": {},
                            "y": 291.87094,
                            "x": 5.0832486,
                            "id": "thrift",
                            "size": 0.4955833
                        }, {
                            "color": "#19c719",
                            "label": "source-map-support",
                            "attributes": {},
                            "y": -422.4552,
                            "x": 1104.8613,
                            "id": "source-map-support",
                            "size": 0.58687174
                        }, {
                            "color": "#19b9c7",
                            "label": "cycle",
                            "attributes": {},
                            "y": 779.6143,
                            "x": 812.88934,
                            "id": "cycle",
                            "size": 0.40429485
                        }, {
                            "color": "#c7194f",
                            "label": "sqlite3",
                            "attributes": {},
                            "y": 496.06732,
                            "x": -256.83957,
                            "id": "sqlite3",
                            "size": 2.0170577
                        }, {
                            "color": "#8419c7",
                            "label": "xmlbuilder",
                            "attributes": {},
                            "y": 471.48856,
                            "x": -699.2409,
                            "id": "xmlbuilder",
                            "size": 1.6214744
                        }, {
                            "color": "#c719b9",
                            "label": "amqp",
                            "attributes": {},
                            "y": 260.00815,
                            "x": 153.61894,
                            "id": "amqp",
                            "size": 1.986628
                        }, {
                            "color": "#19c769",
                            "label": "needle",
                            "attributes": {},
                            "y": 372.77905,
                            "x": -401.42374,
                            "id": "needle",
                            "size": 0.55644226
                        }, {
                            "color": "#19c74f",
                            "label": "stream-stack",
                            "attributes": {},
                            "y": -184.47614,
                            "x": 40.362274,
                            "id": "stream-stack",
                            "size": 0.40429485
                        }, {
                            "color": "#199fc7",
                            "label": "read-stream",
                            "attributes": {},
                            "y": 631.4286,
                            "x": -648.8073,
                            "id": "read-stream",
                            "size": 0.55644226
                        }, {
                            "color": "#199fc7",
                            "label": "write-stream",
                            "attributes": {},
                            "y": 519.99194,
                            "x": -549.48267,
                            "id": "write-stream",
                            "size": 0.52601284
                        }, {
                            "color": "#199fc7",
                            "label": "ap",
                            "attributes": {},
                            "y": 446.58817,
                            "x": -144.28262,
                            "id": "ap",
                            "size": 0.67816025
                        }, {
                            "color": "#19c74f",
                            "label": "future",
                            "attributes": {},
                            "y": -867.01746,
                            "x": -1071.5906,
                            "id": "future",
                            "size": 0.4651538
                        }, {
                            "color": "#19c74f",
                            "label": "sequence",
                            "attributes": {},
                            "y": -713.06415,
                            "x": 365.48837,
                            "id": "sequence",
                            "size": 0.43472436
                        }, {
                            "color": "#9fc719",
                            "label": "extend",
                            "attributes": {},
                            "y": 263.66006,
                            "x": 105.55116,
                            "id": "extend",
                            "size": 1.7127627
                        }, {
                            "color": "#b9c719",
                            "label": "fetch",
                            "attributes": {},
                            "y": -73.16297,
                            "x": -346.91745,
                            "id": "fetch",
                            "size": 0.43472436
                        }, {
                            "color": "#19c719",
                            "label": "wordwrap",
                            "attributes": {},
                            "y": -227.00159,
                            "x": 1031.0585,
                            "id": "wordwrap",
                            "size": 0.8911666
                        }, {
                            "color": "#8419c7",
                            "label": "line-reader",
                            "attributes": {},
                            "y": -127.01337,
                            "x": -249.51375,
                            "id": "line-reader",
                            "size": 0.40429485
                        }, {
                            "color": "#c719b9",
                            "label": "sockjs",
                            "attributes": {},
                            "y": 837.4435,
                            "x": -511.7771,
                            "id": "sockjs",
                            "size": 1.3780384
                        }, {
                            "color": "#9f19c7",
                            "label": "engine.io",
                            "attributes": {},
                            "y": -210.20392,
                            "x": -906.73157,
                            "id": "engine.io",
                            "size": 0.95202565
                        }, {
                            "color": "#199fc7",
                            "label": "crdt",
                            "attributes": {},
                            "y": 947.0767,
                            "x": 442.64102,
                            "id": "crdt",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "mux-demux",
                            "attributes": {},
                            "y": 1019.63727,
                            "x": 235.80574,
                            "id": "mux-demux",
                            "size": 0.8607372
                        }, {
                            "color": "#194fc7",
                            "label": "check-types",
                            "attributes": {},
                            "y": 269.9921,
                            "x": 48.660164,
                            "id": "check-types",
                            "size": 0.52601284
                        }, {
                            "color": "#c71969",
                            "label": "tunnel",
                            "attributes": {},
                            "y": -404.86826,
                            "x": -263.88354,
                            "id": "tunnel",
                            "size": 0.4651538
                        }, {
                            "color": "#8419c7",
                            "label": "devnull",
                            "attributes": {},
                            "y": -331.34488,
                            "x": 703.6627,
                            "id": "devnull",
                            "size": 0.43472436
                        }, {
                            "color": "#c7b919",
                            "label": "d3",
                            "attributes": {},
                            "y": -284.5455,
                            "x": -825.9526,
                            "id": "d3",
                            "size": 0.98245513
                        }, {
                            "color": "#9fc719",
                            "label": "ursa",
                            "attributes": {},
                            "y": 386.29645,
                            "x": 26.145437,
                            "id": "ursa",
                            "size": 0.58687174
                        }, {
                            "color": "#b919c7",
                            "label": "valentine",
                            "attributes": {},
                            "y": 134.40224,
                            "x": -344.4175,
                            "id": "valentine",
                            "size": 0.4651538
                        }, {
                            "color": "#b9c719",
                            "label": "posix",
                            "attributes": {},
                            "y": 338.36703,
                            "x": -291.90344,
                            "id": "posix",
                            "size": 0.43472436
                        }, {
                            "color": "#199fc7",
                            "label": "twitter",
                            "attributes": {},
                            "y": 1405.1498,
                            "x": -266.97806,
                            "id": "twitter",
                            "size": 0.4955833
                        }, {
                            "color": "#c7194f",
                            "label": "tav",
                            "attributes": {},
                            "y": 474.78238,
                            "x": -155.47731,
                            "id": "tav",
                            "size": 0.40429485
                        }, {
                            "color": "#1984c7",
                            "label": "expresso",
                            "attributes": {},
                            "y": 323.57846,
                            "x": 53.00957,
                            "id": "expresso",
                            "size": 0.43472436
                        }, {
                            "color": "#c71919",
                            "label": "less-middleware",
                            "attributes": {},
                            "y": -306.3249,
                            "x": 79.35592,
                            "id": "less-middleware",
                            "size": 1.1954615
                        }, {
                            "color": "#c71919",
                            "label": "i18n",
                            "attributes": {},
                            "y": -98.362976,
                            "x": -999.24835,
                            "id": "i18n",
                            "size": 0.64773077
                        }, {
                            "color": "#19c7b9",
                            "label": "deepmerge",
                            "attributes": {},
                            "y": -325.44296,
                            "x": -307.36197,
                            "id": "deepmerge",
                            "size": 0.67816025
                        }, {
                            "color": "#19c74f",
                            "label": "pushover",
                            "attributes": {},
                            "y": 263.17816,
                            "x": 434.1828,
                            "id": "pushover",
                            "size": 0.6173013
                        }, {
                            "color": "#199fc7",
                            "label": "wru",
                            "attributes": {},
                            "y": -353.93207,
                            "x": -288.18814,
                            "id": "wru",
                            "size": 0.40429485
                        }, {
                            "color": "#19c7b9",
                            "label": "fs-tools",
                            "attributes": {},
                            "y": -228.75322,
                            "x": 141.40994,
                            "id": "fs-tools",
                            "size": 0.55644226
                        }, {
                            "color": "#1984c7",
                            "label": "xregexp",
                            "attributes": {},
                            "y": 905.34344,
                            "x": -812.6837,
                            "id": "xregexp",
                            "size": 0.8911666
                        }, {
                            "color": "#c71919",
                            "label": "config",
                            "attributes": {},
                            "y": -228.0563,
                            "x": -316.3829,
                            "id": "config",
                            "size": 1.225891
                        }, {
                            "color": "#1984c7",
                            "label": "cron",
                            "attributes": {},
                            "y": 183.46445,
                            "x": -313.95187,
                            "id": "cron",
                            "size": 1.28675
                        }, {
                            "color": "#19c7b9",
                            "label": "carrier",
                            "attributes": {},
                            "y": 363.87253,
                            "x": -339.49533,
                            "id": "carrier",
                            "size": 0.83030766
                        }, {
                            "color": "#1969c7",
                            "label": "classes-component",
                            "attributes": {},
                            "y": -257.2873,
                            "x": -265.0465,
                            "id": "classes-component",
                            "size": 0.4651538
                        }, {
                            "color": "#c71919",
                            "label": "hbs",
                            "attributes": {},
                            "y": -499.19263,
                            "x": 633.9885,
                            "id": "hbs",
                            "size": 0.76944876
                        }, {
                            "color": "#c71919",
                            "label": "iced-coffee-script",
                            "attributes": {},
                            "y": 271.1939,
                            "x": -351.02173,
                            "id": "iced-coffee-script",
                            "size": 1.0128845
                        }, {
                            "color": "#19c719",
                            "label": "color",
                            "attributes": {},
                            "y": -103.35395,
                            "x": -286.06134,
                            "id": "color",
                            "size": 0.58687174
                        }, {
                            "color": "#8419c7",
                            "label": "follow",
                            "attributes": {},
                            "y": 164.50044,
                            "x": -68.12239,
                            "id": "follow",
                            "size": 0.76944876
                        }, {
                            "color": "#9f19c7",
                            "label": "node-proxy",
                            "attributes": {},
                            "y": 195.5393,
                            "x": -800.92053,
                            "id": "node-proxy",
                            "size": 0.76944876
                        }, {
                            "color": "#c7b919",
                            "label": "phantomjs",
                            "attributes": {},
                            "y": 152.25127,
                            "x": 876.6572,
                            "id": "phantomjs",
                            "size": 1.7431923
                        }, {
                            "color": "#1984c7",
                            "label": "cloneextend",
                            "attributes": {},
                            "y": -229.28201,
                            "x": 102.871826,
                            "id": "cloneextend",
                            "size": 0.70858973
                        }, {
                            "color": "#c71919",
                            "label": "tracer",
                            "attributes": {},
                            "y": -422.93143,
                            "x": 542.50507,
                            "id": "tracer",
                            "size": 0.58687174
                        }, {
                            "color": "#9f19c7",
                            "label": "axon",
                            "attributes": {},
                            "y": -85.857155,
                            "x": -931.0856,
                            "id": "axon",
                            "size": 0.83030766
                        }, {
                            "color": "#c76919",
                            "label": "nssocket",
                            "attributes": {},
                            "y": 535.05194,
                            "x": 1203.0873,
                            "id": "nssocket",
                            "size": 0.55644226
                        }, {
                            "color": "#1984c7",
                            "label": "dropbox",
                            "attributes": {},
                            "y": -1175.9393,
                            "x": -360.20236,
                            "id": "dropbox",
                            "size": 0.4651538
                        }, {
                            "color": "#c719b9",
                            "label": "dirty",
                            "attributes": {},
                            "y": 423.41846,
                            "x": -299.88483,
                            "id": "dirty",
                            "size": 1.1346025
                        }, {
                            "color": "#c719b9",
                            "label": "json-schema",
                            "attributes": {},
                            "y": 157.80661,
                            "x": -302.5626,
                            "id": "json-schema",
                            "size": 0.95202565
                        }, {
                            "color": "#c719b9",
                            "label": "fileops",
                            "attributes": {},
                            "y": -329.38306,
                            "x": 137.90787,
                            "id": "fileops",
                            "size": 0.6173013
                        }, {
                            "color": "#c71919",
                            "label": "cluster",
                            "attributes": {},
                            "y": -411.9638,
                            "x": 159.38046,
                            "id": "cluster",
                            "size": 0.52601284
                        }, {
                            "color": "#c71969",
                            "label": "data2xml",
                            "attributes": {},
                            "y": 437.87564,
                            "x": -174.35355,
                            "id": "data2xml",
                            "size": 1.28675
                        }, {
                            "color": "#c71969",
                            "label": "aws-lib",
                            "attributes": {},
                            "y": 426.57806,
                            "x": -553.01654,
                            "id": "aws-lib",
                            "size": 0.8607372
                        }, {
                            "color": "#1984c7",
                            "label": "node-phantom",
                            "attributes": {},
                            "y": 148.08284,
                            "x": -739.18555,
                            "id": "node-phantom",
                            "size": 0.67816025
                        }, {
                            "color": "#8419c7",
                            "label": "MD5",
                            "attributes": {},
                            "y": -125.08657,
                            "x": -299.09158,
                            "id": "MD5",
                            "size": 1.28675
                        }, {
                            "color": "#c71919",
                            "label": "gzippo",
                            "attributes": {},
                            "y": -2.3343637,
                            "x": -802.20013,
                            "id": "gzippo",
                            "size": 0.4651538
                        }, {
                            "color": "#34c719",
                            "label": "extsprintf",
                            "attributes": {},
                            "y": 1132.2307,
                            "x": -342.06006,
                            "id": "extsprintf",
                            "size": 0.40429485
                        }, {
                            "color": "#34c719",
                            "label": "verror",
                            "attributes": {},
                            "y": 1140.7922,
                            "x": -322.61658,
                            "id": "verror",
                            "size": 0.43472436
                        }, {
                            "color": "#1919c7",
                            "label": "expect.js",
                            "attributes": {},
                            "y": 397.88303,
                            "x": -275.31586,
                            "id": "expect.js",
                            "size": 0.92159617
                        }, {
                            "color": "#c71919",
                            "label": "slug",
                            "attributes": {},
                            "y": 352.22522,
                            "x": 137.75543,
                            "id": "slug",
                            "size": 0.4651538
                        }, {
                            "color": "#19c719",
                            "label": "diff",
                            "attributes": {},
                            "y": 200.05052,
                            "x": 422.92963,
                            "id": "diff",
                            "size": 0.7390192
                        }, {
                            "color": "#1984c7",
                            "label": "gravatar",
                            "attributes": {},
                            "y": 358.5257,
                            "x": -313.8026,
                            "id": "gravatar",
                            "size": 0.4651538
                        }, {
                            "color": "#19c7b9",
                            "label": "dox",
                            "attributes": {},
                            "y": -780.07043,
                            "x": -568.47504,
                            "id": "dox",
                            "size": 1.1041731
                        }, {
                            "color": "#b919c7",
                            "label": "reqwest",
                            "attributes": {},
                            "y": -53.65022,
                            "x": -178.76468,
                            "id": "reqwest",
                            "size": 0.52601284
                        }, {
                            "color": "#b919c7",
                            "label": "qwery",
                            "attributes": {},
                            "y": -1192.8473,
                            "x": -1008.4534,
                            "id": "qwery",
                            "size": 0.67816025
                        }, {
                            "color": "#b919c7",
                            "label": "domready",
                            "attributes": {},
                            "y": -1242.8838,
                            "x": -1106.5486,
                            "id": "domready",
                            "size": 1.043314
                        }, {
                            "color": "#8419c7",
                            "label": "openid",
                            "attributes": {},
                            "y": 412.59,
                            "x": -744.5368,
                            "id": "openid",
                            "size": 0.52601284
                        }, {
                            "color": "#c74f19",
                            "label": "longjohn",
                            "attributes": {},
                            "y": 211.15984,
                            "x": 1253.4175,
                            "id": "longjohn",
                            "size": 0.58687174
                        }, {
                            "color": "#c78419",
                            "label": "node-sass",
                            "attributes": {},
                            "y": -105.74819,
                            "x": 565.4153,
                            "id": "node-sass",
                            "size": 1.0128845
                        }, {
                            "color": "#8419c7",
                            "label": "entities",
                            "attributes": {},
                            "y": -421.44012,
                            "x": -378.36694,
                            "id": "entities",
                            "size": 0.58687174
                        }, {
                            "color": "#8419c7",
                            "label": "css-parse",
                            "attributes": {},
                            "y": 1261.7021,
                            "x": 133.59259,
                            "id": "css-parse",
                            "size": 0.55644226
                        }, {
                            "color": "#69c719",
                            "label": "collections",
                            "attributes": {},
                            "y": -89.36993,
                            "x": -560.28796,
                            "id": "collections",
                            "size": 0.43472436
                        }, {
                            "color": "#1984c7",
                            "label": "gm",
                            "attributes": {},
                            "y": 313.9868,
                            "x": -312.90167,
                            "id": "gm",
                            "size": 1.986628
                        }, {
                            "color": "#c7194f",
                            "label": "comb",
                            "attributes": {},
                            "y": 298.83356,
                            "x": 43.5338,
                            "id": "comb",
                            "size": 0.43472436
                        }, {
                            "color": "#199fc7",
                            "label": "routes",
                            "attributes": {},
                            "y": -336.05746,
                            "x": -69.0418,
                            "id": "routes",
                            "size": 0.83030766
                        }, {
                            "color": "#c78419",
                            "label": "node-log",
                            "attributes": {},
                            "y": -626.0221,
                            "x": 393.26965,
                            "id": "node-log",
                            "size": 0.4651538
                        }, {
                            "color": "#9f19c7",
                            "label": "component-builder",
                            "attributes": {},
                            "y": -222.94373,
                            "x": -186.5061,
                            "id": "component-builder",
                            "size": 0.70858973
                        }, {
                            "color": "#199fc7",
                            "label": "hyperquest",
                            "attributes": {},
                            "y": 825.61273,
                            "x": 282.46597,
                            "id": "hyperquest",
                            "size": 1.165032
                        }, {
                            "color": "#19c7b9",
                            "label": "win-spawn",
                            "attributes": {},
                            "y": -140.79959,
                            "x": -276.95242,
                            "id": "win-spawn",
                            "size": 0.58687174
                        }, {
                            "color": "#c79f19",
                            "label": "graphviz",
                            "attributes": {},
                            "y": 162.88615,
                            "x": 1070.9303,
                            "id": "graphviz",
                            "size": 0.4651538
                        }, {
                            "color": "#c78419",
                            "label": "yaml-js",
                            "attributes": {},
                            "y": -481.71786,
                            "x": -319.28323,
                            "id": "yaml-js",
                            "size": 0.4651538
                        }, {
                            "color": "#c78419",
                            "label": "get",
                            "attributes": {},
                            "y": 233.56311,
                            "x": 150.1213,
                            "id": "get",
                            "size": 0.43472436
                        }, {
                            "color": "#c79f19",
                            "label": "kew",
                            "attributes": {},
                            "y": 184.67331,
                            "x": 922.88745,
                            "id": "kew",
                            "size": 0.76944876
                        }, {
                            "color": "#c71919",
                            "label": "pause",
                            "attributes": {},
                            "y": 1019.8613,
                            "x": 101.822105,
                            "id": "pause",
                            "size": 0.4955833
                        }, {
                            "color": "#199fc7",
                            "label": "levelup",
                            "attributes": {},
                            "y": 714.339,
                            "x": -101.48984,
                            "id": "levelup",
                            "size": 1.7431923
                        }, {
                            "color": "#199fc7",
                            "label": "msgpack-js",
                            "attributes": {},
                            "y": 1044.0156,
                            "x": -577.04565,
                            "id": "msgpack-js",
                            "size": 0.55644226
                        }, {
                            "color": "#c78419",
                            "label": "mincer",
                            "attributes": {},
                            "y": -335.08432,
                            "x": 192.89568,
                            "id": "mincer",
                            "size": 0.6173013
                        }, {
                            "color": "#c71919",
                            "label": "mongolian",
                            "attributes": {},
                            "y": 357.0469,
                            "x": -278.67535,
                            "id": "mongolian",
                            "size": 0.58687174
                        }, {
                            "color": "#c71969",
                            "label": "riak-js",
                            "attributes": {},
                            "y": 109.45611,
                            "x": -554.1743,
                            "id": "riak-js",
                            "size": 0.67816025
                        }, {
                            "color": "#19c719",
                            "label": "JSONSelect",
                            "attributes": {},
                            "y": -674.25793,
                            "x": 1032.245,
                            "id": "JSONSelect",
                            "size": 0.43472436
                        }, {
                            "color": "#c71919",
                            "label": "spdy",
                            "attributes": {},
                            "y": 969.4349,
                            "x": -195.11647,
                            "id": "spdy",
                            "size": 0.4651538
                        }, {
                            "color": "#c7b919",
                            "label": "mout",
                            "attributes": {},
                            "y": -462.46005,
                            "x": 62.060043,
                            "id": "mout",
                            "size": 0.70858973
                        }, {
                            "color": "#4f19c7",
                            "label": "jQuery",
                            "attributes": {},
                            "y": -330.18433,
                            "x": -245.54166,
                            "id": "jQuery",
                            "size": 0.52601284
                        }, {
                            "color": "#4f19c7",
                            "label": "contextify",
                            "attributes": {},
                            "y": -187.65944,
                            "x": -967.41296,
                            "id": "contextify",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "level-sublevel",
                            "attributes": {},
                            "y": 989.98175,
                            "x": 8.113629,
                            "id": "level-sublevel",
                            "size": 0.98245513
                        }, {
                            "color": "#199fc7",
                            "label": "tape",
                            "attributes": {},
                            "y": 783.2846,
                            "x": 277.2358,
                            "id": "tape",
                            "size": 0.76944876
                        }, {
                            "color": "#19c7b9",
                            "label": "urllib",
                            "attributes": {},
                            "y": -233.95155,
                            "x": -80.95783,
                            "id": "urllib",
                            "size": 0.52601284
                        }, {
                            "color": "#199fc7",
                            "label": "duplex",
                            "attributes": {},
                            "y": 1108.3147,
                            "x": 320.11743,
                            "id": "duplex",
                            "size": 0.67816025
                        }, {
                            "color": "#c71919",
                            "label": "dustjs-helpers",
                            "attributes": {},
                            "y": -261.29047,
                            "x": -302.44653,
                            "id": "dustjs-helpers",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "base64",
                            "attributes": {},
                            "y": -139.1424,
                            "x": -203.06262,
                            "id": "base64",
                            "size": 0.52601284
                        }, {
                            "color": "#c79f19",
                            "label": "elementtree",
                            "attributes": {},
                            "y": 637.6989,
                            "x": -549.07086,
                            "id": "elementtree",
                            "size": 0.52601284
                        }, {
                            "color": "#69c719",
                            "label": "test",
                            "attributes": {},
                            "y": -1007.59406,
                            "x": -665.63513,
                            "id": "test",
                            "size": 0.58687174
                        }, {
                            "color": "#c71969",
                            "label": "i",
                            "attributes": {},
                            "y": 701.9958,
                            "x": 439.42538,
                            "id": "i",
                            "size": 0.52601284
                        }, {
                            "color": "#1984c7",
                            "label": "ftp",
                            "attributes": {},
                            "y": 910.1776,
                            "x": -803.49304,
                            "id": "ftp",
                            "size": 0.64773077
                        }, {
                            "color": "#1984c7",
                            "label": "eyespect",
                            "attributes": {},
                            "y": -228.91646,
                            "x": -367.09158,
                            "id": "eyespect",
                            "size": 1.5606153
                        }, {
                            "color": "#1984c7",
                            "label": "required-keys",
                            "attributes": {},
                            "y": -232.21452,
                            "x": -286.83685,
                            "id": "required-keys",
                            "size": 3.2038076
                        }, {
                            "color": "#8419c7",
                            "label": "defaultable",
                            "attributes": {},
                            "y": 280.47433,
                            "x": 72.49314,
                            "id": "defaultable",
                            "size": 0.4955833
                        }, {
                            "color": "#19c719",
                            "label": "node-inspector",
                            "attributes": {},
                            "y": 167.67815,
                            "x": -547.4956,
                            "id": "node-inspector",
                            "size": 0.4955833
                        }, {
                            "color": "#c71919",
                            "label": "portscanner",
                            "attributes": {},
                            "y": 131.61783,
                            "x": 103.87312,
                            "id": "portscanner",
                            "size": 0.58687174
                        }, {
                            "color": "#c78419",
                            "label": "burrito",
                            "attributes": {},
                            "y": -825.43256,
                            "x": 397.68042,
                            "id": "burrito",
                            "size": 0.67816025
                        }, {
                            "color": "#b9c719",
                            "label": "crafity-jstest",
                            "attributes": {},
                            "y": 9.04491,
                            "x": -371.97717,
                            "id": "crafity-jstest",
                            "size": 0.4955833
                        }, {
                            "color": "#19c719",
                            "label": "mu2",
                            "attributes": {},
                            "y": 408.01105,
                            "x": -118.72287,
                            "id": "mu2",
                            "size": 0.7998782
                        }, {
                            "color": "#199fc7",
                            "label": "trumpet",
                            "attributes": {},
                            "y": 707.18274,
                            "x": 125.280426,
                            "id": "trumpet",
                            "size": 0.58687174
                        }, {
                            "color": "#9f19c7",
                            "label": "ref",
                            "attributes": {},
                            "y": -118.67814,
                            "x": -1197.3179,
                            "id": "ref",
                            "size": 0.98245513
                        }, {
                            "color": "#9f19c7",
                            "label": "ref-struct",
                            "attributes": {},
                            "y": -88.6764,
                            "x": -1152.9425,
                            "id": "ref-struct",
                            "size": 0.64773077
                        }, {
                            "color": "#9f19c7",
                            "label": "ffi",
                            "attributes": {},
                            "y": -37.738617,
                            "x": -1253.4946,
                            "id": "ffi",
                            "size": 0.83030766
                        }, {
                            "color": "#194fc7",
                            "label": "promise",
                            "attributes": {},
                            "y": -660.9082,
                            "x": -798.1094,
                            "id": "promise",
                            "size": 0.92159617
                        }, {
                            "color": "#199fc7",
                            "label": "scuttlebutt",
                            "attributes": {},
                            "y": 1085.3298,
                            "x": 394.12222,
                            "id": "scuttlebutt",
                            "size": 0.64773077
                        }, {
                            "color": "#8419c7",
                            "label": "form-data",
                            "attributes": {},
                            "y": 33.676548,
                            "x": -79.20483,
                            "id": "form-data",
                            "size": 1.1954615
                        }, {
                            "color": "#b9c719",
                            "label": "router",
                            "attributes": {},
                            "y": 456.70023,
                            "x": -234.20868,
                            "id": "router",
                            "size": 0.52601284
                        }, {
                            "color": "#19c719",
                            "label": "daemon",
                            "attributes": {},
                            "y": 421.1385,
                            "x": -137.47592,
                            "id": "daemon",
                            "size": 1.0128845
                        }, {
                            "color": "#c71969",
                            "label": "sylvester",
                            "attributes": {},
                            "y": -948.5652,
                            "x": -188.29977,
                            "id": "sylvester",
                            "size": 0.43472436
                        }, {
                            "color": "#c78419",
                            "label": "js2coffee",
                            "attributes": {},
                            "y": -1019.6858,
                            "x": -36.928844,
                            "id": "js2coffee",
                            "size": 0.4955833
                        }, {
                            "color": "#1969c7",
                            "label": "cwise",
                            "attributes": {},
                            "y": -1295.9099,
                            "x": 519.8282,
                            "id": "cwise",
                            "size": 0.67816025
                        }, {
                            "color": "#4f19c7",
                            "label": "css",
                            "attributes": {},
                            "y": 1263.161,
                            "x": 123.637375,
                            "id": "css",
                            "size": 0.55644226
                        }, {
                            "color": "#1969c7",
                            "label": "event-component",
                            "attributes": {},
                            "y": -71.59668,
                            "x": 239.32458,
                            "id": "event-component",
                            "size": 0.4651538
                        }, {
                            "color": "#19c719",
                            "label": "js-beautify",
                            "attributes": {},
                            "y": -108.54099,
                            "x": 474.7446,
                            "id": "js-beautify",
                            "size": 0.92159617
                        }, {
                            "color": "#69c719",
                            "label": "q-io",
                            "attributes": {},
                            "y": -89.468155,
                            "x": -507.4834,
                            "id": "q-io",
                            "size": 0.83030766
                        }, {
                            "color": "#c71969",
                            "label": "JSONPath",
                            "attributes": {},
                            "y": -781.22864,
                            "x": -202.30043,
                            "id": "JSONPath",
                            "size": 0.58687174
                        }, {
                            "color": "#c71919",
                            "label": "mochiscript",
                            "attributes": {},
                            "y": 807.76044,
                            "x": 1096.608,
                            "id": "mochiscript",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "leveldown",
                            "attributes": {},
                            "y": 341.01407,
                            "x": -775.22314,
                            "id": "leveldown",
                            "size": 0.58687174
                        }, {
                            "color": "#c76919",
                            "label": "Faker",
                            "attributes": {},
                            "y": 81.81546,
                            "x": 295.8043,
                            "id": "Faker",
                            "size": 0.52601284
                        }, {
                            "color": "#8419c7",
                            "label": "nunjucks",
                            "attributes": {},
                            "y": 339.15506,
                            "x": 72.22817,
                            "id": "nunjucks",
                            "size": 0.40429485
                        }, {
                            "color": "#c719b9",
                            "label": "sync",
                            "attributes": {},
                            "y": 217.82198,
                            "x": 1387.9712,
                            "id": "sync",
                            "size": 0.55644226
                        }, {
                            "color": "#c7b919",
                            "label": "extended",
                            "attributes": {},
                            "y": -962.1278,
                            "x": 657.08826,
                            "id": "extended",
                            "size": 0.70858973
                        }, {
                            "color": "#c7b919",
                            "label": "is-extended",
                            "attributes": {},
                            "y": -1022.18335,
                            "x": 637.44147,
                            "id": "is-extended",
                            "size": 0.64773077
                        }, {
                            "color": "#c7b919",
                            "label": "array-extended",
                            "attributes": {},
                            "y": -995.6015,
                            "x": 563.8498,
                            "id": "array-extended",
                            "size": 0.6173013
                        }, {
                            "color": "#c7199f",
                            "label": "put",
                            "attributes": {},
                            "y": -191.68346,
                            "x": -98.489784,
                            "id": "put",
                            "size": 0.4651538
                        }, {
                            "color": "#19c74f",
                            "label": "deck",
                            "attributes": {},
                            "y": -56.16481,
                            "x": -243.28035,
                            "id": "deck",
                            "size": 0.55644226
                        }, {
                            "color": "#199fc7",
                            "label": "stream-combiner",
                            "attributes": {},
                            "y": 1035.9756,
                            "x": 270.37732,
                            "id": "stream-combiner",
                            "size": 0.6173013
                        }, {
                            "color": "#34c719",
                            "label": "setimmediate",
                            "attributes": {},
                            "y": 536.1866,
                            "x": 6.1590505,
                            "id": "setimmediate",
                            "size": 0.4955833
                        }, {
                            "color": "#c78419",
                            "label": "uglify-js2",
                            "attributes": {},
                            "y": -105.903336,
                            "x": 874.6104,
                            "id": "uglify-js2",
                            "size": 0.4955833
                        }, {
                            "color": "#19c719",
                            "label": "upnode",
                            "attributes": {},
                            "y": 1053.4792,
                            "x": -170.91736,
                            "id": "upnode",
                            "size": 0.58687174
                        }, {
                            "color": "#c79f19",
                            "label": "fstream-ignore",
                            "attributes": {},
                            "y": 18.67513,
                            "x": 771.4828,
                            "id": "fstream-ignore",
                            "size": 0.6173013
                        }, {
                            "color": "#19c7b9",
                            "label": "smoosh",
                            "attributes": {},
                            "y": -627.7807,
                            "x": 576.5164,
                            "id": "smoosh",
                            "size": 0.55644226
                        }, {
                            "color": "#c79f19",
                            "label": "yui",
                            "attributes": {},
                            "y": 98.7935,
                            "x": 8.43035,
                            "id": "yui",
                            "size": 0.83030766
                        }, {
                            "color": "#19c79f",
                            "label": "method",
                            "attributes": {},
                            "y": -512.6561,
                            "x": -1259.057,
                            "id": "method",
                            "size": 0.4651538
                        }, {
                            "color": "#1919c7",
                            "label": "node-getopt",
                            "attributes": {},
                            "y": -264.04025,
                            "x": 52.247433,
                            "id": "node-getopt",
                            "size": 0.40429485
                        }, {
                            "color": "#1919c7",
                            "label": "foreach",
                            "attributes": {},
                            "y": -342.96857,
                            "x": -85.643105,
                            "id": "foreach",
                            "size": 0.43472436
                        }, {
                            "color": "#19c719",
                            "label": "difflet",
                            "attributes": {},
                            "y": -828.60913,
                            "x": 666.7738,
                            "id": "difflet",
                            "size": 0.52601284
                        }, {
                            "color": "#c78419",
                            "label": "mootools",
                            "attributes": {},
                            "y": -271.17963,
                            "x": 78.709526,
                            "id": "mootools",
                            "size": 0.55644226
                        }, {
                            "color": "#199fc7",
                            "label": "shoe",
                            "attributes": {},
                            "y": 906.18555,
                            "x": -374.22174,
                            "id": "shoe",
                            "size": 1.0737435
                        }, {
                            "color": "#c71919",
                            "label": "sass",
                            "attributes": {},
                            "y": -205.86336,
                            "x": -5.8695316,
                            "id": "sass",
                            "size": 0.52601284
                        }, {
                            "color": "#c79f19",
                            "label": "level",
                            "attributes": {},
                            "y": 561.232,
                            "x": -458.09595,
                            "id": "level",
                            "size": 0.55644226
                        }, {
                            "color": "#19b9c7",
                            "label": "jsonify",
                            "attributes": {},
                            "y": 937.7613,
                            "x": 98.0932,
                            "id": "jsonify",
                            "size": 0.4651538
                        }, {
                            "color": "#69c719",
                            "label": "markdown-js",
                            "attributes": {},
                            "y": -1001.21906,
                            "x": -673.2897,
                            "id": "markdown-js",
                            "size": 0.4651538
                        }, {
                            "color": "#c78419",
                            "label": "json5",
                            "attributes": {},
                            "y": -1142.8562,
                            "x": 559.41046,
                            "id": "json5",
                            "size": 0.4651538
                        }, {
                            "color": "#c76919",
                            "label": "yamljs",
                            "attributes": {},
                            "y": -625.1245,
                            "x": 429.07022,
                            "id": "yamljs",
                            "size": 0.76944876
                        }, {
                            "color": "#1984c7",
                            "label": "passport-http",
                            "attributes": {},
                            "y": 1112.6439,
                            "x": 586.60333,
                            "id": "passport-http",
                            "size": 0.4651538
                        }, {
                            "color": "#1984c7",
                            "label": "docparse-config",
                            "attributes": {},
                            "y": 343.87463,
                            "x": 1012.1537,
                            "id": "docparse-config",
                            "size": 0.7390192
                        }, {
                            "color": "#1984c7",
                            "label": "seaport",
                            "attributes": {},
                            "y": 555.8372,
                            "x": 509.89893,
                            "id": "seaport",
                            "size": 1.165032
                        }, {
                            "color": "#1984c7",
                            "label": "imacros-read-file",
                            "attributes": {},
                            "y": 212.80945,
                            "x": 78.05023,
                            "id": "imacros-read-file",
                            "size": 0.58687174
                        }, {
                            "color": "#1984c7",
                            "label": "loggly-console-logger",
                            "attributes": {},
                            "y": 724.5533,
                            "x": 855.0759,
                            "id": "loggly-console-logger",
                            "size": 0.58687174
                        }, {
                            "color": "#c719b9",
                            "label": "apn",
                            "attributes": {},
                            "y": -407.88702,
                            "x": -459.53925,
                            "id": "apn",
                            "size": 0.43472436
                        }, {
                            "color": "#19c7b9",
                            "label": "node-watch",
                            "attributes": {},
                            "y": 360.09363,
                            "x": 35.46165,
                            "id": "node-watch",
                            "size": 0.6173013
                        }, {
                            "color": "#84c719",
                            "label": "tea-extend",
                            "attributes": {},
                            "y": 335.02548,
                            "x": -347.4769,
                            "id": "tea-extend",
                            "size": 0.43472436
                        }, {
                            "color": "#3419c7",
                            "label": "qbox",
                            "attributes": {},
                            "y": -164.44691,
                            "x": -25.2235,
                            "id": "qbox",
                            "size": 0.43472436
                        }, {
                            "color": "#9fc719",
                            "label": "passport-google-oauth",
                            "attributes": {},
                            "y": 1153.7697,
                            "x": 589.3833,
                            "id": "passport-google-oauth",
                            "size": 0.4651538
                        }, {
                            "color": "#c74f19",
                            "label": "ar-drone",
                            "attributes": {},
                            "y": -290.17487,
                            "x": 192.4303,
                            "id": "ar-drone",
                            "size": 0.55644226
                        }, {
                            "color": "#19c74f",
                            "label": "forEachAsync",
                            "attributes": {},
                            "y": -684.2996,
                            "x": 378.59113,
                            "id": "forEachAsync",
                            "size": 0.4651538
                        }, {
                            "color": "#c79f19",
                            "label": "yuidocjs",
                            "attributes": {},
                            "y": -273.36804,
                            "x": 444.81802,
                            "id": "yuidocjs",
                            "size": 0.6173013
                        }, {
                            "color": "#8419c7",
                            "label": "fs",
                            "attributes": {},
                            "y": 458.85266,
                            "x": -260.27344,
                            "id": "fs",
                            "size": 0.55644226
                        }, {
                            "color": "#19c719",
                            "label": "snippets",
                            "attributes": {},
                            "y": -277.18225,
                            "x": -223.52954,
                            "id": "snippets",
                            "size": 0.40429485
                        }, {
                            "color": "#19c719",
                            "label": "node-hid",
                            "attributes": {},
                            "y": -220.93335,
                            "x": -213.05804,
                            "id": "node-hid",
                            "size": 0.4651538
                        }, {
                            "color": "#1984c7",
                            "label": "sf",
                            "attributes": {},
                            "y": 76.88708,
                            "x": -167.24387,
                            "id": "sf",
                            "size": 0.40429485
                        }, {
                            "color": "#c71984",
                            "label": "revalidator",
                            "attributes": {},
                            "y": 787.1881,
                            "x": 498.58612,
                            "id": "revalidator",
                            "size": 0.40429485
                        }, {
                            "color": "#8419c7",
                            "label": "googleclientlogin",
                            "attributes": {},
                            "y": -304.12473,
                            "x": -80.95831,
                            "id": "googleclientlogin",
                            "size": 0.43472436
                        }, {
                            "color": "#c73419",
                            "label": "ee-class",
                            "attributes": {},
                            "y": 174.6967,
                            "x": -397.30457,
                            "id": "ee-class",
                            "size": 0.4651538
                        }, {
                            "color": "#9fc719",
                            "label": "mongoose-types",
                            "attributes": {},
                            "y": 375.1962,
                            "x": -1176.3058,
                            "id": "mongoose-types",
                            "size": 0.4651538
                        }, {
                            "color": "#c74f19",
                            "label": "funargs",
                            "attributes": {},
                            "y": 421.4906,
                            "x": 1178.4454,
                            "id": "funargs",
                            "size": 1.1954615
                        }, {
                            "color": "#b9c719",
                            "label": "simplesmtp",
                            "attributes": {},
                            "y": -563.16315,
                            "x": 867.2839,
                            "id": "simplesmtp",
                            "size": 0.4955833
                        }, {
                            "color": "#b919c7",
                            "label": "ender-bootstrap-base",
                            "attributes": {},
                            "y": -1214.9171,
                            "x": -1119.1847,
                            "id": "ender-bootstrap-base",
                            "size": 0.67816025
                        }, {
                            "color": "#b919c7",
                            "label": "ender-bootstrap-transition",
                            "attributes": {},
                            "y": -1175.8195,
                            "x": -1094.6414,
                            "id": "ender-bootstrap-transition",
                            "size": 0.52601284
                        }, {
                            "color": "#9f19c7",
                            "label": "engine.io-client",
                            "attributes": {},
                            "y": -288.4646,
                            "x": -925.3114,
                            "id": "engine.io-client",
                            "size": 0.70858973
                        }, {
                            "color": "#199fc7",
                            "label": "monotonic-timestamp",
                            "attributes": {},
                            "y": 1104.9058,
                            "x": 374.07852,
                            "id": "monotonic-timestamp",
                            "size": 0.4955833
                        }, {
                            "color": "#34c719",
                            "label": "ldapjs",
                            "attributes": {},
                            "y": 995.9913,
                            "x": 197.95416,
                            "id": "ldapjs",
                            "size": 0.70858973
                        }, {
                            "color": "#69c719",
                            "label": "LiveScript",
                            "attributes": {},
                            "y": 1017.7713,
                            "x": -697.17413,
                            "id": "LiveScript",
                            "size": 0.8607372
                        }, {
                            "color": "#19b9c7",
                            "label": "require-like",
                            "attributes": {},
                            "y": 410.90912,
                            "x": -163.40764,
                            "id": "require-like",
                            "size": 0.4651538
                        }, {
                            "color": "#199fc7",
                            "label": "reconnect",
                            "attributes": {},
                            "y": 699.574,
                            "x": -287.58524,
                            "id": "reconnect",
                            "size": 0.67816025
                        }, {
                            "color": "#199fc7",
                            "label": "from",
                            "attributes": {},
                            "y": 928.98145,
                            "x": 332.75525,
                            "id": "from",
                            "size": 0.43472436
                        }, {
                            "color": "#1934c7",
                            "label": "eventproxy",
                            "attributes": {},
                            "y": -60.85565,
                            "x": -296.83182,
                            "id": "eventproxy",
                            "size": 0.52601284
                        }, {
                            "color": "#19c719",
                            "label": "exec-sync",
                            "attributes": {},
                            "y": -16.778877,
                            "x": -1259.8529,
                            "id": "exec-sync",
                            "size": 0.52601284
                        }, {
                            "color": "#9fc719",
                            "label": "passport-facebook",
                            "attributes": {},
                            "y": 1156.7816,
                            "x": 612.5751,
                            "id": "passport-facebook",
                            "size": 0.55644226
                        }, {
                            "color": "#c79f19",
                            "label": "update-notifier",
                            "attributes": {},
                            "y": 130.25168,
                            "x": 386.5853,
                            "id": "update-notifier",
                            "size": 0.55644226
                        }, {
                            "color": "#19c719",
                            "label": "utilities",
                            "attributes": {},
                            "y": -495.67886,
                            "x": 962.3648,
                            "id": "utilities",
                            "size": 0.40429485
                        }, {
                            "color": "#3419c7",
                            "label": "fire",
                            "attributes": {},
                            "y": 26.584068,
                            "x": 625.1236,
                            "id": "fire",
                            "size": 0.4651538
                        }, {
                            "color": "#c79f19",
                            "label": "yamlish",
                            "attributes": {},
                            "y": -378.95523,
                            "x": 516.29596,
                            "id": "yamlish",
                            "size": 0.4955833
                        }, {
                            "color": "#34c719",
                            "label": "posix-getopt",
                            "attributes": {},
                            "y": 247.62514,
                            "x": 79.496185,
                            "id": "posix-getopt",
                            "size": 0.76944876
                        }, {
                            "color": "#34c719",
                            "label": "latest",
                            "attributes": {},
                            "y": -97.57242,
                            "x": 1358.8243,
                            "id": "latest",
                            "size": 0.4651538
                        }, {
                            "color": "#c76919",
                            "label": "yeoman-generator",
                            "attributes": {},
                            "y": -186.74983,
                            "x": 190.55476,
                            "id": "yeoman-generator",
                            "size": 5.6381664
                        }, {
                            "color": "#1984c7",
                            "label": "jsftp",
                            "attributes": {},
                            "y": 475.91956,
                            "x": 238.58153,
                            "id": "jsftp",
                            "size": 0.6173013
                        }, {
                            "color": "#19c7b9",
                            "label": "funkit",
                            "attributes": {},
                            "y": -254.73396,
                            "x": -112.39201,
                            "id": "funkit",
                            "size": 0.55644226
                        }, {
                            "color": "#84c719",
                            "label": "xmlrpc",
                            "attributes": {},
                            "y": 566.62756,
                            "x": -646.174,
                            "id": "xmlrpc",
                            "size": 0.8607372
                        }, {
                            "color": "#c71969",
                            "label": "gate",
                            "attributes": {},
                            "y": -207.42516,
                            "x": -233.15547,
                            "id": "gate",
                            "size": 0.43472436
                        }, {
                            "color": "#c7194f",
                            "label": "mysql-libmysqlclient",
                            "attributes": {},
                            "y": -242.4547,
                            "x": 88.063034,
                            "id": "mysql-libmysqlclient",
                            "size": 0.40429485
                        }, {
                            "color": "#c71969",
                            "label": "twit",
                            "attributes": {},
                            "y": 1252.696,
                            "x": -227.96336,
                            "id": "twit",
                            "size": 0.4955833
                        }, {
                            "color": "#34c719",
                            "label": "ip",
                            "attributes": {},
                            "y": 578.1533,
                            "x": 32.292908,
                            "id": "ip",
                            "size": 0.43472436
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-cssmin",
                            "attributes": {},
                            "y": -857.68835,
                            "x": -357.30762,
                            "id": "grunt-contrib-cssmin",
                            "size": 0.4955833
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-contrib-nodeunit",
                            "attributes": {},
                            "y": -535.1022,
                            "x": 266.95883,
                            "id": "grunt-contrib-nodeunit",
                            "size": 0.6173013
                        }, {
                            "color": "#c7b919",
                            "label": "gzip-js",
                            "attributes": {},
                            "y": 241.80016,
                            "x": 46.09004,
                            "id": "gzip-js",
                            "size": 0.4651538
                        }, {
                            "color": "#c7b919",
                            "label": "grunt-lib-phantomjs",
                            "attributes": {},
                            "y": 362.2341,
                            "x": 879.5071,
                            "id": "grunt-lib-phantomjs",
                            "size": 0.55644226
                        }, {
                            "color": "#1919c7",
                            "label": "saucelabs",
                            "attributes": {},
                            "y": -214.85513,
                            "x": 57.529392,
                            "id": "saucelabs",
                            "size": 0.43472436
                        }, {
                            "color": "#c71919",
                            "label": "node-syslog",
                            "attributes": {},
                            "y": -264.05222,
                            "x": 125.97945,
                            "id": "node-syslog",
                            "size": 0.40429485
                        }, {
                            "color": "#c719b9",
                            "label": "hashring",
                            "attributes": {},
                            "y": 1145.2965,
                            "x": -244.37975,
                            "id": "hashring",
                            "size": 0.4651538
                        }, {
                            "color": "#19c734",
                            "label": "hypher",
                            "attributes": {},
                            "y": -297.57465,
                            "x": 113.438896,
                            "id": "hypher",
                            "size": 1.2563205
                        }, {
                            "color": "#c78419",
                            "label": "soda",
                            "attributes": {},
                            "y": -351.1734,
                            "x": -19.649744,
                            "id": "soda",
                            "size": 0.43472436
                        }, {
                            "color": "#199fc7",
                            "label": "joose",
                            "attributes": {},
                            "y": 20.20147,
                            "x": 1053.6621,
                            "id": "joose",
                            "size": 0.98245513
                        }, {
                            "color": "#19c7b9",
                            "label": "iwebpp.io",
                            "attributes": {},
                            "y": 989.7358,
                            "x": -517.65106,
                            "id": "iwebpp.io",
                            "size": 0.64773077
                        }, {
                            "color": "#19c7b9",
                            "label": "siphash",
                            "attributes": {},
                            "y": 986.30225,
                            "x": -539.15283,
                            "id": "siphash",
                            "size": 0.43472436
                        }, {
                            "color": "#c71969",
                            "label": "jsgui-lang-essentials",
                            "attributes": {},
                            "y": -574.97003,
                            "x": 1197.1713,
                            "id": "jsgui-lang-essentials",
                            "size": 0.43472436
                        }, {
                            "color": "#199fc7",
                            "label": "pull-stream",
                            "attributes": {},
                            "y": 185.75874,
                            "x": -367.50992,
                            "id": "pull-stream",
                            "size": 1.043314
                        }, {
                            "color": "#8419c7",
                            "label": "konphyg",
                            "attributes": {},
                            "y": 203.21783,
                            "x": -333.21362,
                            "id": "konphyg",
                            "size": 0.40429485
                        }, {
                            "color": "#199fc7",
                            "label": "level-live-stream",
                            "attributes": {},
                            "y": 291.01462,
                            "x": 101.217674,
                            "id": "level-live-stream",
                            "size": 0.52601284
                        }, {
                            "color": "#19c7b9",
                            "label": "logmimosa",
                            "attributes": {},
                            "y": -583.9365,
                            "x": -1048.6061,
                            "id": "logmimosa",
                            "size": 0.76944876
                        }, {
                            "color": "#c74f19",
                            "label": "node-document-storage",
                            "attributes": {},
                            "y": 183.08963,
                            "x": 1286.1066,
                            "id": "node-document-storage",
                            "size": 0.67816025
                        }, {
                            "color": "#c71969",
                            "label": "noflo",
                            "attributes": {},
                            "y": -971.328,
                            "x": 310.00107,
                            "id": "noflo",
                            "size": 1.4388975
                        }, {
                            "color": "#c78419",
                            "label": "spine",
                            "attributes": {},
                            "y": 225.49977,
                            "x": 13.505666,
                            "id": "spine",
                            "size": 0.4651538
                        }, {
                            "color": "#c71969",
                            "label": "punch",
                            "attributes": {},
                            "y": -520.8965,
                            "x": -451.1391,
                            "id": "punch",
                            "size": 0.8607372
                        }, {
                            "color": "#6919c7",
                            "label": "quiver-error",
                            "attributes": {},
                            "y": -386.996,
                            "x": 8.449575,
                            "id": "quiver-error",
                            "size": 0.52601284
                        }, {
                            "color": "#1969c7",
                            "label": "rle-core",
                            "attributes": {},
                            "y": 39.557953,
                            "x": -379.84222,
                            "id": "rle-core",
                            "size": 0.40429485
                        }, {
                            "color": "#199fc7",
                            "label": "joosex-namespace-depended",
                            "attributes": {},
                            "y": 32.93445,
                            "x": 1071.2402,
                            "id": "joosex-namespace-depended",
                            "size": 0.55644226
                        }, {
                            "color": "#69c719",
                            "label": "sourcemint-util-js",
                            "attributes": {},
                            "y": -501.3569,
                            "x": -121.91505,
                            "id": "sourcemint-util-js",
                            "size": 0.7390192
                        }, {
                            "color": "#c7b919",
                            "label": "spmrc",
                            "attributes": {},
                            "y": 138.83679,
                            "x": -316.52774,
                            "id": "spmrc",
                            "size": 0.40429485
                        }, {
                            "color": "#c71934",
                            "label": "tower-emitter",
                            "attributes": {},
                            "y": 1096.0394,
                            "x": -553.1255,
                            "id": "tower-emitter",
                            "size": 0.55644226
                        }, {
                            "color": "#c71934",
                            "label": "tower-directive",
                            "attributes": {},
                            "y": 1093.3612,
                            "x": -543.5085,
                            "id": "tower-directive",
                            "size": 0.4955833
                        }, {
                            "color": "#c74f19",
                            "label": "voxel",
                            "attributes": {},
                            "y": 321.36972,
                            "x": 618.49976,
                            "id": "voxel",
                            "size": 0.52601284
                        }],
                        "edges": [{"sourceID": "jquery", "attributes": {}, "targetID": "jsdom", "size": 1}, {
                            "sourceID": "jquery",
                            "attributes": {},
                            "targetID": "xmlhttprequest",
                            "size": 1
                        }, {"sourceID": "jquery", "attributes": {}, "targetID": "htmlparser", "size": 1}, {
                            "sourceID": "jquery",
                            "attributes": {},
                            "targetID": "contextify",
                            "size": 1
                        }, {"sourceID": "backbone", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "faye",
                            "attributes": {},
                            "targetID": "faye-websocket",
                            "size": 1
                        }, {"sourceID": "faye", "attributes": {}, "targetID": "cookiejar", "size": 1}, {
                            "sourceID": "socket.io",
                            "attributes": {},
                            "targetID": "redis",
                            "size": 1
                        }, {"sourceID": "socket.io", "attributes": {}, "targetID": "socket.io-client", "size": 1}, {
                            "sourceID": "mongoose",
                            "attributes": {},
                            "targetID": "mongodb",
                            "size": 1
                        }, {"sourceID": "mongoose", "attributes": {}, "targetID": "hooks", "size": 1}, {
                            "sourceID": "mongoose",
                            "attributes": {},
                            "targetID": "ms",
                            "size": 1
                        }, {"sourceID": "cheerio", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "cheerio",
                            "attributes": {},
                            "targetID": "htmlparser2",
                            "size": 1
                        }, {"sourceID": "cheerio", "attributes": {}, "targetID": "entities", "size": 1}, {
                            "sourceID": "express",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "express", "attributes": {}, "targetID": "connect", "size": 1}, {
                            "sourceID": "express",
                            "attributes": {},
                            "targetID": "commander",
                            "size": 1
                        }, {"sourceID": "express", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "express",
                            "attributes": {},
                            "targetID": "cookie",
                            "size": 1
                        }, {"sourceID": "express", "attributes": {}, "targetID": "send", "size": 1}, {
                            "sourceID": "express",
                            "attributes": {},
                            "targetID": "methods",
                            "size": 1
                        }, {"sourceID": "express", "attributes": {}, "targetID": "buffer-crc32", "size": 1}, {
                            "sourceID": "express",
                            "attributes": {},
                            "targetID": "fresh",
                            "size": 1
                        }, {"sourceID": "connect", "attributes": {}, "targetID": "bytes", "size": 1}, {
                            "sourceID": "connect",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "connect", "attributes": {}, "targetID": "qs", "size": 1}, {
                            "sourceID": "connect",
                            "attributes": {},
                            "targetID": "cookie",
                            "size": 1
                        }, {"sourceID": "connect", "attributes": {}, "targetID": "send", "size": 1}, {
                            "sourceID": "connect",
                            "attributes": {},
                            "targetID": "formidable",
                            "size": 1
                        }, {"sourceID": "connect", "attributes": {}, "targetID": "methods", "size": 1}, {
                            "sourceID": "connect",
                            "attributes": {},
                            "targetID": "buffer-crc32",
                            "size": 1
                        }, {"sourceID": "connect", "attributes": {}, "targetID": "fresh", "size": 1}, {
                            "sourceID": "connect",
                            "attributes": {},
                            "targetID": "pause",
                            "size": 1
                        }, {"sourceID": "temp", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "request",
                            "attributes": {},
                            "targetID": "node-uuid",
                            "size": 1
                        }, {"sourceID": "request", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "request",
                            "attributes": {},
                            "targetID": "qs",
                            "size": 1
                        }, {"sourceID": "request", "attributes": {}, "targetID": "form-data", "size": 1}, {
                            "sourceID": "event-stream",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "event-stream", "attributes": {}, "targetID": "duplexer", "size": 1}, {
                            "sourceID": "event-stream",
                            "attributes": {},
                            "targetID": "split",
                            "size": 1
                        }, {
                            "sourceID": "event-stream",
                            "attributes": {},
                            "targetID": "pause-stream",
                            "size": 1
                        }, {"sourceID": "event-stream", "attributes": {}, "targetID": "map-stream", "size": 1}, {
                            "sourceID": "event-stream",
                            "attributes": {},
                            "targetID": "stream-combiner",
                            "size": 1
                        }, {"sourceID": "event-stream", "attributes": {}, "targetID": "from", "size": 1}, {
                            "sourceID": "log4js",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "log4js", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "log4js",
                            "attributes": {},
                            "targetID": "readable-stream",
                            "size": 1
                        }, {"sourceID": "optimist", "attributes": {}, "targetID": "wordwrap", "size": 1}, {
                            "sourceID": "mocha",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "mocha", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "mocha",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {"sourceID": "mocha", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "mocha",
                            "attributes": {},
                            "targetID": "jade",
                            "size": 1
                        }, {"sourceID": "mocha", "attributes": {}, "targetID": "growl", "size": 1}, {
                            "sourceID": "mocha",
                            "attributes": {},
                            "targetID": "ms",
                            "size": 1
                        }, {"sourceID": "mocha", "attributes": {}, "targetID": "diff", "size": 1}, {
                            "sourceID": "prompt",
                            "attributes": {},
                            "targetID": "read",
                            "size": 1
                        }, {"sourceID": "prompt", "attributes": {}, "targetID": "pkginfo", "size": 1}, {
                            "sourceID": "prompt",
                            "attributes": {},
                            "targetID": "winston",
                            "size": 1
                        }, {"sourceID": "prompt", "attributes": {}, "targetID": "utile", "size": 1}, {
                            "sourceID": "prompt",
                            "attributes": {},
                            "targetID": "revalidator",
                            "size": 1
                        }, {"sourceID": "commander", "attributes": {}, "targetID": "keypress", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "lodash",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "dateformat", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "underscore.string", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "minimatch", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "which",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "glob", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "findup-sync", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "eventemitter2",
                            "size": 1
                        }, {"sourceID": "grunt", "attributes": {}, "targetID": "iconv-lite", "size": 1}, {
                            "sourceID": "grunt",
                            "attributes": {},
                            "targetID": "js-yaml",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-less",
                            "attributes": {},
                            "targetID": "less",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-less",
                            "attributes": {},
                            "targetID": "grunt-lib-contrib",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-jshint",
                            "attributes": {},
                            "targetID": "jshint",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-uglify",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-uglify",
                            "attributes": {},
                            "targetID": "grunt-lib-contrib",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-watch",
                            "attributes": {},
                            "targetID": "gaze",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-watch",
                            "attributes": {},
                            "targetID": "tiny-lr",
                            "size": 1
                        }, {"sourceID": "http-proxy", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "http-proxy",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "http-proxy", "attributes": {}, "targetID": "pkginfo", "size": 1}, {
                            "sourceID": "http-proxy",
                            "attributes": {},
                            "targetID": "utile",
                            "size": 1
                        }, {"sourceID": "mongodb", "attributes": {}, "targetID": "bson", "size": 1}, {
                            "sourceID": "minimatch",
                            "attributes": {},
                            "targetID": "lru-cache",
                            "size": 1
                        }, {"sourceID": "nopt", "attributes": {}, "targetID": "abbrev", "size": 1}, {
                            "sourceID": "rimraf",
                            "attributes": {},
                            "targetID": "graceful-fs",
                            "size": 1
                        }, {"sourceID": "tar", "attributes": {}, "targetID": "fstream", "size": 1}, {
                            "sourceID": "tar",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }, {"sourceID": "fstream", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "fstream",
                            "attributes": {},
                            "targetID": "graceful-fs",
                            "size": 1
                        }, {"sourceID": "fstream", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "fstream",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "node-gyp",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "node-gyp",
                            "attributes": {},
                            "targetID": "graceful-fs",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "minimatch", "size": 1}, {
                            "sourceID": "node-gyp",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "node-gyp",
                            "attributes": {},
                            "targetID": "which",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "tar", "size": 1}, {
                            "sourceID": "node-gyp",
                            "attributes": {},
                            "targetID": "fstream",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "npmlog", "size": 1}, {
                            "sourceID": "node-gyp",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {"sourceID": "node-gyp", "attributes": {}, "targetID": "osenv", "size": 1}, {
                            "sourceID": "fstream-npm",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }, {"sourceID": "fstream-npm", "attributes": {}, "targetID": "fstream-ignore", "size": 1}, {
                            "sourceID": "npmlog",
                            "attributes": {},
                            "targetID": "ansi",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "semver",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "slide",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "graceful-fs",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "rimraf",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "npmlog",
                            "size": 1
                        }, {
                            "sourceID": "npm-registry-client",
                            "attributes": {},
                            "targetID": "retry",
                            "size": 1
                        }, {
                            "sourceID": "read-package-json",
                            "attributes": {},
                            "targetID": "graceful-fs",
                            "size": 1
                        }, {
                            "sourceID": "read-package-json",
                            "attributes": {},
                            "targetID": "lru-cache",
                            "size": 1
                        }, {"sourceID": "read-package-json", "attributes": {}, "targetID": "glob", "size": 1}, {
                            "sourceID": "glob",
                            "attributes": {},
                            "targetID": "graceful-fs",
                            "size": 1
                        }, {"sourceID": "glob", "attributes": {}, "targetID": "minimatch", "size": 1}, {
                            "sourceID": "glob",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }, {"sourceID": "npmconf", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "npmconf",
                            "attributes": {},
                            "targetID": "semver",
                            "size": 1
                        }, {"sourceID": "npmconf", "attributes": {}, "targetID": "ini", "size": 1}, {
                            "sourceID": "npmconf",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "npmconf", "attributes": {}, "targetID": "inherits", "size": 1}, {
                            "sourceID": "npmconf",
                            "attributes": {},
                            "targetID": "osenv",
                            "size": 1
                        }, {"sourceID": "npmconf", "attributes": {}, "targetID": "once", "size": 1}, {
                            "sourceID": "findup-sync",
                            "attributes": {},
                            "targetID": "lodash",
                            "size": 1
                        }, {"sourceID": "findup-sync", "attributes": {}, "targetID": "glob", "size": 1}, {
                            "sourceID": "node-minify",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {"sourceID": "node-minify", "attributes": {}, "targetID": "sqwish", "size": 1}, {
                            "sourceID": "bal-util",
                            "attributes": {},
                            "targetID": "extendr",
                            "size": 1
                        }, {"sourceID": "bal-util", "attributes": {}, "targetID": "taskgroup", "size": 1}, {
                            "sourceID": "bal-util",
                            "attributes": {},
                            "targetID": "typechecker",
                            "size": 1
                        }, {"sourceID": "extendr", "attributes": {}, "targetID": "typechecker", "size": 1}, {
                            "sourceID": "taskgroup",
                            "attributes": {},
                            "targetID": "eventemitter2",
                            "size": 1
                        }, {"sourceID": "underscorem", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "hubot",
                            "attributes": {},
                            "targetID": "express",
                            "size": 1
                        }, {"sourceID": "hubot", "attributes": {}, "targetID": "coffee-script", "size": 1}, {
                            "sourceID": "hubot",
                            "attributes": {},
                            "targetID": "optparse",
                            "size": 1
                        }, {"sourceID": "hubot", "attributes": {}, "targetID": "log", "size": 1}, {
                            "sourceID": "ndarray-ops",
                            "attributes": {},
                            "targetID": "ndarray",
                            "size": 1
                        }, {"sourceID": "ndarray-ops", "attributes": {}, "targetID": "cwise", "size": 1}, {
                            "sourceID": "typedarray-pool",
                            "attributes": {},
                            "targetID": "bit-twiddle",
                            "size": 1
                        }, {"sourceID": "jade", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "jade",
                            "attributes": {},
                            "targetID": "commander",
                            "size": 1
                        }, {"sourceID": "nodemailer", "attributes": {}, "targetID": "simplesmtp", "size": 1}, {
                            "sourceID": "eco",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "filed", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "flatiron",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "flatiron", "attributes": {}, "targetID": "prompt", "size": 1}, {
                            "sourceID": "flatiron",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "flatiron", "attributes": {}, "targetID": "director", "size": 1}, {
                            "sourceID": "flatiron",
                            "attributes": {},
                            "targetID": "broadway",
                            "size": 1
                        }, {"sourceID": "winston", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "winston",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "winston", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "winston",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "winston", "attributes": {}, "targetID": "stack-trace", "size": 1}, {
                            "sourceID": "winston",
                            "attributes": {},
                            "targetID": "eyes",
                            "size": 1
                        }, {"sourceID": "winston", "attributes": {}, "targetID": "cycle", "size": 1}, {
                            "sourceID": "coffeekup",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "stylus", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "stylus",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "stylus", "attributes": {}, "targetID": "cssom", "size": 1}, {
                            "sourceID": "xml2json",
                            "attributes": {},
                            "targetID": "node-expat",
                            "size": 1
                        }, {"sourceID": "nano", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "nano",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "nano", "attributes": {}, "targetID": "errs", "size": 1}, {
                            "sourceID": "nano",
                            "attributes": {},
                            "targetID": "follow",
                            "size": 1
                        }, {"sourceID": "less", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "less",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "less", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "less",
                            "attributes": {},
                            "targetID": "ycssmin",
                            "size": 1
                        }, {"sourceID": "uglify-js", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "uglify-js",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "uglify-js", "attributes": {}, "targetID": "source-map", "size": 1}, {
                            "sourceID": "clean-css",
                            "attributes": {},
                            "targetID": "commander",
                            "size": 1
                        }, {"sourceID": "datetime", "attributes": {}, "targetID": "vows", "size": 1}, {
                            "sourceID": "vows",
                            "attributes": {},
                            "targetID": "eyes",
                            "size": 1
                        }, {"sourceID": "vows", "attributes": {}, "targetID": "diff", "size": 1}, {
                            "sourceID": "docco",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "docco", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "docco",
                            "attributes": {},
                            "targetID": "marked",
                            "size": 1
                        }, {"sourceID": "docco", "attributes": {}, "targetID": "highlight.js", "size": 1}, {
                            "sourceID": "xml2js",
                            "attributes": {},
                            "targetID": "sax",
                            "size": 1
                        }, {"sourceID": "libxmljs", "attributes": {}, "targetID": "bindings", "size": 1}, {
                            "sourceID": "handlebars",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "handlebars", "attributes": {}, "targetID": "uglify-js", "size": 1}, {
                            "sourceID": "tap",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "tap", "attributes": {}, "targetID": "slide", "size": 1}, {
                            "sourceID": "tap",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "tap", "attributes": {}, "targetID": "inherits", "size": 1}, {
                            "sourceID": "tap",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {"sourceID": "tap", "attributes": {}, "targetID": "deep-equal", "size": 1}, {
                            "sourceID": "tap",
                            "attributes": {},
                            "targetID": "difflet",
                            "size": 1
                        }, {"sourceID": "tap", "attributes": {}, "targetID": "yamlish", "size": 1}, {
                            "sourceID": "walk",
                            "attributes": {},
                            "targetID": "forEachAsync",
                            "size": 1
                        }, {"sourceID": "split", "attributes": {}, "targetID": "through", "size": 1}, {
                            "sourceID": "memcached",
                            "attributes": {},
                            "targetID": "hashring",
                            "size": 1
                        }, {
                            "sourceID": "express-resource",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {
                            "sourceID": "express-resource",
                            "attributes": {},
                            "targetID": "lingo",
                            "size": 1
                        }, {
                            "sourceID": "express-resource",
                            "attributes": {},
                            "targetID": "methods",
                            "size": 1
                        }, {"sourceID": "connect-assets", "attributes": {}, "targetID": "snockets", "size": 1}, {
                            "sourceID": "knox",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "knox", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "knox",
                            "attributes": {},
                            "targetID": "xml2js",
                            "size": 1
                        }, {"sourceID": "aws-sdk", "attributes": {}, "targetID": "xml2js", "size": 1}, {
                            "sourceID": "aws-sdk",
                            "attributes": {},
                            "targetID": "xmlbuilder",
                            "size": 1
                        }, {"sourceID": "fs-extra", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "fs-extra",
                            "attributes": {},
                            "targetID": "rimraf",
                            "size": 1
                        }, {"sourceID": "fs-extra", "attributes": {}, "targetID": "ncp", "size": 1}, {
                            "sourceID": "awssum",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "awssum", "attributes": {}, "targetID": "xml2js", "size": 1}, {
                            "sourceID": "cradle",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "cradle", "attributes": {}, "targetID": "follow", "size": 1}, {
                            "sourceID": "cli-color",
                            "attributes": {},
                            "targetID": "es5-ext",
                            "size": 1
                        }, {"sourceID": "hashish", "attributes": {}, "targetID": "traverse", "size": 1}, {
                            "sourceID": "htmlparser2",
                            "attributes": {},
                            "targetID": "readable-stream",
                            "size": 1
                        }, {"sourceID": "netmask", "attributes": {}, "targetID": "coffee-script", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "pkgcloud", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "pkgcloud", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "pkgcloud", "attributes": {}, "targetID": "filed", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "xml2js",
                            "size": 1
                        }, {"sourceID": "pkgcloud", "attributes": {}, "targetID": "errs", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "pkgcloud", "attributes": {}, "targetID": "eventemitter2", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "qs",
                            "size": 1
                        }, {"sourceID": "pkgcloud", "attributes": {}, "targetID": "utile", "size": 1}, {
                            "sourceID": "pkgcloud",
                            "attributes": {},
                            "targetID": "ip",
                            "size": 1
                        }, {"sourceID": "mailparser", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "mailparser",
                            "attributes": {},
                            "targetID": "iconv",
                            "size": 1
                        }, {"sourceID": "portfinder", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "forever-monitor",
                            "attributes": {},
                            "targetID": "minimatch",
                            "size": 1
                        }, {
                            "sourceID": "forever-monitor",
                            "attributes": {},
                            "targetID": "watch",
                            "size": 1
                        }, {
                            "sourceID": "forever-monitor",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {
                            "sourceID": "forever-monitor",
                            "attributes": {},
                            "targetID": "utile",
                            "size": 1
                        }, {"sourceID": "forever-monitor", "attributes": {}, "targetID": "broadway", "size": 1}, {
                            "sourceID": "passport",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "passport", "attributes": {}, "targetID": "pause", "size": 1}, {
                            "sourceID": "jshint",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "jshint", "attributes": {}, "targetID": "minimatch", "size": 1}, {
                            "sourceID": "jshint",
                            "attributes": {},
                            "targetID": "cli",
                            "size": 1
                        }, {"sourceID": "jshint", "attributes": {}, "targetID": "shelljs", "size": 1}, {
                            "sourceID": "nib",
                            "attributes": {},
                            "targetID": "stylus",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-stylus",
                            "attributes": {},
                            "targetID": "stylus",
                            "size": 1
                        }, {"sourceID": "grunt-contrib-stylus", "attributes": {}, "targetID": "nib", "size": 1}, {
                            "sourceID": "phantom",
                            "attributes": {},
                            "targetID": "dnode",
                            "size": 1
                        }, {"sourceID": "phantom", "attributes": {}, "targetID": "shoe", "size": 1}, {
                            "sourceID": "jslint",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "bufferstream", "attributes": {}, "targetID": "buffertools", "size": 1}, {
                            "sourceID": "browserify",
                            "attributes": {},
                            "targetID": "event-stream",
                            "size": 1
                        }, {"sourceID": "browserify", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "browserify",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }, {"sourceID": "browserify", "attributes": {}, "targetID": "through", "size": 1}, {
                            "sourceID": "browserify",
                            "attributes": {},
                            "targetID": "duplexer",
                            "size": 1
                        }, {"sourceID": "browserify", "attributes": {}, "targetID": "shell-quote", "size": 1}, {
                            "sourceID": "browserify",
                            "attributes": {},
                            "targetID": "concat-stream",
                            "size": 1
                        }, {"sourceID": "browserify", "attributes": {}, "targetID": "JSONStream", "size": 1}, {
                            "sourceID": "nodeunit",
                            "attributes": {},
                            "targetID": "tap",
                            "size": 1
                        }, {"sourceID": "vine", "attributes": {}, "targetID": "outcome", "size": 1}, {
                            "sourceID": "findit",
                            "attributes": {},
                            "targetID": "seq",
                            "size": 1
                        }, {"sourceID": "plugin", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "plugin",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "plugin", "attributes": {}, "targetID": "structr", "size": 1}, {
                            "sourceID": "plugin",
                            "attributes": {},
                            "targetID": "step",
                            "size": 1
                        }, {"sourceID": "plugin", "attributes": {}, "targetID": "outcome", "size": 1}, {
                            "sourceID": "plugin",
                            "attributes": {},
                            "targetID": "dref",
                            "size": 1
                        }, {"sourceID": "plugin", "attributes": {}, "targetID": "toarray", "size": 1}, {
                            "sourceID": "plugin",
                            "attributes": {},
                            "targetID": "sift",
                            "size": 1
                        }, {"sourceID": "plugin", "attributes": {}, "targetID": "resolve", "size": 1}, {
                            "sourceID": "sk",
                            "attributes": {},
                            "targetID": "dateformat",
                            "size": 1
                        }, {"sourceID": "sk", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "sk",
                            "attributes": {},
                            "targetID": "structr",
                            "size": 1
                        }, {"sourceID": "sk", "attributes": {}, "targetID": "htmlparser", "size": 1}, {
                            "sourceID": "sk",
                            "attributes": {},
                            "targetID": "printf",
                            "size": 1
                        }, {"sourceID": "stitch", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "stitch",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "jasmine-node", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "jasmine-node",
                            "attributes": {},
                            "targetID": "requirejs",
                            "size": 1
                        }, {"sourceID": "jasmine-node", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "jasmine-node",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "jasmine-node", "attributes": {}, "targetID": "gaze", "size": 1}, {
                            "sourceID": "jasmine-node",
                            "attributes": {},
                            "targetID": "walkdir",
                            "size": 1
                        }, {"sourceID": "jsdom", "attributes": {}, "targetID": "request", "size": 1}, {
                            "sourceID": "jsdom",
                            "attributes": {},
                            "targetID": "htmlparser2",
                            "size": 1
                        }, {"sourceID": "jsdom", "attributes": {}, "targetID": "cssom", "size": 1}, {
                            "sourceID": "jsdom",
                            "attributes": {},
                            "targetID": "contextify",
                            "size": 1
                        }, {"sourceID": "superagent", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "superagent",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {
                            "sourceID": "superagent",
                            "attributes": {},
                            "targetID": "emitter-component",
                            "size": 1
                        }, {"sourceID": "superagent", "attributes": {}, "targetID": "qs", "size": 1}, {
                            "sourceID": "superagent",
                            "attributes": {},
                            "targetID": "formidable",
                            "size": 1
                        }, {"sourceID": "superagent", "attributes": {}, "targetID": "methods", "size": 1}, {
                            "sourceID": "superagent",
                            "attributes": {},
                            "targetID": "cookiejar",
                            "size": 1
                        }, {"sourceID": "readdirp", "attributes": {}, "targetID": "graceful-fs", "size": 1}, {
                            "sourceID": "readdirp",
                            "attributes": {},
                            "targetID": "minimatch",
                            "size": 1
                        }, {"sourceID": "ws", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "node-xmpp",
                            "attributes": {},
                            "targetID": "faye-websocket",
                            "size": 1
                        }, {"sourceID": "node-xmpp", "attributes": {}, "targetID": "request", "size": 1}, {
                            "sourceID": "node-xmpp",
                            "attributes": {},
                            "targetID": "mocha",
                            "size": 1
                        }, {"sourceID": "node-xmpp", "attributes": {}, "targetID": "browserify", "size": 1}, {
                            "sourceID": "node-xmpp",
                            "attributes": {},
                            "targetID": "node-expat",
                            "size": 1
                        }, {"sourceID": "node-xmpp", "attributes": {}, "targetID": "ltx", "size": 1}, {
                            "sourceID": "watchr",
                            "attributes": {},
                            "targetID": "bal-util",
                            "size": 1
                        }, {"sourceID": "watchr", "attributes": {}, "targetID": "extendr", "size": 1}, {
                            "sourceID": "watchr",
                            "attributes": {},
                            "targetID": "taskgroup",
                            "size": 1
                        }, {"sourceID": "watchr", "attributes": {}, "targetID": "typechecker", "size": 1}, {
                            "sourceID": "celeri",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "celeri", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "celeri",
                            "attributes": {},
                            "targetID": "structr",
                            "size": 1
                        }, {"sourceID": "celeri", "attributes": {}, "targetID": "tq", "size": 1}, {
                            "sourceID": "celeri",
                            "attributes": {},
                            "targetID": "plugin",
                            "size": 1
                        }, {"sourceID": "celeri", "attributes": {}, "targetID": "crema", "size": 1}, {
                            "sourceID": "celeri",
                            "attributes": {},
                            "targetID": "outcome",
                            "size": 1
                        }, {"sourceID": "celeri", "attributes": {}, "targetID": "keypress", "size": 1}, {
                            "sourceID": "coa",
                            "attributes": {},
                            "targetID": "q",
                            "size": 1
                        }, {"sourceID": "ometajs", "attributes": {}, "targetID": "q", "size": 1}, {
                            "sourceID": "ometajs",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {"sourceID": "ometajs", "attributes": {}, "targetID": "coa", "size": 1}, {
                            "sourceID": "q-fs",
                            "attributes": {},
                            "targetID": "q",
                            "size": 1
                        }, {"sourceID": "q-fs", "attributes": {}, "targetID": "q-io", "size": 1}, {
                            "sourceID": "falafel",
                            "attributes": {},
                            "targetID": "esprima",
                            "size": 1
                        }, {"sourceID": "cli-table", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "cli",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {"sourceID": "bunyan", "attributes": {}, "targetID": "dtrace-provider", "size": 1}, {
                            "sourceID": "utile",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "utile", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "utile",
                            "attributes": {},
                            "targetID": "rimraf",
                            "size": 1
                        }, {"sourceID": "utile", "attributes": {}, "targetID": "deep-equal", "size": 1}, {
                            "sourceID": "utile",
                            "attributes": {},
                            "targetID": "ncp",
                            "size": 1
                        }, {"sourceID": "utile", "attributes": {}, "targetID": "i", "size": 1}, {
                            "sourceID": "send",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "send", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "send",
                            "attributes": {},
                            "targetID": "fresh",
                            "size": 1
                        }, {"sourceID": "jison", "attributes": {}, "targetID": "esprima", "size": 1}, {
                            "sourceID": "jison",
                            "attributes": {},
                            "targetID": "nomnom",
                            "size": 1
                        }, {"sourceID": "jison", "attributes": {}, "targetID": "escodegen", "size": 1}, {
                            "sourceID": "jison",
                            "attributes": {},
                            "targetID": "cjson",
                            "size": 1
                        }, {"sourceID": "jison", "attributes": {}, "targetID": "JSONSelect", "size": 1}, {
                            "sourceID": "socket.io-client",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {"sourceID": "socket.io-client", "attributes": {}, "targetID": "ws", "size": 1}, {
                            "sourceID": "socket.io-client",
                            "attributes": {},
                            "targetID": "xmlhttprequest",
                            "size": 1
                        }, {"sourceID": "resource", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "resource",
                            "attributes": {},
                            "targetID": "which",
                            "size": 1
                        }, {"sourceID": "resource", "attributes": {}, "targetID": "eventemitter2", "size": 1}, {
                            "sourceID": "jake",
                            "attributes": {},
                            "targetID": "minimatch",
                            "size": 1
                        }, {"sourceID": "jake", "attributes": {}, "targetID": "utilities", "size": 1}, {
                            "sourceID": "assert",
                            "attributes": {},
                            "targetID": "util",
                            "size": 1
                        }, {"sourceID": "detective", "attributes": {}, "targetID": "esprima", "size": 1}, {
                            "sourceID": "detective",
                            "attributes": {},
                            "targetID": "escodegen",
                            "size": 1
                        }, {"sourceID": "istanbul", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "istanbul",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "istanbul", "attributes": {}, "targetID": "abbrev", "size": 1}, {
                            "sourceID": "istanbul",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "istanbul", "attributes": {}, "targetID": "which", "size": 1}, {
                            "sourceID": "istanbul",
                            "attributes": {},
                            "targetID": "handlebars",
                            "size": 1
                        }, {"sourceID": "istanbul", "attributes": {}, "targetID": "esprima", "size": 1}, {
                            "sourceID": "istanbul",
                            "attributes": {},
                            "targetID": "resolve",
                            "size": 1
                        }, {"sourceID": "istanbul", "attributes": {}, "targetID": "escodegen", "size": 1}, {
                            "sourceID": "istanbul",
                            "attributes": {},
                            "targetID": "wordwrap",
                            "size": 1
                        }, {"sourceID": "tiny-lr", "attributes": {}, "targetID": "faye-websocket", "size": 1}, {
                            "sourceID": "tiny-lr",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "tiny-lr", "attributes": {}, "targetID": "qs", "size": 1}, {
                            "sourceID": "argparse",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "argparse", "attributes": {}, "targetID": "underscore.string", "size": 1}, {
                            "sourceID": "dref",
                            "attributes": {},
                            "targetID": "structr",
                            "size": 1
                        }, {"sourceID": "dref", "attributes": {}, "targetID": "dref", "size": 1}, {
                            "sourceID": "dref",
                            "attributes": {},
                            "targetID": "type-component",
                            "size": 1
                        }, {"sourceID": "haml-coffee", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "haml-coffee",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "haml-coffee", "attributes": {}, "targetID": "walkdir", "size": 1}, {
                            "sourceID": "binary",
                            "attributes": {},
                            "targetID": "buffers",
                            "size": 1
                        }, {"sourceID": "forever", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "forever",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "forever", "attributes": {}, "targetID": "watch", "size": 1}, {
                            "sourceID": "forever",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "forever", "attributes": {}, "targetID": "flatiron", "size": 1}, {
                            "sourceID": "forever",
                            "attributes": {},
                            "targetID": "winston",
                            "size": 1
                        }, {"sourceID": "forever", "attributes": {}, "targetID": "forever-monitor", "size": 1}, {
                            "sourceID": "forever",
                            "attributes": {},
                            "targetID": "utile",
                            "size": 1
                        }, {"sourceID": "forever", "attributes": {}, "targetID": "nconf", "size": 1}, {
                            "sourceID": "forever",
                            "attributes": {},
                            "targetID": "cliff",
                            "size": 1
                        }, {"sourceID": "forever", "attributes": {}, "targetID": "nssocket", "size": 1}, {
                            "sourceID": "serialport",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "serialport", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "serialport",
                            "attributes": {},
                            "targetID": "bindings",
                            "size": 1
                        }, {"sourceID": "serialport", "attributes": {}, "targetID": "sf", "size": 1}, {
                            "sourceID": "connect-redis",
                            "attributes": {},
                            "targetID": "redis",
                            "size": 1
                        }, {"sourceID": "connect-redis", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "dnode",
                            "attributes": {},
                            "targetID": "jsonify",
                            "size": 1
                        }, {"sourceID": "union", "attributes": {}, "targetID": "pkginfo", "size": 1}, {
                            "sourceID": "union",
                            "attributes": {},
                            "targetID": "qs",
                            "size": 1
                        }, {
                            "sourceID": "passport-local",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "passport-local", "attributes": {}, "targetID": "passport", "size": 1}, {
                            "sourceID": "markdown",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "microtime", "attributes": {}, "targetID": "bindings", "size": 1}, {
                            "sourceID": "rss",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "rss", "attributes": {}, "targetID": "xml", "size": 1}, {
                            "sourceID": "connect-mongodb",
                            "attributes": {},
                            "targetID": "connect",
                            "size": 1
                        }, {"sourceID": "connect-mongodb", "attributes": {}, "targetID": "mongodb", "size": 1}, {
                            "sourceID": "connect-form",
                            "attributes": {},
                            "targetID": "formidable",
                            "size": 1
                        }, {"sourceID": "zombie", "attributes": {}, "targetID": "request", "size": 1}, {
                            "sourceID": "zombie",
                            "attributes": {},
                            "targetID": "q",
                            "size": 1
                        }, {"sourceID": "zombie", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "zombie",
                            "attributes": {},
                            "targetID": "jsdom",
                            "size": 1
                        }, {"sourceID": "zombie", "attributes": {}, "targetID": "ws", "size": 1}, {
                            "sourceID": "zombie",
                            "attributes": {},
                            "targetID": "ms",
                            "size": 1
                        }, {"sourceID": "jugglingdb", "attributes": {}, "targetID": "inflection", "size": 1}, {
                            "sourceID": "hiredis",
                            "attributes": {},
                            "targetID": "bindings",
                            "size": 1
                        }, {"sourceID": "swig", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "node-static",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "node-static", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "node-static",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "bootstrap", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "nconf",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "nconf", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "nconf",
                            "attributes": {},
                            "targetID": "ini",
                            "size": 1
                        }, {"sourceID": "nconf", "attributes": {}, "targetID": "pkginfo", "size": 1}, {
                            "sourceID": "seq",
                            "attributes": {},
                            "targetID": "hashish",
                            "size": 1
                        }, {"sourceID": "azure", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "azure",
                            "attributes": {},
                            "targetID": "dateformat",
                            "size": 1
                        }, {"sourceID": "azure", "attributes": {}, "targetID": "node-uuid", "size": 1}, {
                            "sourceID": "azure",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "azure", "attributes": {}, "targetID": "validator", "size": 1}, {
                            "sourceID": "azure",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "azure", "attributes": {}, "targetID": "xml2js", "size": 1}, {
                            "sourceID": "azure",
                            "attributes": {},
                            "targetID": "xmlbuilder",
                            "size": 1
                        }, {"sourceID": "azure", "attributes": {}, "targetID": "tunnel", "size": 1}, {
                            "sourceID": "pg",
                            "attributes": {},
                            "targetID": "generic-pool",
                            "size": 1
                        }, {"sourceID": "pg", "attributes": {}, "targetID": "ref", "size": 1}, {
                            "sourceID": "jqtpl",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "ini",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "slide", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "abbrev",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "graceful-fs", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "minimatch",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "nopt", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "rimraf",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "which", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "tar",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "fstream", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "read", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "lru-cache",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "node-gyp", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "fstream-npm",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "archy", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "npmlog",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "ansi", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "npm-registry-client",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "read-package-json", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "osenv", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "retry",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "once", "size": 1}, {
                            "sourceID": "npm",
                            "attributes": {},
                            "targetID": "npmconf",
                            "size": 1
                        }, {"sourceID": "npm", "attributes": {}, "targetID": "opener", "size": 1}, {
                            "sourceID": "nomnom",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "nomnom", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "passport-oauth",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {
                            "sourceID": "passport-oauth",
                            "attributes": {},
                            "targetID": "passport",
                            "size": 1
                        }, {
                            "sourceID": "passport-oauth",
                            "attributes": {},
                            "targetID": "oauth",
                            "size": 1
                        }, {
                            "sourceID": "passport-twitter",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {
                            "sourceID": "passport-twitter",
                            "attributes": {},
                            "targetID": "passport-oauth",
                            "size": 1
                        }, {"sourceID": "mongoskin", "attributes": {}, "targetID": "mongodb", "size": 1}, {
                            "sourceID": "emailjs",
                            "attributes": {},
                            "targetID": "moment",
                            "size": 1
                        }, {"sourceID": "emailjs", "attributes": {}, "targetID": "bufferjs", "size": 1}, {
                            "sourceID": "connect-mongo",
                            "attributes": {},
                            "targetID": "mongodb",
                            "size": 1
                        }, {"sourceID": "bcrypt", "attributes": {}, "targetID": "bindings", "size": 1}, {
                            "sourceID": "ntwitter",
                            "attributes": {},
                            "targetID": "cookies",
                            "size": 1
                        }, {"sourceID": "ntwitter", "attributes": {}, "targetID": "oauth", "size": 1}, {
                            "sourceID": "ntwitter",
                            "attributes": {},
                            "targetID": "keygrip",
                            "size": 1
                        }, {"sourceID": "juice", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "juice",
                            "attributes": {},
                            "targetID": "batch",
                            "size": 1
                        }, {"sourceID": "juice", "attributes": {}, "targetID": "cssom", "size": 1}, {
                            "sourceID": "juice",
                            "attributes": {},
                            "targetID": "jsdom",
                            "size": 1
                        }, {"sourceID": "juice", "attributes": {}, "targetID": "superagent", "size": 1}, {
                            "sourceID": "pause-stream",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "sequelize", "attributes": {}, "targetID": "lodash", "size": 1}, {
                            "sourceID": "sequelize",
                            "attributes": {},
                            "targetID": "underscore.string",
                            "size": 1
                        }, {"sourceID": "sequelize", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "sequelize",
                            "attributes": {},
                            "targetID": "validator",
                            "size": 1
                        }, {"sourceID": "sequelize", "attributes": {}, "targetID": "lingo", "size": 1}, {
                            "sourceID": "sequelize",
                            "attributes": {},
                            "targetID": "moment",
                            "size": 1
                        }, {"sourceID": "sequelize", "attributes": {}, "targetID": "generic-pool", "size": 1}, {
                            "sourceID": "sequelize",
                            "attributes": {},
                            "targetID": "promise",
                            "size": 1
                        }, {"sourceID": "tar.gz", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "tar.gz",
                            "attributes": {},
                            "targetID": "tar",
                            "size": 1
                        }, {"sourceID": "tar.gz", "attributes": {}, "targetID": "fstream", "size": 1}, {
                            "sourceID": "prettyjson",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "escodegen", "attributes": {}, "targetID": "estraverse", "size": 1}, {
                            "sourceID": "escodegen",
                            "attributes": {},
                            "targetID": "esprima",
                            "size": 1
                        }, {"sourceID": "escodegen", "attributes": {}, "targetID": "source-map", "size": 1}, {
                            "sourceID": "url",
                            "attributes": {},
                            "targetID": "querystring",
                            "size": 1
                        }, {"sourceID": "ltx", "attributes": {}, "targetID": "sax", "size": 1}, {
                            "sourceID": "ltx",
                            "attributes": {},
                            "targetID": "node-expat",
                            "size": 1
                        }, {"sourceID": "bouncy", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "bouncy",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "simplicial-complex", "attributes": {}, "targetID": "bit-twiddle", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "lodash",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "hogan.js",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "abbrev", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "which",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "tar", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "fstream",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "archy", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "read-package-json",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "glob", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "tmp",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "rc", "size": 1}, {
                            "sourceID": "bower",
                            "attributes": {},
                            "targetID": "unzip",
                            "size": 1
                        }, {"sourceID": "bower", "attributes": {}, "targetID": "update-notifier", "size": 1}, {
                            "sourceID": "rc",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "rc", "attributes": {}, "targetID": "ini", "size": 1}, {
                            "sourceID": "rc",
                            "attributes": {},
                            "targetID": "deep-extend",
                            "size": 1
                        }, {"sourceID": "unzip", "attributes": {}, "targetID": "fstream", "size": 1}, {
                            "sourceID": "unzip",
                            "attributes": {},
                            "targetID": "readable-stream",
                            "size": 1
                        }, {"sourceID": "unzip", "attributes": {}, "targetID": "binary", "size": 1}, {
                            "sourceID": "unzip",
                            "attributes": {},
                            "targetID": "setimmediate",
                            "size": 1
                        }, {"sourceID": "scaffolder", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "scaffolder",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {
                            "sourceID": "scaffolder",
                            "attributes": {},
                            "targetID": "underscore.string",
                            "size": 1
                        }, {"sourceID": "scaffolder", "attributes": {}, "targetID": "nopt", "size": 1}, {
                            "sourceID": "scaffolder",
                            "attributes": {},
                            "targetID": "read",
                            "size": 1
                        }, {"sourceID": "scaffolder", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "scaffolder",
                            "attributes": {},
                            "targetID": "out",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "socket.io", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "prompt",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "winston", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "eventemitter2",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "portfinder", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "socket.io-client",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "union", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "nconf",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "npm", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "traverse",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "ecstatic", "size": 1}, {
                            "sourceID": "hook.io",
                            "attributes": {},
                            "targetID": "lazy",
                            "size": 1
                        }, {"sourceID": "hook.io", "attributes": {}, "targetID": "jsonify", "size": 1}, {
                            "sourceID": "fs.extra",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "fs.extra", "attributes": {}, "targetID": "walk", "size": 1}, {
                            "sourceID": "fs.extra",
                            "attributes": {},
                            "targetID": "fs-extra",
                            "size": 1
                        }, {"sourceID": "now", "attributes": {}, "targetID": "socket.io", "size": 1}, {
                            "sourceID": "now",
                            "attributes": {},
                            "targetID": "node-proxy",
                            "size": 1
                        }, {"sourceID": "brfs", "attributes": {}, "targetID": "through", "size": 1}, {
                            "sourceID": "brfs",
                            "attributes": {},
                            "targetID": "falafel",
                            "size": 1
                        }, {"sourceID": "brfs", "attributes": {}, "targetID": "escodegen", "size": 1}, {
                            "sourceID": "mongojs",
                            "attributes": {},
                            "targetID": "mongodb",
                            "size": 1
                        }, {"sourceID": "mongojs", "attributes": {}, "targetID": "readable-stream", "size": 1}, {
                            "sourceID": "feedparser",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {
                            "sourceID": "feedparser",
                            "attributes": {},
                            "targetID": "readable-stream",
                            "size": 1
                        }, {"sourceID": "feedparser", "attributes": {}, "targetID": "sax", "size": 1}, {
                            "sourceID": "broadway",
                            "attributes": {},
                            "targetID": "winston",
                            "size": 1
                        }, {"sourceID": "broadway", "attributes": {}, "targetID": "eventemitter2", "size": 1}, {
                            "sourceID": "broadway",
                            "attributes": {},
                            "targetID": "utile",
                            "size": 1
                        }, {"sourceID": "broadway", "attributes": {}, "targetID": "nconf", "size": 1}, {
                            "sourceID": "broadway",
                            "attributes": {},
                            "targetID": "cliff",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "node-uuid", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "backoff",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "lru-cache", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "once",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "qs", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "bunyan",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "deep-equal", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "formidable",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "assert-plus", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "dtrace-provider",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "negotiator", "size": 1}, {
                            "sourceID": "restify",
                            "attributes": {},
                            "targetID": "verror",
                            "size": 1
                        }, {"sourceID": "restify", "attributes": {}, "targetID": "spdy", "size": 1}, {
                            "sourceID": "cliff",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "cliff", "attributes": {}, "targetID": "winston", "size": 1}, {
                            "sourceID": "cliff",
                            "attributes": {},
                            "targetID": "eyes",
                            "size": 1
                        }, {"sourceID": "JSONStream", "attributes": {}, "targetID": "through", "size": 1}, {
                            "sourceID": "plist",
                            "attributes": {},
                            "targetID": "xmldom",
                            "size": 1
                        }, {"sourceID": "plist", "attributes": {}, "targetID": "xmlbuilder", "size": 1}, {
                            "sourceID": "natural",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "natural", "attributes": {}, "targetID": "sylvester", "size": 1}, {
                            "sourceID": "global",
                            "attributes": {},
                            "targetID": "process",
                            "size": 1
                        }, {"sourceID": "ecstatic", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "ecstatic",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "ecstatic", "attributes": {}, "targetID": "ent", "size": 1}, {
                            "sourceID": "useragent",
                            "attributes": {},
                            "targetID": "lru-cache",
                            "size": 1
                        }, {"sourceID": "snockets", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "snockets",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "snockets", "attributes": {}, "targetID": "coffee-script", "size": 1}, {
                            "sourceID": "snockets",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {"sourceID": "soupselect", "attributes": {}, "targetID": "nodeunit", "size": 1}, {
                            "sourceID": "soupselect",
                            "attributes": {},
                            "targetID": "htmlparser",
                            "size": 1
                        }, {"sourceID": "mailer", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "mailer",
                            "attributes": {},
                            "targetID": "nodemailer",
                            "size": 1
                        }, {"sourceID": "archiver", "attributes": {}, "targetID": "readable-stream", "size": 1}, {
                            "sourceID": "aws2js",
                            "attributes": {},
                            "targetID": "lodash",
                            "size": 1
                        }, {"sourceID": "aws2js", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "aws2js",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "aws2js", "attributes": {}, "targetID": "xml2js", "size": 1}, {
                            "sourceID": "websocket.io",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "websocket.io", "attributes": {}, "targetID": "ws", "size": 1}, {
                            "sourceID": "reducers",
                            "attributes": {},
                            "targetID": "reducible",
                            "size": 1
                        }, {"sourceID": "reducible", "attributes": {}, "targetID": "method", "size": 1}, {
                            "sourceID": "coffee-script-redux",
                            "attributes": {},
                            "targetID": "escodegen",
                            "size": 1
                        }, {
                            "sourceID": "coffee-script-redux",
                            "attributes": {},
                            "targetID": "source-map",
                            "size": 1
                        }, {"sourceID": "source-map", "attributes": {}, "targetID": "amdefine", "size": 1}, {
                            "sourceID": "time",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "time", "attributes": {}, "targetID": "bindings", "size": 1}, {
                            "sourceID": "cson",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "cson", "attributes": {}, "targetID": "js2coffee", "size": 1}, {
                            "sourceID": "resourceful",
                            "attributes": {},
                            "targetID": "node-uuid",
                            "size": 1
                        }, {"sourceID": "resourceful", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "resourceful",
                            "attributes": {},
                            "targetID": "cradle",
                            "size": 1
                        }, {"sourceID": "resourceful", "attributes": {}, "targetID": "utile", "size": 1}, {
                            "sourceID": "resourceful",
                            "attributes": {},
                            "targetID": "i",
                            "size": 1
                        }, {"sourceID": "resourceful", "attributes": {}, "targetID": "revalidator", "size": 1}, {
                            "sourceID": "execSync",
                            "attributes": {},
                            "targetID": "ffi",
                            "size": 1
                        }, {"sourceID": "loader-utils", "attributes": {}, "targetID": "json5", "size": 1}, {
                            "sourceID": "wd",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "wd", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "wd",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "wd", "attributes": {}, "targetID": "q", "size": 1}, {
                            "sourceID": "fs-watch-tree",
                            "attributes": {},
                            "targetID": "when",
                            "size": 1
                        }, {"sourceID": "glob-whatev", "attributes": {}, "targetID": "minimatch", "size": 1}, {
                            "sourceID": "hapi",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "hapi", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "hapi",
                            "attributes": {},
                            "targetID": "semver",
                            "size": 1
                        }, {"sourceID": "hapi", "attributes": {}, "targetID": "mime", "size": 1}, {
                            "sourceID": "hapi",
                            "attributes": {},
                            "targetID": "lru-cache",
                            "size": 1
                        }, {"sourceID": "hapi", "attributes": {}, "targetID": "hoek", "size": 1}, {
                            "sourceID": "hapi",
                            "attributes": {},
                            "targetID": "negotiator",
                            "size": 1
                        }, {"sourceID": "coffeecup", "attributes": {}, "targetID": "coffee-script", "size": 1}, {
                            "sourceID": "coffeecup",
                            "attributes": {},
                            "targetID": "stylus",
                            "size": 1
                        }, {"sourceID": "coffeecup", "attributes": {}, "targetID": "uglify-js", "size": 1}, {
                            "sourceID": "coffeecup",
                            "attributes": {},
                            "targetID": "optparse",
                            "size": 1
                        }, {"sourceID": "js-yaml", "attributes": {}, "targetID": "esprima", "size": 1}, {
                            "sourceID": "js-yaml",
                            "attributes": {},
                            "targetID": "argparse",
                            "size": 1
                        }, {"sourceID": "jeesh", "attributes": {}, "targetID": "bean", "size": 1}, {
                            "sourceID": "jeesh",
                            "attributes": {},
                            "targetID": "bonzo",
                            "size": 1
                        }, {"sourceID": "jeesh", "attributes": {}, "targetID": "qwery", "size": 1}, {
                            "sourceID": "jeesh",
                            "attributes": {},
                            "targetID": "domready",
                            "size": 1
                        }, {"sourceID": "everyauth", "attributes": {}, "targetID": "express", "size": 1}, {
                            "sourceID": "everyauth",
                            "attributes": {},
                            "targetID": "connect",
                            "size": 1
                        }, {"sourceID": "everyauth", "attributes": {}, "targetID": "request", "size": 1}, {
                            "sourceID": "everyauth",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "everyauth", "attributes": {}, "targetID": "xml2js", "size": 1}, {
                            "sourceID": "everyauth",
                            "attributes": {},
                            "targetID": "oauth",
                            "size": 1
                        }, {"sourceID": "everyauth", "attributes": {}, "targetID": "openid", "size": 1}, {
                            "sourceID": "deferred",
                            "attributes": {},
                            "targetID": "es5-ext",
                            "size": 1
                        }, {"sourceID": "postal", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "ahr2",
                            "attributes": {},
                            "targetID": "bufferjs",
                            "size": 1
                        }, {"sourceID": "ahr2", "attributes": {}, "targetID": "future", "size": 1}, {
                            "sourceID": "source-map-support",
                            "attributes": {},
                            "targetID": "source-map",
                            "size": 1
                        }, {"sourceID": "needle", "attributes": {}, "targetID": "qs", "size": 1}, {
                            "sourceID": "needle",
                            "attributes": {},
                            "targetID": "iconv-lite",
                            "size": 1
                        }, {
                            "sourceID": "read-stream",
                            "attributes": {},
                            "targetID": "readable-stream",
                            "size": 1
                        }, {"sourceID": "read-stream", "attributes": {}, "targetID": "process", "size": 1}, {
                            "sourceID": "write-stream",
                            "attributes": {},
                            "targetID": "readable-stream",
                            "size": 1
                        }, {"sourceID": "sockjs", "attributes": {}, "targetID": "faye-websocket", "size": 1}, {
                            "sourceID": "sockjs",
                            "attributes": {},
                            "targetID": "node-uuid",
                            "size": 1
                        }, {"sourceID": "engine.io", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "engine.io",
                            "attributes": {},
                            "targetID": "ws",
                            "size": 1
                        }, {"sourceID": "crdt", "attributes": {}, "targetID": "scuttlebutt", "size": 1}, {
                            "sourceID": "mux-demux",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "mux-demux", "attributes": {}, "targetID": "xtend", "size": 1}, {
                            "sourceID": "mux-demux",
                            "attributes": {},
                            "targetID": "duplex",
                            "size": 1
                        }, {"sourceID": "mux-demux", "attributes": {}, "targetID": "stream-combiner", "size": 1}, {
                            "sourceID": "devnull",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "d3", "attributes": {}, "targetID": "jsdom", "size": 1}, {
                            "sourceID": "twitter",
                            "attributes": {},
                            "targetID": "cookies",
                            "size": 1
                        }, {"sourceID": "twitter", "attributes": {}, "targetID": "oauth", "size": 1}, {
                            "sourceID": "twitter",
                            "attributes": {},
                            "targetID": "keygrip",
                            "size": 1
                        }, {
                            "sourceID": "less-middleware",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "less-middleware", "attributes": {}, "targetID": "less", "size": 1}, {
                            "sourceID": "i18n",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "i18n", "attributes": {}, "targetID": "sprintf", "size": 1}, {
                            "sourceID": "pushover",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "pushover", "attributes": {}, "targetID": "inherits", "size": 1}, {
                            "sourceID": "pushover",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "fs-tools", "attributes": {}, "targetID": "lodash", "size": 1}, {
                            "sourceID": "fs-tools",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "hbs", "attributes": {}, "targetID": "handlebars", "size": 1}, {
                            "sourceID": "hbs",
                            "attributes": {},
                            "targetID": "after",
                            "size": 1
                        }, {"sourceID": "follow", "attributes": {}, "targetID": "request", "size": 1}, {
                            "sourceID": "phantomjs",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "phantomjs", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "phantomjs",
                            "attributes": {},
                            "targetID": "npmconf",
                            "size": 1
                        }, {"sourceID": "phantomjs", "attributes": {}, "targetID": "adm-zip", "size": 1}, {
                            "sourceID": "phantomjs",
                            "attributes": {},
                            "targetID": "ncp",
                            "size": 1
                        }, {"sourceID": "phantomjs", "attributes": {}, "targetID": "kew", "size": 1}, {
                            "sourceID": "tracer",
                            "attributes": {},
                            "targetID": "dateformat",
                            "size": 1
                        }, {"sourceID": "tracer", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "axon",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "nssocket", "attributes": {}, "targetID": "eventemitter2", "size": 1}, {
                            "sourceID": "nssocket",
                            "attributes": {},
                            "targetID": "lazy",
                            "size": 1
                        }, {"sourceID": "dropbox", "attributes": {}, "targetID": "open", "size": 1}, {
                            "sourceID": "cluster",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {"sourceID": "cluster", "attributes": {}, "targetID": "log", "size": 1}, {
                            "sourceID": "aws-lib",
                            "attributes": {},
                            "targetID": "sax",
                            "size": 1
                        }, {"sourceID": "aws-lib", "attributes": {}, "targetID": "xml2js", "size": 1}, {
                            "sourceID": "node-phantom",
                            "attributes": {},
                            "targetID": "socket.io",
                            "size": 1
                        }, {"sourceID": "gzippo", "attributes": {}, "targetID": "send", "size": 1}, {
                            "sourceID": "verror",
                            "attributes": {},
                            "targetID": "extsprintf",
                            "size": 1
                        }, {"sourceID": "dox", "attributes": {}, "targetID": "commander", "size": 1}, {
                            "sourceID": "dox",
                            "attributes": {},
                            "targetID": "github-flavored-markdown",
                            "size": 1
                        }, {"sourceID": "node-sass", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "node-sass",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "node-sass", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "gm",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "gm", "attributes": {}, "targetID": "through", "size": 1}, {
                            "sourceID": "node-log",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {
                            "sourceID": "node-log",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {
                            "sourceID": "component-builder",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {
                            "sourceID": "component-builder",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {
                            "sourceID": "component-builder",
                            "attributes": {},
                            "targetID": "fs-extra",
                            "size": 1
                        }, {"sourceID": "component-builder", "attributes": {}, "targetID": "batch", "size": 1}, {
                            "sourceID": "hyperquest",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "hyperquest", "attributes": {}, "targetID": "duplexer", "size": 1}, {
                            "sourceID": "graphviz",
                            "attributes": {},
                            "targetID": "temp",
                            "size": 1
                        }, {"sourceID": "levelup", "attributes": {}, "targetID": "semver", "size": 1}, {
                            "sourceID": "levelup",
                            "attributes": {},
                            "targetID": "xtend",
                            "size": 1
                        }, {"sourceID": "levelup", "attributes": {}, "targetID": "concat-stream", "size": 1}, {
                            "sourceID": "msgpack-js",
                            "attributes": {},
                            "targetID": "bops",
                            "size": 1
                        }, {"sourceID": "mincer", "attributes": {}, "targetID": "lodash", "size": 1}, {
                            "sourceID": "mincer",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "mincer", "attributes": {}, "targetID": "argparse", "size": 1}, {
                            "sourceID": "mincer",
                            "attributes": {},
                            "targetID": "fs-tools",
                            "size": 1
                        }, {"sourceID": "riak-js", "attributes": {}, "targetID": "xml", "size": 1}, {
                            "sourceID": "contextify",
                            "attributes": {},
                            "targetID": "bindings",
                            "size": 1
                        }, {"sourceID": "level-sublevel", "attributes": {}, "targetID": "xtend", "size": 1}, {
                            "sourceID": "tape",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "tape", "attributes": {}, "targetID": "deep-equal", "size": 1}, {
                            "sourceID": "tape",
                            "attributes": {},
                            "targetID": "jsonify",
                            "size": 1
                        }, {"sourceID": "elementtree", "attributes": {}, "targetID": "sax", "size": 1}, {
                            "sourceID": "ftp",
                            "attributes": {},
                            "targetID": "xregexp",
                            "size": 1
                        }, {
                            "sourceID": "node-inspector",
                            "attributes": {},
                            "targetID": "socket.io",
                            "size": 1
                        }, {
                            "sourceID": "node-inspector",
                            "attributes": {},
                            "targetID": "connect",
                            "size": 1
                        }, {"sourceID": "node-inspector", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "portscanner",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "burrito", "attributes": {}, "targetID": "uglify-js", "size": 1}, {
                            "sourceID": "burrito",
                            "attributes": {},
                            "targetID": "traverse",
                            "size": 1
                        }, {"sourceID": "trumpet", "attributes": {}, "targetID": "inherits", "size": 1}, {
                            "sourceID": "trumpet",
                            "attributes": {},
                            "targetID": "sax",
                            "size": 1
                        }, {"sourceID": "trumpet", "attributes": {}, "targetID": "through", "size": 1}, {
                            "sourceID": "trumpet",
                            "attributes": {},
                            "targetID": "duplexer",
                            "size": 1
                        }, {"sourceID": "trumpet", "attributes": {}, "targetID": "buffers", "size": 1}, {
                            "sourceID": "trumpet",
                            "attributes": {},
                            "targetID": "ent",
                            "size": 1
                        }, {"sourceID": "ref", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "ref",
                            "attributes": {},
                            "targetID": "bindings",
                            "size": 1
                        }, {"sourceID": "ref-struct", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "ref-struct",
                            "attributes": {},
                            "targetID": "ref",
                            "size": 1
                        }, {"sourceID": "ffi", "attributes": {}, "targetID": "debug", "size": 1}, {
                            "sourceID": "ffi",
                            "attributes": {},
                            "targetID": "bindings",
                            "size": 1
                        }, {"sourceID": "ffi", "attributes": {}, "targetID": "ref", "size": 1}, {
                            "sourceID": "ffi",
                            "attributes": {},
                            "targetID": "ref-struct",
                            "size": 1
                        }, {"sourceID": "scuttlebutt", "attributes": {}, "targetID": "duplex", "size": 1}, {
                            "sourceID": "scuttlebutt",
                            "attributes": {},
                            "targetID": "monotonic-timestamp",
                            "size": 1
                        }, {"sourceID": "form-data", "attributes": {}, "targetID": "async", "size": 1}, {
                            "sourceID": "form-data",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "js2coffee", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "js2coffee",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "js2coffee", "attributes": {}, "targetID": "file", "size": 1}, {
                            "sourceID": "css",
                            "attributes": {},
                            "targetID": "css-parse",
                            "size": 1
                        }, {"sourceID": "js-beautify", "attributes": {}, "targetID": "mkdirp", "size": 1}, {
                            "sourceID": "js-beautify",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "q-io", "attributes": {}, "targetID": "q", "size": 1}, {
                            "sourceID": "q-io",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "q-io", "attributes": {}, "targetID": "qs", "size": 1}, {
                            "sourceID": "q-io",
                            "attributes": {},
                            "targetID": "collections",
                            "size": 1
                        }, {"sourceID": "JSONPath", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "mochiscript",
                            "attributes": {},
                            "targetID": "watch",
                            "size": 1
                        }, {"sourceID": "leveldown", "attributes": {}, "targetID": "bindings", "size": 1}, {
                            "sourceID": "sync",
                            "attributes": {},
                            "targetID": "fibers",
                            "size": 1
                        }, {"sourceID": "extended", "attributes": {}, "targetID": "grunt", "size": 1}, {
                            "sourceID": "is-extended",
                            "attributes": {},
                            "targetID": "extended",
                            "size": 1
                        }, {"sourceID": "array-extended", "attributes": {}, "targetID": "grunt", "size": 1}, {
                            "sourceID": "array-extended",
                            "attributes": {},
                            "targetID": "grunt-contrib-jshint",
                            "size": 1
                        }, {
                            "sourceID": "array-extended",
                            "attributes": {},
                            "targetID": "grunt-contrib-uglify",
                            "size": 1
                        }, {
                            "sourceID": "array-extended",
                            "attributes": {},
                            "targetID": "extended",
                            "size": 1
                        }, {
                            "sourceID": "array-extended",
                            "attributes": {},
                            "targetID": "is-extended",
                            "size": 1
                        }, {"sourceID": "stream-combiner", "attributes": {}, "targetID": "duplexer", "size": 1}, {
                            "sourceID": "uglify-js2",
                            "attributes": {},
                            "targetID": "optimist",
                            "size": 1
                        }, {"sourceID": "uglify-js2", "attributes": {}, "targetID": "source-map", "size": 1}, {
                            "sourceID": "upnode",
                            "attributes": {},
                            "targetID": "dnode",
                            "size": 1
                        }, {
                            "sourceID": "fstream-ignore",
                            "attributes": {},
                            "targetID": "minimatch",
                            "size": 1
                        }, {
                            "sourceID": "fstream-ignore",
                            "attributes": {},
                            "targetID": "fstream",
                            "size": 1
                        }, {"sourceID": "fstream-ignore", "attributes": {}, "targetID": "inherits", "size": 1}, {
                            "sourceID": "smoosh",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {"sourceID": "smoosh", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "smoosh",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {"sourceID": "smoosh", "attributes": {}, "targetID": "jshint", "size": 1}, {
                            "sourceID": "smoosh",
                            "attributes": {},
                            "targetID": "sqwish",
                            "size": 1
                        }, {"sourceID": "yui", "attributes": {}, "targetID": "request", "size": 1}, {
                            "sourceID": "difflet",
                            "attributes": {},
                            "targetID": "charm",
                            "size": 1
                        }, {"sourceID": "difflet", "attributes": {}, "targetID": "traverse", "size": 1}, {
                            "sourceID": "shoe",
                            "attributes": {},
                            "targetID": "sockjs",
                            "size": 1
                        }, {"sourceID": "level", "attributes": {}, "targetID": "levelup", "size": 1}, {
                            "sourceID": "level",
                            "attributes": {},
                            "targetID": "leveldown",
                            "size": 1
                        }, {"sourceID": "markdown-js", "attributes": {}, "targetID": "test", "size": 1}, {
                            "sourceID": "yamljs",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {"sourceID": "yamljs", "attributes": {}, "targetID": "argparse", "size": 1}, {
                            "sourceID": "passport-http",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {
                            "sourceID": "passport-http",
                            "attributes": {},
                            "targetID": "passport",
                            "size": 1
                        }, {"sourceID": "docparse-config", "attributes": {}, "targetID": "temp", "size": 1}, {
                            "sourceID": "docparse-config",
                            "attributes": {},
                            "targetID": "nconf",
                            "size": 1
                        }, {"sourceID": "seaport", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "seaport",
                            "attributes": {},
                            "targetID": "semver",
                            "size": 1
                        }, {"sourceID": "seaport", "attributes": {}, "targetID": "inherits", "size": 1}, {
                            "sourceID": "seaport",
                            "attributes": {},
                            "targetID": "through",
                            "size": 1
                        }, {"sourceID": "seaport", "attributes": {}, "targetID": "crdt", "size": 1}, {
                            "sourceID": "loggly-console-logger",
                            "attributes": {},
                            "targetID": "winston",
                            "size": 1
                        }, {"sourceID": "apn", "attributes": {}, "targetID": "q", "size": 1}, {
                            "sourceID": "passport-google-oauth",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {
                            "sourceID": "passport-google-oauth",
                            "attributes": {},
                            "targetID": "passport-oauth",
                            "size": 1
                        }, {"sourceID": "forEachAsync", "attributes": {}, "targetID": "sequence", "size": 1}, {
                            "sourceID": "yuidocjs",
                            "attributes": {},
                            "targetID": "express",
                            "size": 1
                        }, {"sourceID": "yuidocjs", "attributes": {}, "targetID": "graceful-fs", "size": 1}, {
                            "sourceID": "yuidocjs",
                            "attributes": {},
                            "targetID": "minimatch",
                            "size": 1
                        }, {"sourceID": "yuidocjs", "attributes": {}, "targetID": "rimraf", "size": 1}, {
                            "sourceID": "yuidocjs",
                            "attributes": {},
                            "targetID": "node-markdown",
                            "size": 1
                        }, {"sourceID": "yuidocjs", "attributes": {}, "targetID": "yui", "size": 1}, {
                            "sourceID": "mongoose-types",
                            "attributes": {},
                            "targetID": "mongoose",
                            "size": 1
                        }, {"sourceID": "funargs", "attributes": {}, "targetID": "eyes", "size": 1}, {
                            "sourceID": "ender-bootstrap-base",
                            "attributes": {},
                            "targetID": "bean",
                            "size": 1
                        }, {
                            "sourceID": "ender-bootstrap-base",
                            "attributes": {},
                            "targetID": "bonzo",
                            "size": 1
                        }, {
                            "sourceID": "ender-bootstrap-base",
                            "attributes": {},
                            "targetID": "domready",
                            "size": 1
                        }, {
                            "sourceID": "ender-bootstrap-transition",
                            "attributes": {},
                            "targetID": "ender-bootstrap-base",
                            "size": 1
                        }, {
                            "sourceID": "engine.io-client",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {"sourceID": "engine.io-client", "attributes": {}, "targetID": "ws", "size": 1}, {
                            "sourceID": "engine.io-client",
                            "attributes": {},
                            "targetID": "xmlhttprequest",
                            "size": 1
                        }, {"sourceID": "ldapjs", "attributes": {}, "targetID": "nopt", "size": 1}, {
                            "sourceID": "ldapjs",
                            "attributes": {},
                            "targetID": "bunyan",
                            "size": 1
                        }, {"sourceID": "ldapjs", "attributes": {}, "targetID": "buffertools", "size": 1}, {
                            "sourceID": "ldapjs",
                            "attributes": {},
                            "targetID": "assert-plus",
                            "size": 1
                        }, {"sourceID": "ldapjs", "attributes": {}, "targetID": "dtrace-provider", "size": 1}, {
                            "sourceID": "LiveScript",
                            "attributes": {},
                            "targetID": "prelude-ls",
                            "size": 1
                        }, {"sourceID": "reconnect", "attributes": {}, "targetID": "backoff", "size": 1}, {
                            "sourceID": "reconnect",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {"sourceID": "reconnect", "attributes": {}, "targetID": "shoe", "size": 1}, {
                            "sourceID": "exec-sync",
                            "attributes": {},
                            "targetID": "ffi",
                            "size": 1
                        }, {
                            "sourceID": "passport-facebook",
                            "attributes": {},
                            "targetID": "pkginfo",
                            "size": 1
                        }, {
                            "sourceID": "passport-facebook",
                            "attributes": {},
                            "targetID": "passport-oauth",
                            "size": 1
                        }, {
                            "sourceID": "update-notifier",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {
                            "sourceID": "update-notifier",
                            "attributes": {},
                            "targetID": "semver",
                            "size": 1
                        }, {"sourceID": "update-notifier", "attributes": {}, "targetID": "colors", "size": 1}, {
                            "sourceID": "fire",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {"sourceID": "latest", "attributes": {}, "targetID": "npm", "size": 1}, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "cheerio",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "lodash",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "mkdirp",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "request",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "underscore.string",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "nopt",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "rimraf",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "tar",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "debug",
                            "size": 1
                        }, {
                            "sourceID": "yeoman-generator",
                            "attributes": {},
                            "targetID": "cli-table",
                            "size": 1
                        }, {"sourceID": "yeoman-generator", "attributes": {}, "targetID": "diff", "size": 1}, {
                            "sourceID": "jsftp",
                            "attributes": {},
                            "targetID": "async",
                            "size": 1
                        }, {"sourceID": "jsftp", "attributes": {}, "targetID": "event-stream", "size": 1}, {
                            "sourceID": "xmlrpc",
                            "attributes": {},
                            "targetID": "sax",
                            "size": 1
                        }, {"sourceID": "xmlrpc", "attributes": {}, "targetID": "xmlbuilder", "size": 1}, {
                            "sourceID": "twit",
                            "attributes": {},
                            "targetID": "oauth",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-cssmin",
                            "attributes": {},
                            "targetID": "clean-css",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-cssmin",
                            "attributes": {},
                            "targetID": "grunt-lib-contrib",
                            "size": 1
                        }, {
                            "sourceID": "grunt-contrib-nodeunit",
                            "attributes": {},
                            "targetID": "nodeunit",
                            "size": 1
                        }, {
                            "sourceID": "grunt-lib-phantomjs",
                            "attributes": {},
                            "targetID": "semver",
                            "size": 1
                        }, {
                            "sourceID": "grunt-lib-phantomjs",
                            "attributes": {},
                            "targetID": "eventemitter2",
                            "size": 1
                        }, {
                            "sourceID": "grunt-lib-phantomjs",
                            "attributes": {},
                            "targetID": "temporary",
                            "size": 1
                        }, {"sourceID": "grunt-lib-phantomjs", "attributes": {}, "targetID": "phantomjs", "size": 1}, {
                            "sourceID": "joose",
                            "attributes": {},
                            "targetID": "temp",
                            "size": 1
                        }, {"sourceID": "joose", "attributes": {}, "targetID": "optimist", "size": 1}, {
                            "sourceID": "joose",
                            "attributes": {},
                            "targetID": "detective",
                            "size": 1
                        }, {"sourceID": "iwebpp.io", "attributes": {}, "targetID": "node-uuid", "size": 1}, {
                            "sourceID": "iwebpp.io",
                            "attributes": {},
                            "targetID": "msgpack-js",
                            "size": 1
                        }, {
                            "sourceID": "iwebpp.io",
                            "attributes": {},
                            "targetID": "siphash",
                            "size": 1
                        }, {
                            "sourceID": "jsgui-lang-essentials",
                            "attributes": {},
                            "targetID": "amdefine",
                            "size": 1
                        }, {"sourceID": "logmimosa", "attributes": {}, "targetID": "growl", "size": 1}, {
                            "sourceID": "logmimosa",
                            "attributes": {},
                            "targetID": "date-utils",
                            "size": 1
                        }, {
                            "sourceID": "logmimosa",
                            "attributes": {},
                            "targetID": "ansi-color",
                            "size": 1
                        }, {
                            "sourceID": "node-document-storage",
                            "attributes": {},
                            "targetID": "colors",
                            "size": 1
                        }, {
                            "sourceID": "node-document-storage",
                            "attributes": {},
                            "targetID": "sugar",
                            "size": 1
                        }, {
                            "sourceID": "node-document-storage",
                            "attributes": {},
                            "targetID": "chai",
                            "size": 1
                        }, {
                            "sourceID": "node-document-storage",
                            "attributes": {},
                            "targetID": "longjohn",
                            "size": 1
                        }, {
                            "sourceID": "node-document-storage",
                            "attributes": {},
                            "targetID": "sync",
                            "size": 1
                        }, {"sourceID": "node-document-storage", "attributes": {}, "targetID": "funargs", "size": 1}, {
                            "sourceID": "noflo",
                            "attributes": {},
                            "targetID": "underscore",
                            "size": 1
                        }, {"sourceID": "noflo", "attributes": {}, "targetID": "npmlog", "size": 1}, {
                            "sourceID": "noflo",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "noflo", "attributes": {}, "targetID": "cli-color", "size": 1}, {
                            "sourceID": "noflo",
                            "attributes": {},
                            "targetID": "cli",
                            "size": 1
                        }, {"sourceID": "punch", "attributes": {}, "targetID": "underscore", "size": 1}, {
                            "sourceID": "punch",
                            "attributes": {},
                            "targetID": "connect",
                            "size": 1
                        }, {"sourceID": "punch", "attributes": {}, "targetID": "mustache", "size": 1}, {
                            "sourceID": "punch",
                            "attributes": {},
                            "targetID": "mime",
                            "size": 1
                        }, {"sourceID": "punch", "attributes": {}, "targetID": "fstream", "size": 1}, {
                            "sourceID": "punch",
                            "attributes": {},
                            "targetID": "coffee-script",
                            "size": 1
                        }, {"sourceID": "punch", "attributes": {}, "targetID": "less", "size": 1}, {
                            "sourceID": "punch",
                            "attributes": {},
                            "targetID": "uglify-js",
                            "size": 1
                        }, {"sourceID": "punch", "attributes": {}, "targetID": "knox", "size": 1}, {
                            "sourceID": "punch",
                            "attributes": {},
                            "targetID": "marked",
                            "size": 1
                        }, {"sourceID": "punch", "attributes": {}, "targetID": "fresh", "size": 1}, {
                            "sourceID": "punch",
                            "attributes": {},
                            "targetID": "cssmin",
                            "size": 1
                        }, {
                            "sourceID": "joosex-namespace-depended",
                            "attributes": {},
                            "targetID": "joose",
                            "size": 1
                        }, {
                            "sourceID": "sourcemint-util-js",
                            "attributes": {},
                            "targetID": "q",
                            "size": 1
                        }, {
                            "sourceID": "sourcemint-util-js",
                            "attributes": {},
                            "targetID": "glob",
                            "size": 1
                        }, {
                            "sourceID": "sourcemint-util-js",
                            "attributes": {},
                            "targetID": "wrench",
                            "size": 1
                        }, {
                            "sourceID": "sourcemint-util-js",
                            "attributes": {},
                            "targetID": "tunnel",
                            "size": 1
                        }, {"sourceID": "tower-directive", "attributes": {}, "targetID": "tower-emitter", "size": 1}, {
                            "sourceID": "voxel",
                            "attributes": {},
                            "targetID": "inherits",
                            "size": 1
                        }]
                    }
                    // $http.get('data/asset/data/npmdepgraph.min10.json').success(function (json) {
                    relation.hideLoading();
                    var option = {
                        title: {
                            text: 'NPM Dependencies'
                        },
                        animationDurationUpdate: 1500,
                        animationEasingUpdate: 'quinticInOut',
                        series: [
                            {
                                type: 'graph',
                                layout: 'none',
                                // progressiveThreshold: 700,
                                data: json.nodes.map(function (node) {
                                    return {
                                        x: node.x,
                                        y: node.y,
                                        id: node.id,
                                        name: node.label,
                                        symbolSize: node.size,
                                        itemStyle: {
                                            normal: {
                                                color: node.color
                                            }
                                        }
                                    };
                                }),
                                edges: json.edges.map(function (edge) {
                                    return {
                                        source: edge.sourceID,
                                        target: edge.targetID
                                    };
                                }),
                                label: {
                                    emphasis: {
                                        position: 'right',
                                        show: true
                                    }
                                },
                                roam: true,
                                focusNodeAdjacency: true,
                                lineStyle: {
                                    normal: {
                                        width: 0.5,
                                        curveness: 0.3,
                                        opacity: 0.7
                                    }
                                }
                            }
                        ]
                    };
                    // });
                    relation.setOption(option);
                })
            }
        };
    }])
    /**
     * 市场分布
     */
    .directive("market", ['$http', '$log', function ($http, $log) {
        return {
            restrict: "EAC",
            template: "<div id='market' style='width: auto;height:1024px'></div>",
            scope: {
                'data': '='
            },
            replace: true,
            controller: function ($scope, $ionicLoading) {
                $scope.$watch('data', function () {
                    $log.debug('data', $scope.data)
                    var height = document.getElementById('market');
                    height.style.height = window.screen.height - 200 + 'px';
                    var market = echarts.init(document.getElementById('market'));
                    market.showLoading();

                    var household_america_2012 = 113616229;
                    var obama_budget_2012 = [
                        {
                            "value": [
                                1226629000,
                                null,
                                null
                            ],
                            "name": "Health and Human Services",
                            "id": "branch-8",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        1105220000,
                                        1071808000,
                                        3.11734937600765
                                    ],
                                    "name": "Centers for Medicare and Medicaid Services",
                                    "id": "leaf-135",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        34502000,
                                        34325000,
                                        0.515659140568103
                                    ],
                                    "name": "Administration for Children and Families",
                                    "id": "leaf-131",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        31829000,
                                        30784000,
                                        3.39462058212059
                                    ],
                                    "name": "National Institutes of Health",
                                    "id": "leaf-127",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        16180000,
                                        17334000,
                                        -6.65743625245183
                                    ],
                                    "name": "Administration for Children and Families",
                                    "id": "leaf-118",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7324000,
                                        6246000,
                                        17.2590457893051
                                    ],
                                    "name": "Centers for Medicare and Medicaid Services",
                                    "id": "leaf-121",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6821000,
                                        7506000,
                                        -9.12603250732747
                                    ],
                                    "name": "Health Resources and Services Administration",
                                    "id": "leaf-125",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5893000,
                                        6467000,
                                        -8.8758311427246
                                    ],
                                    "name": "Centers for Disease Control and Prevention",
                                    "id": "leaf-120",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4624000,
                                        4053000,
                                        14.0883296323711
                                    ],
                                    "name": "Indian Health Services",
                                    "id": "leaf-126",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3387000,
                                        3431000,
                                        -1.28242494899447
                                    ],
                                    "name": "Substance Abuse and Mental Health Services Administration",
                                    "id": "leaf-130",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2744000,
                                        2599000,
                                        5.57906887264332
                                    ],
                                    "name": "Food and Drug Administration",
                                    "id": "leaf-124",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2237000,
                                        1513000,
                                        47.8519497686715
                                    ],
                                    "name": "Administration on Aging",
                                    "id": "leaf-119",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2155000,
                                        707000,
                                        204.809052333805
                                    ],
                                    "name": "Health Resources and Services Administration",
                                    "id": "leaf-139",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1063000,
                                        4554000,
                                        -76.6578831796223
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-123",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        809000,
                                        297000,
                                        172.390572390572
                                    ],
                                    "name": "Centers for Disease Control and Prevention",
                                    "id": "leaf-134",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        647000,
                                        610000,
                                        6.06557377049179
                                    ],
                                    "name": "Program Support Center",
                                    "id": "leaf-143",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        473000,
                                        1047000,
                                        -54.8233046800382
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-137",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        210000,
                                        10000,
                                        2000
                                    ],
                                    "name": "Administration on Aging",
                                    "id": "leaf-132",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        166000,
                                        166000,
                                        0
                                    ],
                                    "name": "National Institutes of Health",
                                    "id": "leaf-141",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        158000,
                                        158000,
                                        0
                                    ],
                                    "name": "Indian Health Services",
                                    "id": "leaf-140",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        93000,
                                        20000,
                                        365
                                    ],
                                    "name": "Substance Abuse and Mental Health Services Administration",
                                    "id": "leaf-144",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        53000,
                                        50000,
                                        6.00000000000001
                                    ],
                                    "name": "Office of the Inspector General",
                                    "id": "leaf-128",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        39000,
                                        36000,
                                        8.33333333333333
                                    ],
                                    "name": "Program Support Center",
                                    "id": "leaf-129",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "Food and Drug Administration",
                                    "id": "leaf-138",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                818284000,
                                null,
                                null
                            ],
                            "name": "Social Security Administration",
                            "id": "branch-34",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        808041000,
                                        744812000,
                                        8.48925634925324
                                    ],
                                    "name": "Social Security Administration",
                                    "id": "leaf-531",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        10243000,
                                        9294000,
                                        10.2108887454271
                                    ],
                                    "name": "Social Security Administration",
                                    "id": "leaf-530",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                677483000,
                                null,
                                null
                            ],
                            "name": "Defense--Military Programs",
                            "id": "branch-5",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        294891000,
                                        292828000,
                                        0.704509131640418
                                    ],
                                    "name": "Operation and Maintenance",
                                    "id": "leaf-77",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        154057000,
                                        152586000,
                                        0.964046504921812
                                    ],
                                    "name": "Military Personnel",
                                    "id": "leaf-76",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        128051000,
                                        135819000,
                                        -5.71937652316686
                                    ],
                                    "name": "Procurement",
                                    "id": "leaf-78",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        75722000,
                                        80232000,
                                        -5.62119852427959
                                    ],
                                    "name": "Research, Development, Test, and Evaluation",
                                    "id": "leaf-79",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13073000,
                                        22578000,
                                        -42.0985029674905
                                    ],
                                    "name": "Military Construction",
                                    "id": "leaf-75",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5475000,
                                        4516000,
                                        21.2356067316209
                                    ],
                                    "name": "Military Personnel",
                                    "id": "leaf-83",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3136000,
                                        4159000,
                                        -24.5972589564799
                                    ],
                                    "name": "Revolving and Management Funds",
                                    "id": "leaf-80",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1695000,
                                        2267000,
                                        -25.2315835906484
                                    ],
                                    "name": "Family Housing",
                                    "id": "leaf-74",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        836000,
                                        804000,
                                        3.98009950248757
                                    ],
                                    "name": "Operation and Maintenance",
                                    "id": "leaf-84",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        447000,
                                        756000,
                                        -40.8730158730159
                                    ],
                                    "name": "Trust Funds",
                                    "id": "leaf-88",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        100000,
                                        756000,
                                        null
                                    ],
                                    "name": "Research, Development, Test, and Evaluation",
                                    "id": "leaf-86",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                612004000,
                                null,
                                null
                            ],
                            "name": "Treasury",
                            "id": "branch-15",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        474146000,
                                        413955000,
                                        14.5404693746905
                                    ],
                                    "name": "Interest on the Public Debt",
                                    "id": "leaf-279",
                                    "discretion": "net interest"
                                },
                                {
                                    "value": [
                                        82053000,
                                        110583000,
                                        -25.7996256205746
                                    ],
                                    "name": "Internal Revenue Service",
                                    "id": "leaf-275",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        24495000,
                                        12679000,
                                        93.1934695165234
                                    ],
                                    "name": "Financial Management Service",
                                    "id": "leaf-278",
                                    "discretion": "net interest"
                                },
                                {
                                    "value": [
                                        13285000,
                                        12147000,
                                        9.36856837079114
                                    ],
                                    "name": "Internal Revenue Service",
                                    "id": "leaf-269",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9495000,
                                        15156000,
                                        -37.3515439429929
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-273",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3841000,
                                        2192000,
                                        75.228102189781
                                    ],
                                    "name": "Financial Management Service",
                                    "id": "leaf-274",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3289000,
                                        2177000,
                                        51.0794671566376
                                    ],
                                    "name": "Internal Revenue Service",
                                    "id": "leaf-280",
                                    "discretion": "net interest"
                                },
                                {
                                    "value": [
                                        510000,
                                        378000,
                                        34.9206349206349
                                    ],
                                    "name": "Alcohol and Tobacco Tax and Trade Bureau",
                                    "id": "leaf-270",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        219000,
                                        244000,
                                        -10.2459016393443
                                    ],
                                    "name": "Financial Management Service",
                                    "id": "leaf-268",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        166000,
                                        861000,
                                        -80.7200929152149
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-266",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        166000,
                                        185000,
                                        -10.2702702702703
                                    ],
                                    "name": "Bureau of the Public Debt",
                                    "id": "leaf-264",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        127000,
                                        103000,
                                        23.3009708737864
                                    ],
                                    "name": "Bureau of the Public Debt",
                                    "id": "leaf-271",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        114000,
                                        111000,
                                        2.7027027027027
                                    ],
                                    "name": "Financial Crimes Enforcement Network",
                                    "id": "leaf-267",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        98000,
                                        103000,
                                        -4.85436893203883
                                    ],
                                    "name": "Alcohol and Tobacco Tax and Trade Bureau",
                                    "id": "leaf-263",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                148349000,
                                null,
                                null
                            ],
                            "name": "Agriculture",
                            "id": "branch-3",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        104212000,
                                        85935000,
                                        21.2684005352883
                                    ],
                                    "name": "Food and Nutrition Service",
                                    "id": "leaf-39",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        9801000,
                                        10069000,
                                        -2.66163472042904
                                    ],
                                    "name": "Farm Service Agency",
                                    "id": "leaf-38",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        7765000,
                                        8227000,
                                        -5.61565576759451
                                    ],
                                    "name": "Food and Nutrition Service",
                                    "id": "leaf-14",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5125000,
                                        5313000,
                                        -3.53849049501224
                                    ],
                                    "name": "Forest Service",
                                    "id": "leaf-17",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4592000,
                                        2939000,
                                        56.2436202790065
                                    ],
                                    "name": "Natural Resources Conservation Service",
                                    "id": "leaf-44",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2981000,
                                        4547000,
                                        -34.4402903012976
                                    ],
                                    "name": "Risk Management Agency",
                                    "id": "leaf-47",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2124000,
                                        2376000,
                                        -10.6060606060606
                                    ],
                                    "name": "Foreign Agricultural Service",
                                    "id": "leaf-16",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1777000,
                                        2139000,
                                        -16.9237961664329
                                    ],
                                    "name": "Farm Service Agency",
                                    "id": "leaf-13",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1446000,
                                        1885000,
                                        -23.289124668435
                                    ],
                                    "name": "Rural Housing Service",
                                    "id": "leaf-31",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1306000,
                                        1276000,
                                        2.35109717868338
                                    ],
                                    "name": "Agricultural Marketing Service",
                                    "id": "leaf-33",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1209000,
                                        1351000,
                                        -10.5107327905255
                                    ],
                                    "name": "National Institute of Food and Agriculture",
                                    "id": "leaf-21",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1011000,
                                        1019000,
                                        -0.785083415112853
                                    ],
                                    "name": "Food Safety and Inspection Service",
                                    "id": "leaf-15",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        914000,
                                        1251000,
                                        -26.9384492406075
                                    ],
                                    "name": "Agricultural Research Service",
                                    "id": "leaf-7",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        838000,
                                        949000,
                                        -11.6965226554268
                                    ],
                                    "name": "Animal and Plant Health Inspection Service",
                                    "id": "leaf-8",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        695000,
                                        779000,
                                        -10.783055198973
                                    ],
                                    "name": "Forest Service",
                                    "id": "leaf-42",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        577000,
                                        694000,
                                        -16.8587896253602
                                    ],
                                    "name": "Rural Utilities Service",
                                    "id": "leaf-32",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        412000,
                                        431000,
                                        -4.40835266821346
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-10",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        264000,
                                        320000,
                                        -17.5
                                    ],
                                    "name": "Animal and Plant Health Inspection Service",
                                    "id": "leaf-35",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        234000,
                                        202000,
                                        15.8415841584158
                                    ],
                                    "name": "Rural Development",
                                    "id": "leaf-30",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        175000,
                                        384000,
                                        -54.4270833333333
                                    ],
                                    "name": "Rural Business_Cooperative Service",
                                    "id": "leaf-48",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        165000,
                                        162000,
                                        1.85185185185186
                                    ],
                                    "name": "National Agricultural Statistics Service",
                                    "id": "leaf-19",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        134000,
                                        123000,
                                        8.9430894308943
                                    ],
                                    "name": "National Institute of Food and Agriculture",
                                    "id": "leaf-43",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        99000,
                                        93000,
                                        6.4516129032258
                                    ],
                                    "name": "Agricultural Marketing Service",
                                    "id": "leaf-6",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        91000,
                                        89000,
                                        2.24719101123596
                                    ],
                                    "name": "Office of the Inspector General",
                                    "id": "leaf-26",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        86000,
                                        82000,
                                        4.87804878048781
                                    ],
                                    "name": "Economic Research Service",
                                    "id": "leaf-11",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        82000,
                                        80000,
                                        2.49999999999999
                                    ],
                                    "name": "Risk Management Agency",
                                    "id": "leaf-28",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        53000,
                                        18000,
                                        194.444444444444
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-27",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        46000,
                                        44000,
                                        4.54545454545454
                                    ],
                                    "name": "Office of the General Counsel",
                                    "id": "leaf-25",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        44000,
                                        42000,
                                        4.76190476190477
                                    ],
                                    "name": "Grain Inspection, Packers and Stockyards Administration",
                                    "id": "leaf-18",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        22000,
                                        22000,
                                        0
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-37",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        18000,
                                        14000,
                                        28.5714285714286
                                    ],
                                    "name": "Agricultural Research Service",
                                    "id": "leaf-34",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        15000,
                                        15000,
                                        0
                                    ],
                                    "name": "National Appeals Division",
                                    "id": "leaf-20",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        15000,
                                        13000,
                                        15.3846153846154
                                    ],
                                    "name": "Office of Chief Economist",
                                    "id": "leaf-23",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000,
                                        10000,
                                        0
                                    ],
                                    "name": "Office of Communications",
                                    "id": "leaf-24",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        10000,
                                        -10
                                    ],
                                    "name": "Food Safety and Inspection Service",
                                    "id": "leaf-40",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-46",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Office of Chief Economist",
                                    "id": "leaf-45",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                132612000,
                                null,
                                null
                            ],
                            "name": "Labor",
                            "id": "branch-12",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        117659000,
                                        240093000,
                                        -50.9944063342122
                                    ],
                                    "name": "Employment and Training Administration",
                                    "id": "leaf-218",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        10000000,
                                        10917000,
                                        -8.39974351928186
                                    ],
                                    "name": "Employment and Training Administration",
                                    "id": "leaf-209",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2078000,
                                        2217000,
                                        -6.26973387460532
                                    ],
                                    "name": "Office of Workers' Compensation Programs",
                                    "id": "leaf-220",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        583000,
                                        559000,
                                        4.29338103756709
                                    ],
                                    "name": "Occupational Safety and Health Administration",
                                    "id": "leaf-212",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        578000,
                                        530000,
                                        9.0566037735849
                                    ],
                                    "name": "Bureau of Labor Statistics",
                                    "id": "leaf-205",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        567000,
                                        530000,
                                        6.98113207547171
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-207",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        384000,
                                        364000,
                                        5.4945054945055
                                    ],
                                    "name": "Mine Safety and Health Administration",
                                    "id": "leaf-211",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        241000,
                                        364000,
                                        null
                                    ],
                                    "name": "Wage and Hour Division",
                                    "id": "leaf-216",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        198000,
                                        160000,
                                        23.75
                                    ],
                                    "name": "Employee Benefits Security Administration",
                                    "id": "leaf-208",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        123000,
                                        160000,
                                        null
                                    ],
                                    "name": "Office of Workers' Compensation Programs",
                                    "id": "leaf-215",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        109000,
                                        160000,
                                        null
                                    ],
                                    "name": "Office of Federal Contract Compliance Programs",
                                    "id": "leaf-213",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        51000,
                                        160000,
                                        null
                                    ],
                                    "name": "Wage and Hour Division",
                                    "id": "leaf-221",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        41000,
                                        160000,
                                        null
                                    ],
                                    "name": "Office of Labor Management Standards",
                                    "id": "leaf-214",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                132359000,
                                null,
                                null
                            ],
                            "name": "Veterans Affairs",
                            "id": "branch-17",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        70477000,
                                        71940000,
                                        -2.03363914373089
                                    ],
                                    "name": "Benefits Programs",
                                    "id": "leaf-310",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        54438000,
                                        47966000,
                                        13.4928907976483
                                    ],
                                    "name": "Veterans Health Administration",
                                    "id": "leaf-309",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7259000,
                                        7718000,
                                        -5.94713656387665
                                    ],
                                    "name": "Departmental Administration",
                                    "id": "leaf-308",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        156000,
                                        233000,
                                        -33.0472103004292
                                    ],
                                    "name": "Benefits Programs",
                                    "id": "leaf-306",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        29000,
                                        27000,
                                        7.40740740740742
                                    ],
                                    "name": "Veterans Health Administration",
                                    "id": "leaf-312",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                129458000,
                                null,
                                null
                            ],
                            "name": "Transportation",
                            "id": "branch-16",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        70546000,
                                        67815000,
                                        4.02713264027132
                                    ],
                                    "name": "Federal Highway Administration",
                                    "id": "leaf-297",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        22201000,
                                        9772000,
                                        127.189930413426
                                    ],
                                    "name": "Federal Transit Administration",
                                    "id": "leaf-300",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        12883000,
                                        12470000,
                                        3.31194867682438
                                    ],
                                    "name": "Federal Aviation Administration",
                                    "id": "leaf-282",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8046000,
                                        15000,
                                        53540
                                    ],
                                    "name": "Federal Railroad Administration",
                                    "id": "leaf-299",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5774000,
                                        3121000,
                                        85.0048061518744
                                    ],
                                    "name": "Federal Aviation Administration",
                                    "id": "leaf-296",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5000000,
                                        3121000,
                                        null
                                    ],
                                    "name": "National Infrastructure Bank",
                                    "id": "leaf-303",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2050000,
                                        50000,
                                        4000
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-304",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        860000,
                                        696000,
                                        23.5632183908046
                                    ],
                                    "name": "National Highway Traffic Safety Administration",
                                    "id": "leaf-302",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        606000,
                                        536000,
                                        13.0597014925373
                                    ],
                                    "name": "Federal Motor Carrier Safety Administration",
                                    "id": "leaf-298",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        303000,
                                        413000,
                                        -26.634382566586
                                    ],
                                    "name": "Maritime Administration",
                                    "id": "leaf-287",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        290000,
                                        890000,
                                        -67.4157303370787
                                    ],
                                    "name": "Office of the Secretary",
                                    "id": "leaf-290",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        192000,
                                        164000,
                                        17.0731707317073
                                    ],
                                    "name": "Pipeline and Hazardous Materials Safety Administration",
                                    "id": "leaf-291",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        183000,
                                        4360000,
                                        -95.802752293578
                                    ],
                                    "name": "Federal Railroad Administration",
                                    "id": "leaf-285",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        175000,
                                        226000,
                                        -22.5663716814159
                                    ],
                                    "name": "Maritime Administration",
                                    "id": "leaf-301",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        150000,
                                        2389000,
                                        -93.7212222687317
                                    ],
                                    "name": "Federal Transit Administration",
                                    "id": "leaf-286",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        89000,
                                        77000,
                                        15.5844155844156
                                    ],
                                    "name": "Office of Inspector General",
                                    "id": "leaf-289",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        34000,
                                        32000,
                                        6.25
                                    ],
                                    "name": "Saint Lawrence Seaway Development Corporation",
                                    "id": "leaf-293",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        30000,
                                        28000,
                                        7.14285714285714
                                    ],
                                    "name": "Surface Transportation Board",
                                    "id": "leaf-294",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        28000,
                                        23000,
                                        21.7391304347826
                                    ],
                                    "name": "Pipeline and Hazardous Materials Safety Administration",
                                    "id": "leaf-305",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        18000,
                                        13000,
                                        38.4615384615385
                                    ],
                                    "name": "Research and Innovative Technology Administration",
                                    "id": "leaf-292",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                93790000,
                                null,
                                null
                            ],
                            "name": "Education",
                            "id": "branch-6",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        31433000,
                                        20085000,
                                        56.4998755290018
                                    ],
                                    "name": "Office of Federal Student Aid",
                                    "id": "leaf-95",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        20161000,
                                        22495000,
                                        -10.3756390308958
                                    ],
                                    "name": "Office of Elementary and Secondary Education",
                                    "id": "leaf-93",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        12805000,
                                        14290000,
                                        -10.3918824352694
                                    ],
                                    "name": "Office of Federal Student Aid",
                                    "id": "leaf-103",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        12647000,
                                        13225000,
                                        -4.37051039697542
                                    ],
                                    "name": "Office of Special Education and Rehabilitative Services",
                                    "id": "leaf-99",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4995000,
                                        1378000,
                                        262.481857764877
                                    ],
                                    "name": "Office of Innovation and Improvement",
                                    "id": "leaf-96",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3122000,
                                        3085000,
                                        1.19935170178282
                                    ],
                                    "name": "Office of Special Education and Rehabilitative Services",
                                    "id": "leaf-106",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2533000,
                                        2512000,
                                        0.835987261146487
                                    ],
                                    "name": "Office of Postsecondary Education",
                                    "id": "leaf-97",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1781000,
                                        393000,
                                        353.180661577608
                                    ],
                                    "name": "Office of Safe and Drug-Free Schools",
                                    "id": "leaf-98",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1683000,
                                        2016000,
                                        -16.5178571428571
                                    ],
                                    "name": "Office of Vocational and Adult Education",
                                    "id": "leaf-100",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        760000,
                                        659000,
                                        15.3262518968134
                                    ],
                                    "name": "Institute of Education Sciences",
                                    "id": "leaf-92",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        750000,
                                        750000,
                                        0
                                    ],
                                    "name": "Office of English Language Acquisition",
                                    "id": "leaf-94",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        654000,
                                        619000,
                                        5.65428109854604
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-91",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        426000,
                                        462000,
                                        -7.79220779220779
                                    ],
                                    "name": "Office of Postsecondary Education",
                                    "id": "leaf-105",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        40000,
                                        462000,
                                        null
                                    ],
                                    "name": "Office of Innovation and Improvement",
                                    "id": "leaf-104",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                83502000,
                                null,
                                null
                            ],
                            "name": "Office of Personnel Management",
                            "id": "branch-28",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        83239000,
                                        73691000,
                                        12.9568061228644
                                    ],
                                    "name": "Office of Personnel Management",
                                    "id": "leaf-403",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        263000,
                                        243000,
                                        8.23045267489713
                                    ],
                                    "name": "Office of Personnel Management",
                                    "id": "leaf-402",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                66476000,
                                null,
                                null
                            ],
                            "name": "Other",
                            "id": "branch-29",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        18724000,
                                        18725000,
                                        -0.00534045393858484
                                    ],
                                    "name": "National Aeronautics and Space Administration",
                                    "id": "leaf-443",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000000,
                                        18725000,
                                        null
                                    ],
                                    "name": "Allowances",
                                    "id": "leaf-476",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        8973000,
                                        10257000,
                                        -12.5182801988886
                                    ],
                                    "name": "Environmental Protection Agency",
                                    "id": "leaf-424",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7768000,
                                        6873000,
                                        13.0219700276444
                                    ],
                                    "name": "National Science Foundation",
                                    "id": "leaf-452",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5947000,
                                        4449000,
                                        33.6704877500562
                                    ],
                                    "name": "Postal Service",
                                    "id": "leaf-499",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1900000,
                                        4449000,
                                        null
                                    ],
                                    "name": "National Credit Union Administration",
                                    "id": "leaf-495",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1259000,
                                        1150000,
                                        9.47826086956523
                                    ],
                                    "name": "Corporation for National and Community Service",
                                    "id": "leaf-417",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1125000,
                                        672000,
                                        67.4107142857143
                                    ],
                                    "name": "Tennessee Valley Authority",
                                    "id": "leaf-505",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1048000,
                                        980000,
                                        6.93877551020408
                                    ],
                                    "name": "Smithsonian Institution",
                                    "id": "leaf-469",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        984000,
                                        1786000,
                                        -44.9048152295633
                                    ],
                                    "name": "Small Business Administration",
                                    "id": "leaf-468",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        767000,
                                        750000,
                                        2.26666666666666
                                    ],
                                    "name": "Broadcasting Board of Governors",
                                    "id": "leaf-409",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        592000,
                                        705000,
                                        -16.0283687943262
                                    ],
                                    "name": "Intelligence Community Management Account",
                                    "id": "leaf-437",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        514000,
                                        291000,
                                        76.6323024054983
                                    ],
                                    "name": "Central Intelligence Agency",
                                    "id": "leaf-480",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        451000,
                                        506000,
                                        -10.8695652173913
                                    ],
                                    "name": "Corporation for Public Broadcasting",
                                    "id": "leaf-418",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        450000,
                                        420000,
                                        7.14285714285714
                                    ],
                                    "name": "Legal Services Corporation",
                                    "id": "leaf-439",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        386000,
                                        367000,
                                        5.17711171662125
                                    ],
                                    "name": "Equal Employment Opportunity Commission",
                                    "id": "leaf-425",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        347000,
                                        370000,
                                        -6.21621621621622
                                    ],
                                    "name": "Postal Service",
                                    "id": "leaf-464",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        333000,
                                        375000,
                                        -11.2
                                    ],
                                    "name": "Federal Drug Control Programs",
                                    "id": "leaf-427",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        329000,
                                        18000,
                                        1727.77777777778
                                    ],
                                    "name": "Bureau of Consumer Financial Protection",
                                    "id": "leaf-479",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        288000,
                                        417000,
                                        -30.9352517985611
                                    ],
                                    "name": "Securities Investor Protection Corporation",
                                    "id": "leaf-501",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        288000,
                                        283000,
                                        1.76678445229681
                                    ],
                                    "name": "National Labor Relations Board",
                                    "id": "leaf-449",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        258000,
                                        249000,
                                        3.6144578313253
                                    ],
                                    "name": "Court Services and Offender Supervision Agency for the District",
                                    "id": "leaf-419",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        248000,
                                        90000,
                                        175.555555555556
                                    ],
                                    "name": "National Science Foundation",
                                    "id": "leaf-496",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        243000,
                                        282000,
                                        -13.8297872340426
                                    ],
                                    "name": "Institute of Museum and Library Services",
                                    "id": "leaf-436",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        227000,
                                        143000,
                                        58.7412587412587
                                    ],
                                    "name": "Federal Housing Finance Agency",
                                    "id": "leaf-486",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        216000,
                                        216000,
                                        0
                                    ],
                                    "name": "Affordable Housing Program",
                                    "id": "leaf-475",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        215000,
                                        233000,
                                        -7.72532188841202
                                    ],
                                    "name": "Neighborhood Reinvestment Corporation",
                                    "id": "leaf-454",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        213000,
                                        164000,
                                        29.8780487804878
                                    ],
                                    "name": "Public Company Accounting Oversight Board",
                                    "id": "leaf-500",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        197000,
                                        205000,
                                        -3.90243902439025
                                    ],
                                    "name": "Federal Trade Commission",
                                    "id": "leaf-433",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        191000,
                                        169000,
                                        13.0177514792899
                                    ],
                                    "name": "Commodity Futures Trading Commission",
                                    "id": "leaf-415",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        150000,
                                        10000,
                                        1400
                                    ],
                                    "name": "Patient-Centered Outcomes Research Trust Fund",
                                    "id": "leaf-498",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        146000,
                                        168000,
                                        -13.0952380952381
                                    ],
                                    "name": "National Endowment for the Humanities",
                                    "id": "leaf-448",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        146000,
                                        168000,
                                        -13.0952380952381
                                    ],
                                    "name": "National Endowment for the Arts",
                                    "id": "leaf-447",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        128000,
                                        139000,
                                        -7.9136690647482
                                    ],
                                    "name": "Nuclear Regulatory Commission",
                                    "id": "leaf-456",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        122000,
                                        118000,
                                        3.38983050847457
                                    ],
                                    "name": "Consumer Product Safety Commission",
                                    "id": "leaf-416",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        102000,
                                        98000,
                                        4.08163265306123
                                    ],
                                    "name": "National Transportation Safety Board",
                                    "id": "leaf-453",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        100000,
                                        100000,
                                        0
                                    ],
                                    "name": "Electric Reliability Organization",
                                    "id": "leaf-483",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        100000,
                                        100000,
                                        null
                                    ],
                                    "name": "Corporation for Travel Promotion",
                                    "id": "leaf-482",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        88000,
                                        100000,
                                        null
                                    ],
                                    "name": "Civilian Property Realignment Board",
                                    "id": "leaf-412",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        87000,
                                        81000,
                                        7.40740740740742
                                    ],
                                    "name": "International Trade Commission",
                                    "id": "leaf-438",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        76000,
                                        76000,
                                        0
                                    ],
                                    "name": "Appalachian Regional Commission",
                                    "id": "leaf-408",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        67000,
                                        67000,
                                        0
                                    ],
                                    "name": "Federal Election Commission",
                                    "id": "leaf-428",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        56000,
                                        27000,
                                        107.407407407407
                                    ],
                                    "name": "United States Court of Appeals for Veterans Claims",
                                    "id": "leaf-471",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        53000,
                                        49000,
                                        8.16326530612246
                                    ],
                                    "name": "United States Holocaust Memorial Museum",
                                    "id": "leaf-472",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        48000,
                                        47000,
                                        2.12765957446808
                                    ],
                                    "name": "Federal Mediation and Conciliation Service",
                                    "id": "leaf-431",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        43000,
                                        49000,
                                        -12.2448979591837
                                    ],
                                    "name": "United States Institute of Peace",
                                    "id": "leaf-473",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        42000,
                                        40000,
                                        5
                                    ],
                                    "name": "Merit Systems Protection Board",
                                    "id": "leaf-441",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        41000,
                                        34000,
                                        20.5882352941176
                                    ],
                                    "name": "Standard Setting Body",
                                    "id": "leaf-503",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        33000,
                                        42000,
                                        -21.4285714285714
                                    ],
                                    "name": "United Mine Workers of America Benefit Funds",
                                    "id": "leaf-507",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        29000,
                                        26000,
                                        11.5384615384615
                                    ],
                                    "name": "Defense Nuclear Facilities Safety Board",
                                    "id": "leaf-420",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        26000,
                                        24000,
                                        8.33333333333333
                                    ],
                                    "name": "Federal Maritime Commission",
                                    "id": "leaf-430",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        26000,
                                        25000,
                                        4
                                    ],
                                    "name": "Federal Labor Relations Authority",
                                    "id": "leaf-429",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        22000,
                                        19000,
                                        15.7894736842105
                                    ],
                                    "name": "National Railroad Passenger Corporation Office of Inspector Gene",
                                    "id": "leaf-451",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        22000,
                                        14000,
                                        57.1428571428571
                                    ],
                                    "name": "Federal Mine Safety and Health Review Commission",
                                    "id": "leaf-432",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        20000,
                                        14000,
                                        42.8571428571429
                                    ],
                                    "name": "Corporation for National and Community Service",
                                    "id": "leaf-481",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        19000,
                                        18000,
                                        5.55555555555556
                                    ],
                                    "name": "Office of Special Counsel",
                                    "id": "leaf-461",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        16000,
                                        19000,
                                        -15.7894736842105
                                    ],
                                    "name": "Denali Commission",
                                    "id": "leaf-422",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        14000,
                                        13000,
                                        7.69230769230769
                                    ],
                                    "name": "National Mediation Board",
                                    "id": "leaf-450",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        14000,
                                        14000,
                                        0
                                    ],
                                    "name": "Office of Government Ethics",
                                    "id": "leaf-459",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        13000,
                                        0
                                    ],
                                    "name": "Delta Regional Authority",
                                    "id": "leaf-421",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        12000,
                                        8.33333333333333
                                    ],
                                    "name": "Occupational Safety and Health Review Commission",
                                    "id": "leaf-458",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        12000,
                                        23000,
                                        -47.8260869565217
                                    ],
                                    "name": "Presidio Trust",
                                    "id": "leaf-465",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        11000,
                                        89000,
                                        -87.6404494382023
                                    ],
                                    "name": "Election Assistance Commission",
                                    "id": "leaf-423",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        11000,
                                        11000,
                                        0
                                    ],
                                    "name": "Chemical Safety and Hazard Investigation Board",
                                    "id": "leaf-410",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000,
                                        8000,
                                        25
                                    ],
                                    "name": "Office of Navajo and Hopi Indian Relocation",
                                    "id": "leaf-460",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        8000,
                                        12.5
                                    ],
                                    "name": "Institute of American Indian and Alaska Native Culture and Arts",
                                    "id": "leaf-435",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        9000,
                                        0
                                    ],
                                    "name": "Commission on Civil Rights",
                                    "id": "leaf-414",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8000,
                                        9000,
                                        -11.1111111111111
                                    ],
                                    "name": "National Capital Planning Commission",
                                    "id": "leaf-444",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6000,
                                        6000,
                                        0
                                    ],
                                    "name": "Advisory Council on Historic Preservation",
                                    "id": "leaf-406",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6000,
                                        7000,
                                        -14.2857142857143
                                    ],
                                    "name": "Morris K. Udall and Stewart L. Udall Foundation",
                                    "id": "leaf-442",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5000,
                                        5000,
                                        0
                                    ],
                                    "name": "State Justice Institute",
                                    "id": "leaf-470",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4000,
                                        2000,
                                        100
                                    ],
                                    "name": "United States Interagency Council on Homelessness",
                                    "id": "leaf-474",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4000,
                                        4000,
                                        0
                                    ],
                                    "name": "Barry Goldwater Scholarship and Excellence in Education Foundati",
                                    "id": "leaf-477",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        4000,
                                        4000,
                                        0
                                    ],
                                    "name": "Office of the Fed Coordinator for Alaska Natural Gas Transportat",
                                    "id": "leaf-462",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        2000,
                                        50
                                    ],
                                    "name": "Japan-United States Friendship Commission",
                                    "id": "leaf-491",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3000,
                                        1000,
                                        200
                                    ],
                                    "name": "Harry S Truman Scholarship Foundation",
                                    "id": "leaf-489",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        3000,
                                        3000,
                                        0
                                    ],
                                    "name": "National Council on Disability",
                                    "id": "leaf-445",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        3000,
                                        0
                                    ],
                                    "name": "Marine Mammal Commission",
                                    "id": "leaf-440",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        4000,
                                        -25
                                    ],
                                    "name": "Nuclear Waste Technical Review Board",
                                    "id": "leaf-457",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        2000,
                                        50
                                    ],
                                    "name": "Administrative Conference of the United States",
                                    "id": "leaf-405",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "Northern Border Regional Commission",
                                    "id": "leaf-455",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "James Madison Memorial Fellowship Foundation",
                                    "id": "leaf-490",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2000,
                                        1000,
                                        100
                                    ],
                                    "name": "National Credit Union Administration",
                                    "id": "leaf-446",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        1000,
                                        null
                                    ],
                                    "name": "Privacy and Civil Liberties Oversight Board",
                                    "id": "leaf-466",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        12000,
                                        -83.3333333333333
                                    ],
                                    "name": "Commission of Fine Arts",
                                    "id": "leaf-413",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        1000,
                                        100
                                    ],
                                    "name": "United States Court of Appeals for Veterans Claims",
                                    "id": "leaf-508",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        null
                                    ],
                                    "name": "Morris K. Udall and Stewart L. Udall Foundation",
                                    "id": "leaf-493",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Christopher Columbus Fellowship Foundation",
                                    "id": "leaf-411",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        null
                                    ],
                                    "name": "Public Company Accounting Oversight Board",
                                    "id": "leaf-467",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Other Commissions and Boards",
                                    "id": "leaf-463",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                58663000,
                                null,
                                null
                            ],
                            "name": "Other Defense Civil Programs",
                            "id": "branch-30",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        48455000,
                                        51097000,
                                        -5.17055795839286
                                    ],
                                    "name": "Military Retirement",
                                    "id": "leaf-520",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        9917000,
                                        8623000,
                                        15.0063782906181
                                    ],
                                    "name": "Retiree Health Care",
                                    "id": "leaf-521",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        77000,
                                        83000,
                                        -7.2289156626506
                                    ],
                                    "name": "American Battle Monuments Commission",
                                    "id": "leaf-513",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        76000,
                                        83000,
                                        null
                                    ],
                                    "name": "Educational Benefits",
                                    "id": "leaf-519",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        68000,
                                        134000,
                                        -49.2537313432836
                                    ],
                                    "name": "Armed Forces Retirement Home",
                                    "id": "leaf-514",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        46000,
                                        40000,
                                        15
                                    ],
                                    "name": "Cemeterial Expenses",
                                    "id": "leaf-515",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        24000,
                                        24000,
                                        0
                                    ],
                                    "name": "Selective Service System",
                                    "id": "leaf-516",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                52092000,
                                null,
                                null
                            ],
                            "name": "Housing and Urban Development",
                            "id": "branch-10",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        36186000,
                                        34796000,
                                        3.99471203586619
                                    ],
                                    "name": "Public and Indian Housing Programs",
                                    "id": "leaf-178",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8211000,
                                        8601000,
                                        -4.53435647017789
                                    ],
                                    "name": "Community Planning and Development",
                                    "id": "leaf-169",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4484000,
                                        3025000,
                                        48.2314049586777
                                    ],
                                    "name": "Housing Programs",
                                    "id": "leaf-182",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1791000,
                                        2000000,
                                        -10.45
                                    ],
                                    "name": "Management and Administration",
                                    "id": "leaf-174",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1001000,
                                        4000,
                                        24925
                                    ],
                                    "name": "Community Planning and Development",
                                    "id": "leaf-179",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        150000,
                                        4000,
                                        null
                                    ],
                                    "name": "Office of Sustainable Housing and Communities",
                                    "id": "leaf-176",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        140000,
                                        139000,
                                        0.71942446043165
                                    ],
                                    "name": "Office of Lead Hazard Control and Healthy Homes",
                                    "id": "leaf-175",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        72000,
                                        71000,
                                        1.40845070422535
                                    ],
                                    "name": "Fair Housing and Equal Opportunity",
                                    "id": "leaf-171",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        57000,
                                        48000,
                                        18.75
                                    ],
                                    "name": "Policy Development and Research",
                                    "id": "leaf-177",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                50045000,
                                null,
                                null
                            ],
                            "name": "Homeland Security",
                            "id": "branch-9",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        10493000,
                                        10323000,
                                        1.64680809842099
                                    ],
                                    "name": "Customs and Border Protection",
                                    "id": "leaf-147",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        8935000,
                                        8894000,
                                        0.460984933663133
                                    ],
                                    "name": "United States Coast Guard",
                                    "id": "leaf-158",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6790000,
                                        12211000,
                                        -44.3943984931619
                                    ],
                                    "name": "Federal Emergency Management Agency",
                                    "id": "leaf-151",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5495000,
                                        5520000,
                                        -0.452898550724634
                                    ],
                                    "name": "Immigration and Customs Enforcement",
                                    "id": "leaf-153",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5114000,
                                        5515000,
                                        -7.27107887579329
                                    ],
                                    "name": "Transportation Security Administration",
                                    "id": "leaf-157",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2534000,
                                        2410000,
                                        5.14522821576764
                                    ],
                                    "name": "Citizenship and Immigration Services",
                                    "id": "leaf-160",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1699000,
                                        1490000,
                                        14.0268456375839
                                    ],
                                    "name": "United States Secret Service",
                                    "id": "leaf-159",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1662000,
                                        2233000,
                                        -25.5709807433945
                                    ],
                                    "name": "United States Coast Guard",
                                    "id": "leaf-166",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1471000,
                                        1295000,
                                        13.5907335907336
                                    ],
                                    "name": "Customs and Border Protection",
                                    "id": "leaf-161",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1428000,
                                        1295000,
                                        null
                                    ],
                                    "name": "National Protection and Programs Directorate",
                                    "id": "leaf-154",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1302000,
                                        1133000,
                                        14.9161518093557
                                    ],
                                    "name": "Departmental Management and Operations",
                                    "id": "leaf-149",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1177000,
                                        999000,
                                        17.8178178178178
                                    ],
                                    "name": "Science and Technology",
                                    "id": "leaf-156",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        365000,
                                        246000,
                                        48.3739837398374
                                    ],
                                    "name": "Citizenship and Immigration Services",
                                    "id": "leaf-146",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        331000,
                                        376000,
                                        -11.968085106383
                                    ],
                                    "name": "Domestic Nuclear Detection Office",
                                    "id": "leaf-150",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        311000,
                                        275000,
                                        13.0909090909091
                                    ],
                                    "name": "Immigration and Customs Enforcement",
                                    "id": "leaf-164",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        276000,
                                        290000,
                                        -4.82758620689655
                                    ],
                                    "name": "Federal Law Enforcement Training Center",
                                    "id": "leaf-152",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        250000,
                                        250000,
                                        0
                                    ],
                                    "name": "Transportation Security Administration",
                                    "id": "leaf-165",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        245000,
                                        244000,
                                        0.409836065573765
                                    ],
                                    "name": "United States Secret Service",
                                    "id": "leaf-167",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        144000,
                                        135000,
                                        6.66666666666667
                                    ],
                                    "name": "Office of the Inspector General",
                                    "id": "leaf-155",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        23000,
                                        135000,
                                        null
                                    ],
                                    "name": "Federal Emergency Management Agency",
                                    "id": "leaf-163",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                41915000,
                                null,
                                null
                            ],
                            "name": "International Assistance Programs",
                            "id": "branch-24",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        15965000,
                                        14252000,
                                        12.0193657030592
                                    ],
                                    "name": "International Security Assistance",
                                    "id": "leaf-353",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        14257000,
                                        3257000,
                                        337.734111145226
                                    ],
                                    "name": "Military Sales Program",
                                    "id": "leaf-362",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        6246000,
                                        6127000,
                                        1.94222294760895
                                    ],
                                    "name": "Agency for International Development",
                                    "id": "leaf-350",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3713000,
                                        3115000,
                                        19.1974317817014
                                    ],
                                    "name": "Multilateral Assistance",
                                    "id": "leaf-355",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1125000,
                                        1055000,
                                        6.6350710900474
                                    ],
                                    "name": "Millennium Challenge Corporation",
                                    "id": "leaf-354",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        440000,
                                        400000,
                                        10
                                    ],
                                    "name": "Peace Corps",
                                    "id": "leaf-357",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        70000,
                                        20000,
                                        250
                                    ],
                                    "name": "Overseas Private Investment Corporation",
                                    "id": "leaf-363",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        56000,
                                        55000,
                                        1.81818181818181
                                    ],
                                    "name": "Trade and Development Agency",
                                    "id": "leaf-358",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        24000,
                                        30000,
                                        -20
                                    ],
                                    "name": "African Development Foundation",
                                    "id": "leaf-349",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        19000,
                                        23000,
                                        -17.3913043478261
                                    ],
                                    "name": "Inter-American Foundation",
                                    "id": "leaf-351",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                35403000,
                                null,
                                null
                            ],
                            "name": "Justice",
                            "id": "branch-11",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        8076000,
                                        7874000,
                                        2.56540513081027
                                    ],
                                    "name": "Federal Bureau of Investigation",
                                    "id": "leaf-188",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7808000,
                                        774000,
                                        908.785529715762
                                    ],
                                    "name": "Office of Justice Programs",
                                    "id": "leaf-202",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        6791000,
                                        6205000,
                                        9.44399677679291
                                    ],
                                    "name": "Federal Prison System",
                                    "id": "leaf-189",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3909000,
                                        4358000,
                                        -10.3028912345112
                                    ],
                                    "name": "Legal Activities and U.S. Marshals",
                                    "id": "leaf-192",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2323000,
                                        1646000,
                                        41.1300121506683
                                    ],
                                    "name": "Legal Activities and U.S. Marshals",
                                    "id": "leaf-201",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2293000,
                                        2312000,
                                        -0.821799307958482
                                    ],
                                    "name": "General Administration",
                                    "id": "leaf-190",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2012000,
                                        2084000,
                                        -3.45489443378119
                                    ],
                                    "name": "Drug Enforcement Administration",
                                    "id": "leaf-187",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1147000,
                                        1158000,
                                        -0.949913644214162
                                    ],
                                    "name": "Bureau of Alcohol, Tobacco, Firearms, and Explosives",
                                    "id": "leaf-185",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        541000,
                                        548000,
                                        -1.27737226277372
                                    ],
                                    "name": "Interagency Law Enforcement",
                                    "id": "leaf-191",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        282000,
                                        272000,
                                        3.6764705882353
                                    ],
                                    "name": "Drug Enforcement Administration",
                                    "id": "leaf-198",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        120000,
                                        120000,
                                        0
                                    ],
                                    "name": "Radiation Exposure Compensation",
                                    "id": "leaf-203",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        88000,
                                        88000,
                                        0
                                    ],
                                    "name": "National Security Division",
                                    "id": "leaf-193",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        13000,
                                        0
                                    ],
                                    "name": "United States Parole Commission",
                                    "id": "leaf-195",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                32746000,
                                null,
                                null
                            ],
                            "name": "State",
                            "id": "branch-13",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        14747000,
                                        12367000,
                                        19.2447642920676
                                    ],
                                    "name": "Administration of Foreign Affairs",
                                    "id": "leaf-223",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13080000,
                                        12954000,
                                        0.972672533580354
                                    ],
                                    "name": "Other",
                                    "id": "leaf-227",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3539000,
                                        3905000,
                                        -9.37259923175416
                                    ],
                                    "name": "International Organizations and Conferences",
                                    "id": "leaf-226",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1257000,
                                        1266000,
                                        -0.710900473933651
                                    ],
                                    "name": "Administration of Foreign Affairs",
                                    "id": "leaf-228",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        122000,
                                        143000,
                                        -14.6853146853147
                                    ],
                                    "name": "International Commissions",
                                    "id": "leaf-225",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        4000,
                                        -75
                                    ],
                                    "name": "Other",
                                    "id": "leaf-230",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                30779000,
                                null,
                                null
                            ],
                            "name": "Energy",
                            "id": "branch-7",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        11836000,
                                        8610000,
                                        37.4680603948897
                                    ],
                                    "name": "Energy Programs",
                                    "id": "leaf-110",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        11712000,
                                        9881000,
                                        18.5305131059609
                                    ],
                                    "name": "National Nuclear Security Administration",
                                    "id": "leaf-112",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6267000,
                                        6585000,
                                        -4.82915717539863
                                    ],
                                    "name": "Environmental and Other Defense Activities",
                                    "id": "leaf-111",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        604000,
                                        785000,
                                        -23.0573248407643
                                    ],
                                    "name": "Power Marketing Administration",
                                    "id": "leaf-116",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        171000,
                                        256000,
                                        -33.203125
                                    ],
                                    "name": "Departmental Administration",
                                    "id": "leaf-109",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        103000,
                                        62000,
                                        66.1290322580645
                                    ],
                                    "name": "Energy Programs",
                                    "id": "leaf-115",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        86000,
                                        150000,
                                        -42.6666666666667
                                    ],
                                    "name": "Power Marketing Administration",
                                    "id": "leaf-113",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                17863000,
                                null,
                                null
                            ],
                            "name": "Interior",
                            "id": "branch-14",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        2892000,
                                        2770000,
                                        4.40433212996389
                                    ],
                                    "name": "National Park Service",
                                    "id": "leaf-241",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2501000,
                                        2612000,
                                        -4.24961715160797
                                    ],
                                    "name": "Bureau of Indian Affairs and Bureau of Indian Education",
                                    "id": "leaf-232",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2117000,
                                        1775000,
                                        19.2676056338028
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-254",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1695000,
                                        1648000,
                                        2.85194174757282
                                    ],
                                    "name": "United States Fish and Wildlife Service",
                                    "id": "leaf-246",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1132000,
                                        1156000,
                                        -2.07612456747405
                                    ],
                                    "name": "Bureau of Land Management",
                                    "id": "leaf-233",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1118000,
                                        1112000,
                                        0.539568345323738
                                    ],
                                    "name": "United States Geological Survey",
                                    "id": "leaf-247",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1018000,
                                        1098000,
                                        -7.28597449908925
                                    ],
                                    "name": "Bureau of Reclamation",
                                    "id": "leaf-235",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        996000,
                                        1362000,
                                        -26.8722466960352
                                    ],
                                    "name": "United States Fish and Wildlife Service",
                                    "id": "leaf-260",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        911000,
                                        960000,
                                        -5.10416666666667
                                    ],
                                    "name": "Department-Wide Programs",
                                    "id": "leaf-238",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        538000,
                                        542000,
                                        -0.738007380073802
                                    ],
                                    "name": "Office of Surface Mining Reclamation and Enforcement",
                                    "id": "leaf-258",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        437000,
                                        626000,
                                        -30.1916932907348
                                    ],
                                    "name": "Department-Wide Programs",
                                    "id": "leaf-253",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        405000,
                                        429000,
                                        -5.59440559440559
                                    ],
                                    "name": "Insular Affairs",
                                    "id": "leaf-255",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        395000,
                                        393000,
                                        0.508905852417296
                                    ],
                                    "name": "National Park Service",
                                    "id": "leaf-257",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        358000,
                                        482000,
                                        -25.7261410788382
                                    ],
                                    "name": "Office of the Special Trustee for American Indians",
                                    "id": "leaf-259",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        242000,
                                        138000,
                                        75.3623188405797
                                    ],
                                    "name": "Departmental Offices",
                                    "id": "leaf-239",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        194000,
                                        104000,
                                        86.5384615384615
                                    ],
                                    "name": "Bureau of Reclamation",
                                    "id": "leaf-251",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        152000,
                                        177000,
                                        -14.1242937853107
                                    ],
                                    "name": "Office of the Special Trustee for American Indians",
                                    "id": "leaf-245",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        146000,
                                        163000,
                                        -10.4294478527607
                                    ],
                                    "name": "Office of Surface Mining Reclamation and Enforcement",
                                    "id": "leaf-243",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        133000,
                                        208000,
                                        -36.0576923076923
                                    ],
                                    "name": "Bureau of Land Management",
                                    "id": "leaf-249",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        132000,
                                        191000,
                                        -30.8900523560209
                                    ],
                                    "name": "Bureau of Ocean Energy Management, Regulation and Enforcement",
                                    "id": "leaf-234",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        106000,
                                        121000,
                                        -12.396694214876
                                    ],
                                    "name": "Bureau of Indian Affairs and Bureau of Indian Education",
                                    "id": "leaf-248",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        69000,
                                        60000,
                                        15
                                    ],
                                    "name": "Insular Affairs",
                                    "id": "leaf-240",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        68000,
                                        65000,
                                        4.61538461538462
                                    ],
                                    "name": "Office of the Solicitor",
                                    "id": "leaf-244",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        49000,
                                        49000,
                                        0
                                    ],
                                    "name": "Office of Inspector General",
                                    "id": "leaf-242",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        33000,
                                        52000,
                                        -36.5384615384615
                                    ],
                                    "name": "Central Utah Project",
                                    "id": "leaf-236",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        17000,
                                        13000,
                                        30.7692307692308
                                    ],
                                    "name": "National Indian Gaming Commission",
                                    "id": "leaf-256",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        8000,
                                        21000,
                                        -61.9047619047619
                                    ],
                                    "name": "Bureau of Ocean Energy Management, Regulation and Enforcement",
                                    "id": "leaf-250",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        2000,
                                        -50
                                    ],
                                    "name": "United States Geological Survey",
                                    "id": "leaf-261",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                11570000,
                                null,
                                null
                            ],
                            "name": "Federal Communications Commission",
                            "id": "branch-20",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        11570000,
                                        8918000,
                                        29.7376093294461
                                    ],
                                    "name": "Federal Communications Commission",
                                    "id": "leaf-334",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                10449000,
                                null,
                                null
                            ],
                            "name": "Commerce",
                            "id": "branch-4",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        5510000,
                                        4878000,
                                        12.9561295612956
                                    ],
                                    "name": "National Oceanic and Atmospheric Administration",
                                    "id": "leaf-61",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1400000,
                                        197000,
                                        610.659898477157
                                    ],
                                    "name": "National Telecommunications and Information Administration",
                                    "id": "leaf-71",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1025000,
                                        7096000,
                                        -85.5552423900789
                                    ],
                                    "name": "Bureau of the Census",
                                    "id": "leaf-53",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1004000,
                                        863000,
                                        16.3383545770568
                                    ],
                                    "name": "National Institute of Standards and Technology",
                                    "id": "leaf-60",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        517000,
                                        448000,
                                        15.4017857142857
                                    ],
                                    "name": "International Trade Administration",
                                    "id": "leaf-58",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        325000,
                                        347000,
                                        -6.34005763688761
                                    ],
                                    "name": "Economic Development Administration",
                                    "id": "leaf-57",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        113000,
                                        97000,
                                        16.4948453608248
                                    ],
                                    "name": "Economic and Statistical Analysis",
                                    "id": "leaf-56",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        111000,
                                        58000,
                                        91.3793103448276
                                    ],
                                    "name": "National Oceanic and Atmospheric Administration",
                                    "id": "leaf-70",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        111000,
                                        100000,
                                        11
                                    ],
                                    "name": "Bureau of Industry and Security",
                                    "id": "leaf-52",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        100000,
                                        100000,
                                        null
                                    ],
                                    "name": "National Institute of Standards and Technology",
                                    "id": "leaf-69",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        95000,
                                        109000,
                                        -12.8440366972477
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-55",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        50000,
                                        109000,
                                        null
                                    ],
                                    "name": "National Telecommunications and Information Administration",
                                    "id": "leaf-62",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        32000,
                                        32000,
                                        0
                                    ],
                                    "name": "Minority Business Development Agency",
                                    "id": "leaf-59",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        30000,
                                        30000,
                                        0
                                    ],
                                    "name": "Bureau of the Census",
                                    "id": "leaf-64",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        20000,
                                        30000,
                                        null
                                    ],
                                    "name": "Economic Development Administration",
                                    "id": "leaf-67",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5000,
                                        5000,
                                        0
                                    ],
                                    "name": "International Trade Administration",
                                    "id": "leaf-68",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        1000,
                                        1000,
                                        0
                                    ],
                                    "name": "Departmental Management",
                                    "id": "leaf-66",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                8284000,
                                null,
                                null
                            ],
                            "name": "Judicial Branch",
                            "id": "branch-25",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        6580000,
                                        6175000,
                                        6.55870445344129
                                    ],
                                    "name": "Courts of Appeals, District Courts, and other Judicial Services",
                                    "id": "leaf-366",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1177000,
                                        1141000,
                                        3.15512708150745
                                    ],
                                    "name": "Courts of Appeals, District Courts, and other Judicial Services",
                                    "id": "leaf-372",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        248000,
                                        197000,
                                        25.8883248730964
                                    ],
                                    "name": "Judicial Retirement Funds",
                                    "id": "leaf-374",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        89000,
                                        83000,
                                        7.2289156626506
                                    ],
                                    "name": "Administrative Office of the United States Courts",
                                    "id": "leaf-365",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        83000,
                                        87000,
                                        -4.59770114942529
                                    ],
                                    "name": "Supreme Court of the United States",
                                    "id": "leaf-368",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        33000,
                                        29000,
                                        13.7931034482759
                                    ],
                                    "name": "United States Court of Appeals for the Federal Circuit",
                                    "id": "leaf-369",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        29000,
                                        27000,
                                        7.40740740740742
                                    ],
                                    "name": "Federal Judicial Center",
                                    "id": "leaf-367",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        21000,
                                        19000,
                                        10.5263157894737
                                    ],
                                    "name": "United States Court of International Trade",
                                    "id": "leaf-370",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        18000,
                                        17000,
                                        5.88235294117647
                                    ],
                                    "name": "United States Sentencing Commission",
                                    "id": "leaf-371",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "United States Court of Appeals for the Federal Circuit",
                                    "id": "leaf-376",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "Supreme Court of the United States",
                                    "id": "leaf-375",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        2000,
                                        2000,
                                        0
                                    ],
                                    "name": "United States Court of International Trade",
                                    "id": "leaf-377",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                7115000,
                                null,
                                null
                            ],
                            "name": "Railroad Retirement Board",
                            "id": "branch-31",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        6945000,
                                        6864000,
                                        1.18006993006994
                                    ],
                                    "name": "Railroad Retirement Board",
                                    "id": "leaf-524",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        170000,
                                        181000,
                                        -6.07734806629834
                                    ],
                                    "name": "Railroad Retirement Board",
                                    "id": "leaf-523",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                5173000,
                                null,
                                null
                            ],
                            "name": "Legislative Branch",
                            "id": "branch-26",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        1334000,
                                        1369000,
                                        -2.55661066471877
                                    ],
                                    "name": "House of Representatives",
                                    "id": "leaf-384",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        971000,
                                        918000,
                                        5.77342047930283
                                    ],
                                    "name": "Senate",
                                    "id": "leaf-389",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        694000,
                                        590000,
                                        17.6271186440678
                                    ],
                                    "name": "Architect of the Capitol",
                                    "id": "leaf-378",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        667000,
                                        642000,
                                        3.89408099688473
                                    ],
                                    "name": "Library of Congress",
                                    "id": "leaf-387",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        557000,
                                        558000,
                                        -0.179211469534046
                                    ],
                                    "name": "Government Accountability Office",
                                    "id": "leaf-382",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        387000,
                                        342000,
                                        13.1578947368421
                                    ],
                                    "name": "Capitol Police",
                                    "id": "leaf-380",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        148000,
                                        148000,
                                        0
                                    ],
                                    "name": "Government Printing Office",
                                    "id": "leaf-383",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        130000,
                                        57000,
                                        128.070175438596
                                    ],
                                    "name": "Legislative Branch Boards and Commissions",
                                    "id": "leaf-386",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        101000,
                                        110000,
                                        -8.18181818181818
                                    ],
                                    "name": "House of Representatives",
                                    "id": "leaf-392",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        60000,
                                        49000,
                                        22.4489795918367
                                    ],
                                    "name": "United States Tax Court",
                                    "id": "leaf-390",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        47000,
                                        45000,
                                        4.44444444444445
                                    ],
                                    "name": "Congressional Budget Office",
                                    "id": "leaf-381",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        33000,
                                        33000,
                                        0
                                    ],
                                    "name": "Senate",
                                    "id": "leaf-396",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        20000,
                                        21000,
                                        -4.76190476190477
                                    ],
                                    "name": "Joint Items",
                                    "id": "leaf-385",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        12000,
                                        11000,
                                        9.09090909090908
                                    ],
                                    "name": "Botanic Garden",
                                    "id": "leaf-379",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        6000,
                                        9000,
                                        -33.3333333333333
                                    ],
                                    "name": "Library of Congress",
                                    "id": "leaf-395",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        5000,
                                        4000,
                                        25
                                    ],
                                    "name": "Office of Compliance",
                                    "id": "leaf-388",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        1000,
                                        4000,
                                        null
                                    ],
                                    "name": "United States Tax Court",
                                    "id": "leaf-397",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                4584000,
                                null,
                                null
                            ],
                            "name": "Corps of Engineers--Civil Works",
                            "id": "branch-2",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        4574000,
                                        5739000,
                                        -20.2997037811465
                                    ],
                                    "name": "Corps of Engineers--Civil Works",
                                    "id": "leaf-3",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        10000,
                                        5739000,
                                        null
                                    ],
                                    "name": "Corps of Engineers--Civil Works",
                                    "id": "leaf-4",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                1070000,
                                null,
                                null
                            ],
                            "name": "District of Columbia",
                            "id": "branch-18",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        603000,
                                        523000,
                                        15.2963671128107
                                    ],
                                    "name": "District of Columbia General and Special Payments",
                                    "id": "leaf-317",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        284000,
                                        316000,
                                        -10.126582278481
                                    ],
                                    "name": "District of Columbia Courts",
                                    "id": "leaf-314",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        174000,
                                        186000,
                                        -6.45161290322581
                                    ],
                                    "name": "District of Columbia General and Special Payments",
                                    "id": "leaf-315",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        9000,
                                        8000,
                                        12.5
                                    ],
                                    "name": "District of Columbia Courts",
                                    "id": "leaf-316",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                915000,
                                null,
                                null
                            ],
                            "name": "Federal Deposit Insurance Corporation",
                            "id": "branch-21",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        855000,
                                        null,
                                        null
                                    ],
                                    "name": "Orderly Liquidation",
                                    "id": "leaf-340",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        45000,
                                        33000,
                                        36.3636363636364
                                    ],
                                    "name": "FDIC_Office of Inspector General",
                                    "id": "leaf-337",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        15000,
                                        27000,
                                        -44.4444444444444
                                    ],
                                    "name": "FSLIC Resolution",
                                    "id": "leaf-339",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                653000,
                                null,
                                null
                            ],
                            "name": "General Services Administration",
                            "id": "branch-23",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        332000,
                                        267000,
                                        24.3445692883895
                                    ],
                                    "name": "General Activities",
                                    "id": "leaf-342",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        286000,
                                        10000,
                                        2760
                                    ],
                                    "name": "Real Property Activities",
                                    "id": "leaf-344",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        13000,
                                        0
                                    ],
                                    "name": "Supply and Technology Activities",
                                    "id": "leaf-348",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        12000,
                                        11000,
                                        9.09090909090908
                                    ],
                                    "name": "General Activities",
                                    "id": "leaf-345",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        10000,
                                        3000,
                                        233.333333333333
                                    ],
                                    "name": "Real Property Activities",
                                    "id": "leaf-347",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                569000,
                                null,
                                null
                            ],
                            "name": "Executive Office of the President",
                            "id": "branch-19",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        116000,
                                        115000,
                                        0.869565217391299
                                    ],
                                    "name": "Office of Administration",
                                    "id": "leaf-323",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        100000,
                                        115000,
                                        null
                                    ],
                                    "name": "Unanticipated Needs",
                                    "id": "leaf-332",
                                    "discretion": "mandatory"
                                },
                                {
                                    "value": [
                                        92000,
                                        93000,
                                        -1.0752688172043
                                    ],
                                    "name": "Office of Management and Budget",
                                    "id": "leaf-324",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        81000,
                                        39000,
                                        107.692307692308
                                    ],
                                    "name": "Unanticipated Needs",
                                    "id": "leaf-330",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        59000,
                                        60000,
                                        -1.66666666666667
                                    ],
                                    "name": "The White House",
                                    "id": "leaf-329",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        51000,
                                        48000,
                                        6.25
                                    ],
                                    "name": "Office of the United States Trade Representative",
                                    "id": "leaf-327",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        23000,
                                        30000,
                                        -23.3333333333333
                                    ],
                                    "name": "Office of National Drug Control Policy",
                                    "id": "leaf-325",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        15000,
                                        17000,
                                        -11.7647058823529
                                    ],
                                    "name": "Executive Residence at the White House",
                                    "id": "leaf-321",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        13000,
                                        12000,
                                        8.33333333333333
                                    ],
                                    "name": "National Security Council and Homeland Security Council",
                                    "id": "leaf-322",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        7000,
                                        7000,
                                        0
                                    ],
                                    "name": "Office of Science and Technology Policy",
                                    "id": "leaf-326",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        5000,
                                        5000,
                                        0
                                    ],
                                    "name": "Special Assistance to the President and the Official Residence",
                                    "id": "leaf-328",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        4000,
                                        4000,
                                        0
                                    ],
                                    "name": "Council of Economic Advisers",
                                    "id": "leaf-319",
                                    "discretion": "discretionary"
                                },
                                {
                                    "value": [
                                        3000,
                                        3000,
                                        0
                                    ],
                                    "name": "Council on Environmental Quality and Office of Environmental Qua",
                                    "id": "leaf-320",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                407000,
                                null,
                                null
                            ],
                            "name": "National Archives and Records Administration",
                            "id": "branch-27",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        407000,
                                        458000,
                                        -11.1353711790393
                                    ],
                                    "name": "National Archives and Records Administration",
                                    "id": "leaf-399",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                32000,
                                null,
                                null
                            ],
                            "name": "Recovery Accountability and Transparency Board",
                            "id": "branch-32",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        32000,
                                        null,
                                        null
                                    ],
                                    "name": "Recovery Act Accountability and Transparency Board",
                                    "id": "leaf-526",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                7000,
                                null,
                                null
                            ],
                            "name": "Access Board",
                            "id": "branch-0",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        7000,
                                        7000,
                                        0
                                    ],
                                    "name": "Architectural and Transportation Barriers Compliance Board",
                                    "id": "leaf-1",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                6000,
                                null,
                                null
                            ],
                            "name": "Committee for Purchase from People Who Are Blind or Severely Dis",
                            "id": "branch-1",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        6000,
                                        5000,
                                        20
                                    ],
                                    "name": "Committee for Purchase from People who are Blind or Severely Dis",
                                    "id": "leaf-2",
                                    "discretion": "discretionary"
                                }
                            ]
                        },
                        {
                            "value": [
                                2000,
                                null,
                                null
                            ],
                            "name": "Federal Financial Institutions Examination Council",
                            "id": "branch-22",
                            "discretion": null,
                            "children": [
                                {
                                    "value": [
                                        2000,
                                        3000,
                                        -33.3333333333333
                                    ],
                                    "name": "Federal Financial Institutions Examination Council Appraisal Sub",
                                    "id": "leaf-341",
                                    "discretion": "mandatory"
                                }
                            ]
                        },
                        {
                            "value": [
                                0,
                                null,
                                null
                            ],
                            "name": "Securities and Exchange Commission",
                            "id": "branch-33",
                            "discretion": null
                        }
                    ];
                        market.hideLoading();

                        var formatUtil;

                        function buildData(mode, originList) {
                            var out = [];

                            for (var i = 0; i < originList.length; i++) {
                                var node = originList[i];
                                var newNode = out[i] = cloneNodeInfo(node);
                                var value = newNode.value;

                                if (!newNode) {
                                    continue;
                                }

                                // Calculate amount per household.
                                value[3] = value[0] / household_america_2012;

                                // if mode === 0 and mode === 2 do nothing
                                if (mode === 1) {
                                    // Set 'Change from 2010' to value[0].
                                    var tmp = value[1];
                                    value[1] = value[0];
                                    value[0] = tmp;
                                }

                                if (node.children) {
                                    newNode.children = buildData(mode, node.children);
                                }
                            }

                            return out;
                        }

                        function cloneNodeInfo(node) {
                            if (!node) {
                                return;
                            }

                            var newNode = {};
                            newNode.name = node.name;
                            newNode.id = node.id;
                            newNode.discretion = node.discretion;
                            newNode.value = (node.value || []).slice();
                            return newNode;
                        }

                        function getLevelOption(mode) {
                            return [
                                {
                                    color: mode === 2
                                        ? [
                                            '#c23531', '#314656', '#61a0a8', '#dd8668',
                                            '#91c7ae', '#6e7074', '#61a0a8', '#bda29a',
                                            '#44525d', '#c4ccd3'
                                        ]
                                        : null,
                                    colorMappingBy: 'id',
                                    itemStyle: {
                                        normal: {
                                            borderWidth: 3,
                                            gapWidth: 3
                                        }
                                    }
                                },
                                {
                                    colorAlpha: mode === 2
                                        ? [0.5, 1] : null,
                                    itemStyle: {
                                        normal: {
                                            gapWidth: 1
                                        }
                                    }
                                }
                            ];
                        }

                        function isValidNumber(num) {
                            return num != null && isFinite(num);
                        }

                        function getTooltipFormatter(mode) {
                            var amountIndex = mode === 1 ? 1 : 0;
                            var amountIndex2011 = mode === 1 ? 0 : 1;

                            return function (info) {
                                var value = info.value;

                                var amount = value[amountIndex];
                                amount = isValidNumber(amount)
                                    ? formatUtil.addCommas(amount * 1000) + '$'
                                    : '-';

                                var amount2011 = value[amountIndex2011];
                                amount2011 = isValidNumber(amount2011)
                                    ? formatUtil.addCommas(amount2011 * 1000) + '$'
                                    : '-';

                                var perHousehold = value[3];
                                perHousehold = isValidNumber(perHousehold)
                                    ? formatUtil.addCommas((+perHousehold.toFixed(4)) * 1000) + '$'
                                    : '-';

                                var change = value[2];
                                change = isValidNumber(change)
                                    ? change.toFixed(2) + '%'
                                    : '-';

                                return [
                                    '<div class="tooltip-title">' + formatUtil.encodeHTML(info.name) + '</div>',
                                    '2012 Amount: &nbsp;&nbsp;' + amount + '<br>',
                                    'Per Household: &nbsp;&nbsp;' + perHousehold + '<br>',
                                    '2011 Amount: &nbsp;&nbsp;' + amount2011 + '<br>',
                                    'Change From 2011: &nbsp;&nbsp;' + change
                                ].join('');
                            };
                        }

                        function createSeriesCommon() {
                            return {
                                type: 'treemap',
                                label: {
                                    show: true,
                                    formatter: "{b}",
                                    normal: {
                                        textStyle: {
                                            ellipsis: true
                                        }
                                    }
                                },
                                itemStyle: {
                                    normal: {
                                        borderColor: 'black'
                                    }
                                },
                                levels: getLevelOption(0)
                            };
                        }

                        formatUtil = echarts.format;
                        var modes = ['2012Budget', '2011Budget', 'Growth'];

                        var option = {
                            title: {
                                left: 'center',
                                text: 'How $3.7 Trillion is Spent',
                                subtext: ''
                            },

                            legend: {
                                data: modes,
                                selectedMode: 'single',
                                top: 40,
                                itemGap: 5
                            },

                            tooltip: {
                                formatter: getTooltipFormatter(0)
                            },

                            series: modes.map(function (mode, idx) {
                                var seriesOpt = createSeriesCommon();
                                seriesOpt.name = mode;
                                seriesOpt.top = 80;
                                seriesOpt.visualDimension = idx === 2 ? 2 : null;
                                seriesOpt.data = buildData(idx, obama_budget_2012);
                                seriesOpt.levels = getLevelOption(idx);
                                return seriesOpt;
                            })
                        };
                        market.setOption(option)
                })
            }
        };
    }])